<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>The payload that configures media management.</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/mediamanagementallowedmedia</string>
	<key>pfm_domain</key>
	<string>com.apple.systemuiserver</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_last_modified</key>
	<date>2025-09-17T09:38:09Z</date>
	<key>pfm_macos_deprecated</key>
	<string>11.0</string>
	<key>pfm_macos_max</key>
	<string>10.15.7</string>
	<key>pfm_macos_min</key>
	<string>10.7</string>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>The payload that configures media management.</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Allowed Media</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.systemuiserver</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the 'TopLevel' value, with an additional appended component. This string must be unique within the profile.

During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.systemuiserver</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs.

During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Mount</string>
				<string>Unmount</string>
				<string>Logout</string>
				<string>Menu Extras</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Logout</key>
				<array>
					<string>logout-eject</string>
				</array>
				<key>Menu Extras</key>
				<array>
					<string>menuExtras</string>
				</array>
				<key>Mount</key>
				<array>
					<string>mount-controls</string>
				</array>
				<key>Unmount</key>
				<array>
					<string>unmount-controls</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The media type dictionary that controls volume mounting.</string>
			<key>pfm_macos_deprecated</key>
			<string>11.0</string>
			<key>pfm_macos_max</key>
			<string>10.15.7</string>
			<key>pfm_macos_min</key>
			<string>10.7</string>
			<key>pfm_name</key>
			<string>mount-controls</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>A string or an array of media action strings. Internally installed SD cards and USB flash drives are included in the hard disk-external category.

This key is the default for media types that don't fall into other categories.</string>
					<key>pfm_name</key>
					<string>harddisk-external</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>External Disk</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A media action string or an array of media action strings.</string>
					<key>pfm_name</key>
					<string>harddisk-internal</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Internal Disk</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A media action string or an array of media action strings.</string>
					<key>pfm_name</key>
					<string>networkdisk</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Network Disk</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A media action string or an array of media action strings.</string>
					<key>pfm_name</key>
					<string>disk-image</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Disk Image</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A media action string or an array of media action strings.</string>
					<key>pfm_name</key>
					<string>bd</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Blu-ray</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A media action string or an array of media action strings.</string>
					<key>pfm_name</key>
					<string>cd</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>CD</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A media action string or an array of media action strings.</string>
					<key>pfm_name</key>
					<string>dvd</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>DVD</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A media action string or an array of media action strings.</string>
					<key>pfm_name</key>
					<string>dvdram</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>DVD-RAM</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A media action string or an array of media action strings.</string>
					<key>pfm_name</key>
					<string>blankbd</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Recordable Blu-ray</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A media action string or an array of media action strings.</string>
					<key>pfm_name</key>
					<string>blankcd</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Recordable CD</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A media action string or an array of media action strings.</string>
					<key>pfm_name</key>
					<string>blankdvd</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Recordable DVD</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Unused; set to an empty string.</string>
					<key>pfm_name</key>
					<string>all-media</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Volume Mount Controls</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The media type dictionary that controls volume unmounting.</string>
			<key>pfm_macos_deprecated</key>
			<string>11.0</string>
			<key>pfm_macos_max</key>
			<string>10.15.7</string>
			<key>pfm_macos_min</key>
			<string>10.7</string>
			<key>pfm_name</key>
			<string>unmount-controls</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>A string or an array of media action strings. Internally installed SD cards and USB flash drives are included in the hard disk-external category.



This key is the default for media types that don't fall into other categories.</string>
					<key>pfm_name</key>
					<string>harddisk-external</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>External Disk</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A media action string or an array of media action strings.</string>
					<key>pfm_name</key>
					<string>harddisk-internal</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Internal Disk</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A media action string or an array of media action strings.</string>
					<key>pfm_name</key>
					<string>networkdisk</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Network Disk</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A media action string or an array of media action strings.</string>
					<key>pfm_name</key>
					<string>disk-image</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Disk Image</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A media action string or an array of media action strings.</string>
					<key>pfm_name</key>
					<string>bd</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Blu-ray</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A media action string or an array of media action strings.</string>
					<key>pfm_name</key>
					<string>cd</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>CD</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A media action string or an array of media action strings.</string>
					<key>pfm_name</key>
					<string>dvd</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>DVD</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A media action string or an array of media action strings.</string>
					<key>pfm_name</key>
					<string>dvdram</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>DVD-RAM</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A media action string or an array of media action strings.</string>
					<key>pfm_name</key>
					<string>blankbd</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Recordable Blu-ray</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A media action string or an array of media action strings.</string>
					<key>pfm_name</key>
					<string>blankcd</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Recordable CD</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A media action string or an array of media action strings.</string>
					<key>pfm_name</key>
					<string>blankdvd</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Recordable DVD</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Unused; set to an empty string.</string>
					<key>pfm_name</key>
					<string>all-media</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Volume Unmount Controls</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The media type dictionary that defines volumes to eject when the user logs out.</string>
			<key>pfm_macos_deprecated</key>
			<string>11.0</string>
			<key>pfm_macos_max</key>
			<string>10.15.7</string>
			<key>pfm_macos_min</key>
			<string>10.7</string>
			<key>pfm_name</key>
			<string>logout-eject</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>A string or an array of media action strings. Internally installed SD cards and USB flash drives are included in the hard disk-external category.

This key is the default for media types that don't fall into other categories.</string>
					<key>pfm_name</key>
					<string>harddisk-external</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>External Disk</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A media action string or an array of media action strings.</string>
					<key>pfm_name</key>
					<string>harddisk-internal</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Internal Disk</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A media action string or an array of media action strings.</string>
					<key>pfm_name</key>
					<string>networkdisk</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Network Disk</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A media action string or an array of media action strings.</string>
					<key>pfm_name</key>
					<string>disk-image</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Disk Image</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A media action string or an array of media action strings.</string>
					<key>pfm_name</key>
					<string>bd</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Blu-ray</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A media action string or an array of media action strings.</string>
					<key>pfm_name</key>
					<string>cd</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>CD</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A media action string or an array of media action strings.</string>
					<key>pfm_name</key>
					<string>dvd</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>DVD</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A media action string or an array of media action strings.</string>
					<key>pfm_name</key>
					<string>dvdram</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>DVD-RAM</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A media action string or an array of media action strings.</string>
					<key>pfm_name</key>
					<string>blankbd</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Recordable Blu-ray</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A media action string or an array of media action strings.</string>
					<key>pfm_name</key>
					<string>blankcd</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Recordable CD</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A media action string or an array of media action strings.</string>
					<key>pfm_name</key>
					<string>blankdvd</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>One of the following values:
* authenticate - User will be authenticated before media is mounted
* read-only - The media will be mounted read-only. Not valid for unmount-controls.
* deny - The media will not be mounted.
* eject - The media will not be mounted and it will be ejected if possible. Note that some volumes are not defined as ejectable, so using the deny key may be the best solution. Not valid for unmount-controls.</string>
							<key>pfm_name</key>
							<string>ActionStringItem</string>
							<key>pfm_range_list</key>
							<array>
								<string>authenticate</string>
								<string>read-only</string>
								<string>deny</string>
								<string>eject</string>
								<string>alert</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Authenticate</string>
								<string>Read-Only</string>
								<string>Deny</string>
								<string>Eject</string>
								<string>Alert</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Recordable DVD</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Unused; set to an empty string.</string>
					<key>pfm_name</key>
					<string>all-media</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Eject on logout</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>List of menu extras to combine with the user's menu bar</string>
			<key>pfm_name</key>
			<string>menuExtras</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>menuExtra</string>
					<key>pfm_range_list</key>
					<array>
						<string>/System/Library/CoreServices/Menu Extras/AirPort.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/Battery.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/Bluetooth.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/Clock.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/Displays.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/DwellControl.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/Eject.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/ExpressCard.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/Ink.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/IrDA.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/PPP.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/PPPoE.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/SafeEjectGPUExtra.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/Script</string>
						<string>/System/Library/CoreServices/Menu Extras/Menu.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/TextInput.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/TimeMachine.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/UniversalAccess.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/User.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/VPN.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/Volume.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/WWAN.menu</string>
						<string>/System/Library/CoreServices/Menu Extras/iChat.menu</string>
					</array>
					<key>pfm_range_list_allow_custom_value</key>
					<true/>
					<key>pfm_title</key>
					<string>Menu Extra Path</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Menu Extras</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_value_unique</key>
			<true/>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>Allowed Media and Menu Bar Extras</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>6</integer>
	<key>pfmx_supported_oses</key>
	<dict>
		<key>macOS</key>
		<dict>
			<key>pfmx_allow_manual_install</key>
			<true/>
			<key>pfmx_deprecated</key>
			<string>11.0</string>
			<key>pfmx_device_channel</key>
			<true/>
			<key>pfmx_introduced</key>
			<string>10.7</string>
			<key>pfmx_multiple</key>
			<false/>
			<key>pfmx_requires_dep</key>
			<false/>
			<key>pfmx_supervised</key>
			<false/>
			<key>pfmx_user_approved_mdm</key>
			<false/>
			<key>pfmx_user_channel</key>
			<true/>
			<key>pfmx_user_enrollment</key>
			<dict>
				<key>pfmx_mode</key>
				<string>forbidden</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
