<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>The payload that configures notifications.</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/notifications/notificationsettingsitem?changes=latest_minor</string>
	<key>pfm_domain</key>
	<string>com.apple.notificationsettings</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>exclusive</string>
	<key>pfm_ios_min</key>
	<string>9.3</string>
	<key>pfm_last_modified</key>
	<date>2025-09-17T09:38:09Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>iOS</string>
	</array>
	<key>pfm_subdomain</key>
	<string>iOS</string>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>The payload that configures notifications.</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Notifications</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.notificationsettings</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the 'TopLevel' value, with an additional appended component. This string must be unique within the profile.

During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.notificationsettings</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs.

During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>An array of notification settings dictionaries.</string>
			<key>pfm_name</key>
			<string>NotificationSettings</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>Notification settings for an app</string>
					<key>pfm_name</key>
					<string>NotificationSettingsItem</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<true/>
							<key>pfm_description</key>
							<string>If 'true', enables notifications for this app.

Available in iOS 9.3 and later and macOS 10.15 and later.</string>
							<key>pfm_ios_min</key>
							<string>9.3</string>
							<key>pfm_name</key>
							<string>NotificationsEnabled</string>
							<key>pfm_title</key>
							<string>Enable Notifications</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The bundle identifier of the app to which to apply these notification settings.

Available in iOS 9.3 and later and macOS 10.15 and later.</string>
							<key>pfm_ios_min</key>
							<string>9.3</string>
							<key>pfm_name</key>
							<string>BundleIdentifier</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>App Bundle Identifier</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>com.domain.app</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<true/>
							<key>pfm_description</key>
							<string>If 'true', enables notifications in the notification center for this app.

Available in iOS 9.3 and later and macOS 10.15 and later.</string>
							<key>pfm_ios_min</key>
							<string>9.3</string>
							<key>pfm_name</key>
							<string>ShowInNotificationCenter</string>
							<key>pfm_title</key>
							<string>Show in Notification Center</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<true/>
							<key>pfm_description</key>
							<string>If 'true', enables notifications on the Lock Screen for this app.

Available in iOS 9.3 and later and macOS 10.15 and later.</string>
							<key>pfm_ios_min</key>
							<string>9.3</string>
							<key>pfm_name</key>
							<string>ShowInLockScreen</string>
							<key>pfm_title</key>
							<string>Show in Lock Screen</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<true/>
							<key>pfm_description</key>
							<string>If 'true', enables notifications in CarPlay for this app.

Available in iOS 12 and later.</string>
							<key>pfm_documentation_url</key>
							<string>https://developer.apple.com/business/documentation/Configuration-Profile-Reference.pdf</string>
							<key>pfm_ios_min</key>
							<string>12.0</string>
							<key>pfm_name</key>
							<string>ShowInCarPlay</string>
							<key>pfm_title</key>
							<string>Show in CarPlay</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<true/>
							<key>pfm_description</key>
							<string>If 'true', enables sounds for this app.</string>
							<key>pfm_ios_min</key>
							<string>9.3</string>
							<key>pfm_name</key>
							<string>SoundsEnabled</string>
							<key>pfm_title</key>
							<string>Sounds Enabled</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<true/>
							<key>pfm_description</key>
							<string>If 'true', enables badges for this app.

Available in iOS 9.3 and later and macOS 10.15 and later.</string>
							<key>pfm_ios_min</key>
							<string>9.3</string>
							<key>pfm_name</key>
							<string>BadgesEnabled</string>
							<key>pfm_title</key>
							<string>Badges Enabled</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<integer>1</integer>
							<key>pfm_description</key>
							<string>The type of alert for notifications for this app:

- '0': None
- '1': Temporary Banner
- '2': Persistent Banner

Available in iOS 9.3 and later and macOS 10.15 and later.</string>
							<key>pfm_ios_min</key>
							<string>9.3</string>
							<key>pfm_name</key>
							<string>AlertType</string>
							<key>pfm_range_list</key>
							<array>
								<integer>0</integer>
								<integer>1</integer>
								<integer>2</integer>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>None</string>
								<string>Banners</string>
								<string>Alerts</string>
							</array>
							<key>pfm_title</key>
							<string>Alert Type</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The type previews for notifications. This key overrides the value at Settings&gt;Notifications&gt;Show Previews.

- '0' - Always: Previews will be shown when the device is locked and unlocked
- '1' - When Unlocked: Previews will only be shown when the device is unlocked
- '2' - Never: Previews will never be shown

Available in iOS 14 and later.</string>
							<key>pfm_ios_min</key>
							<string>14.0</string>
							<key>pfm_name</key>
							<string>PreviewType</string>
							<key>pfm_range_list</key>
							<array>
								<integer>0</integer>
								<integer>1</integer>
								<integer>2</integer>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Always</string>
								<string>When Unlocked</string>
								<string>Never</string>
							</array>
							<key>pfm_title</key>
							<string>Preview Type</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<integer>0</integer>
							<key>pfm_description</key>
							<string>The type of grouping for notifications for this app:

- '0': Automatic: Group notifications into app-specified groups.
- '1': By app: Group notifications into one group.
- '2': Off: Don't group notifications.

Available in iOS 12 and later.</string>
							<key>pfm_documentation_url</key>
							<string>https://developer.apple.com/business/documentation/Configuration-Profile-Reference.pdf</string>
							<key>pfm_ios_min</key>
							<string>12.0</string>
							<key>pfm_name</key>
							<string>GroupingType</string>
							<key>pfm_range_list</key>
							<array>
								<integer>0</integer>
								<integer>1</integer>
								<integer>2</integer>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Automatic - Group notifications app-specific groups</string>
								<string>By App - Group notifications into one group</string>
								<string>Off - Do not group notifications</string>
							</array>
							<key>pfm_title</key>
							<string>Grouping Type</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<false/>
							<key>pfm_description</key>
							<string>If 'true', enables critical alerts that can ignore Do Not Disturb and ringer settings for this app.

Available in iOS 12 and later and macOS 10.15 and later.</string>
							<key>pfm_documentation_url</key>
							<string>https://developer.apple.com/business/documentation/Configuration-Profile-Reference.pdf</string>
							<key>pfm_ios_min</key>
							<string>12.0</string>
							<key>pfm_name</key>
							<string>CriticalAlertEnabled</string>
							<key>pfm_title</key>
							<string>Critical Alert Enabled</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Notification Setting</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Notification Settings</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
	</array>
	<key>pfm_supervised</key>
	<true/>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>Notifications</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>5</integer>
</dict>
</plist>
