<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>The payload that configures Active Directory Certificate settings.</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/activedirectorycertificate</string>
	<key>pfm_domain</key>
	<string>com.apple.ADCertificate.managed</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>exclusive</string>
	<key>pfm_last_modified</key>
	<date>2025-09-17T09:38:09Z</date>
	<key>pfm_macos_min</key>
	<string>10.7</string>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>The payload that configures Active Directory Certificate settings.</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Active Directory Certificate</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.ADCertificate.managed</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile.
During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.ADCertificate.managed</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs.
During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>A user-friendly description of the certification identity.</string>
			<key>pfm_name</key>
			<string>Description</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The fully qualified host name of the CA.</string>
			<key>pfm_name</key>
			<string>CertServer</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Certificate Server</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The name of the certificate authority (CA), which is determined from the common name (CN) of the Active Directory entry. Available in macOS 10.8 and later. Valid values:

- CN=&lt;your CA Name&gt;
- CN='Certification Authorities'
- CN='Public Key Services'
- CN='Services'
- CN='Configuration'
- CN=&lt;your base Domain Name&gt;</string>
			<key>pfm_macos_min</key>
			<string>10.8</string>
			<key>pfm_name</key>
			<string>CertificateAuthority</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Certificate Authority</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>User</string>
			<key>pfm_description</key>
			<string>The certificate template for your environment. The default user certificate value is \'User\'. The default computer certificate value is \'Machine\'.</string>
			<key>pfm_name</key>
			<string>CertTemplate</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Certificate Template</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value is most commonly 'RPC'; if using web enrollment, use 'HTTP'. Available in macOS 10.8 and later.</string>
			<key>pfm_macos_min</key>
			<string>10.8</string>
			<key>pfm_name</key>
			<string>CertificateAcquisitionMechanism</string>
			<key>pfm_range_list</key>
			<array>
				<string>RPC</string>
				<string>HTTP</string>
			</array>
			<key>pfm_title</key>
			<string>Certificate Acquisition Mechanism</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>14</integer>
			<key>pfm_description</key>
			<string>The number of days in advance of certificate expiration that the notification center notifies the user.</string>
			<key>pfm_name</key>
			<string>CertificateRenewalTimeInterval</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Certificate Renewal Time Interval</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>2048</integer>
			<key>pfm_description</key>
			<string>The RSA key size for the certificate signing request (CSR). Available in macOS 10.11 and later.</string>
			<key>pfm_macos_min</key>
			<string>10.11</string>
			<key>pfm_name</key>
			<string>Keysize</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Key Size</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system prompts the user for credentials when is installs the profile. This key applies only to user certificates with the Manual Download profile delivery method. Omit this key for computer certificates. Available in macOS 10.8 and later.</string>
			<key>pfm_macos_min</key>
			<string>10.8</string>
			<key>pfm_name</key>
			<string>PromptForCredentials</string>
			<key>pfm_title</key>
			<string>Prompt for Credentials</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The user name with which to authenticate to the certificate server</string>
			<key>pfm_name</key>
			<string>UserName</string>
			<key>pfm_title</key>
			<string>User name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The password with which to authenticate to the certificate server</string>
			<key>pfm_name</key>
			<string>Password</string>
			<key>pfm_title</key>
			<string>Password</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', gives apps access to the private key. Available in macOS 10.10 and later.</string>
			<key>pfm_macos_min</key>
			<string>10.10</string>
			<key>pfm_name</key>
			<string>AllowAllAppsAccess</string>
			<key>pfm_title</key>
			<string>Allow All Apps Access</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system allows exporting the private key. Available in macOS 10.10 and later.</string>
			<key>pfm_macos_min</key>
			<string>10.10</string>
			<key>pfm_name</key>
			<string>KeyIsExtractable</string>
			<key>pfm_title</key>
			<string>Key Is Extractable</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the certificate obtained with this payload attempts auto-renewal. Auto-renewal can only be used with device Active Directory certificate payloads. Available in macOS 10.13.4 and later.</string>
			<key>pfm_macos_min</key>
			<string>10.13.4</string>
			<key>pfm_name</key>
			<string>EnableAutoRenewal</string>
			<key>pfm_title</key>
			<string>Enable Auto Renewal</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>Active Directory Certificate</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
