<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>The payload that configures an Active Directory (AD) domain.</string>
	<key>pfm_description_reference</key>
	<string>In macOS 10.9 and later, a configuration profile can be used to configure macOS to join an Active Directory (AD) domain. Advanced AD options available via Directory Utility or the dsconfigad command line tool can also be set using a configuration profile, following this procedure:
1. StartwithamacOSDirectorypayload,createdinProfileManager. 
2. Saveanddownloadtheprofilesoyoucanedititmanually.
The following AD configuration keys can be added to the Directory payload, of type com.apple.DirectoryService.managed. 
Note that some settings will only be set if the associated flag key is set to true. Forexample,ADPacketEncryptFlag
must be set to true to set the ADPacketEncrypt key to enable.</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/directoryservice</string>
	<key>pfm_domain</key>
	<string>com.apple.DirectoryService.managed</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>exclusive</string>
	<key>pfm_last_modified</key>
	<date>2025-08-15T19:32:34Z</date>
	<key>pfm_macos_min</key>
	<string>10.8</string>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>The payload that configures an Active Directory (AD) domain.</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Directory Service</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.DirectoryService.managed</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the 'TopLevel' value, with an additional appended component. This string must be unique within the profile.

During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.DirectoryService.managed</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs.

During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The Active Directory domain to join.</string>
			<key>pfm_name</key>
			<string>HostName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Server Hostname</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The user name of the account for the domain.</string>
			<key>pfm_name</key>
			<string>UserName</string>
			<key>pfm_title</key>
			<string>User name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The password of the account for the domain.</string>
			<key>pfm_name</key>
			<string>Password</string>
			<key>pfm_title</key>
			<string>Password</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The client's identifier.</string>
			<key>pfm_documentation_source</key>
			<string></string>
			<key>pfm_name</key>
			<string>ClientID</string>
			<key>pfm_title</key>
			<string>Client ID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The organizational unit to add the joining computer object to.</string>
			<key>pfm_name</key>
			<string>ADOrganizationalUnit</string>
			<key>pfm_title</key>
			<string>ADOrganizationalUnit</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system enables the 'ADCreateMobileAccountAtLogin' key.</string>
			<key>pfm_macos_min</key>
			<string>10.9</string>
			<key>pfm_name</key>
			<string>ADCreateMobileAccountAtLoginFlag</string>
			<key>pfm_title</key>
			<string>Enable ADCreateMobileAccountAtLogin Flag</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>10.9</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADCreateMobileAccountAtLoginFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system creates a mobile account at login.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADCreateMobileAccountAtLoginFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ADCreateMobileAccountAtLogin</string>
			<key>pfm_title</key>
			<string>Create mobile account at login</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system enables the 'ADWarnUserBeforeCreatingMA' key.</string>
			<key>pfm_macos_min</key>
			<string>10.9</string>
			<key>pfm_name</key>
			<string>ADWarnUserBeforeCreatingMAFlag</string>
			<key>pfm_title</key>
			<string>Enable ADWarnUserBeforeCreatingMA Flag</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>10.9</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADWarnUserBeforeCreatingMAFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system enables the warning before creating the mobile account.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADWarnUserBeforeCreatingMAFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ADWarnUserBeforeCreatingMA</string>
			<key>pfm_title</key>
			<string>Require confirmation before creating mobile account</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system enables the 'ADForceHomeLocal' key.</string>
			<key>pfm_macos_min</key>
			<string>10.9</string>
			<key>pfm_name</key>
			<string>ADForceHomeLocalFlag</string>
			<key>pfm_title</key>
			<string>Enable ADForceHomeLocal Flag</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>10.9</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADForceHomeLocalFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system forces a local home directory.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADForceHomeLocalFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ADForceHomeLocal</string>
			<key>pfm_title</key>
			<string>Force local home directory on startup disk</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system enables the 'ADUseWindowsUNCPath' key.</string>
			<key>pfm_macos_min</key>
			<string>10.9</string>
			<key>pfm_name</key>
			<string>ADUseWindowsUNCPathFlag</string>
			<key>pfm_title</key>
			<string>Enable ADUseWindowsUNCPath Flag</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>10.9</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADUseWindowsUNCPathFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system uses the UNC path from Active Directory to derive the network home location.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADUseWindowsUNCPathFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ADUseWindowsUNCPath</string>
			<key>pfm_title</key>
			<string>Use UNC path for network home location</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>smb</string>
			<key>pfm_description</key>
			<string>The network home protocol to use: 'afp' or 'smb'.</string>
			<key>pfm_name</key>
			<string>ADMountStyle</string>
			<key>pfm_range_list</key>
			<array>
				<string>afp</string>
				<string>smb</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>AFP</string>
				<string>SMB</string>
			</array>
			<key>pfm_title</key>
			<string>Mount Style</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system enables the 'ADDefaultUserShell' key.</string>
			<key>pfm_name</key>
			<string>ADDefaultUserShellFlag</string>
			<key>pfm_title</key>
			<string>Enable ADDefaultUserShell Key</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADDefaultUserShellFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_default</key>
			<string>/bin/bash</string>
			<key>pfm_description</key>
			<string>The default user shell.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADDefaultUserShellFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ADDefaultUserShell</string>
			<key>pfm_title</key>
			<string>Default user shell</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system enables the 'ADMapUIDAttribute' key.</string>
			<key>pfm_name</key>
			<string>ADMapUIDAttributeFlag</string>
			<key>pfm_title</key>
			<string>Enable ADMapUIDAttribute Key</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADMapUIDAttributeFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>The map UID to attribute.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADMapUIDAttributeFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ADMapUIDAttribute</string>
			<key>pfm_title</key>
			<string>Map UID to attribute</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system enables the 'ADMapGIDAttribute' key.</string>
			<key>pfm_name</key>
			<string>ADMapGIDAttributeFlag</string>
			<key>pfm_title</key>
			<string>Enable ADMapGIDAttribute Key</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADMapGIDAttributeFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>The map GID to attribute.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADMapGIDAttributeFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ADMapGIDAttribute</string>
			<key>pfm_title</key>
			<string>Map user GID to attribute</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system enables the 'ADMapGGIDAttributeFlag' key.</string>
			<key>pfm_name</key>
			<string>ADMapGGIDAttributeFlag</string>
			<key>pfm_title</key>
			<string>Enable ADMapGGIDAttribute Key</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADMapGGIDAttributeFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>The map group GID to attribute.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADMapGGIDAttributeFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ADMapGGIDAttribute</string>
			<key>pfm_title</key>
			<string>Map group GID to attribute</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system enables the 'ADPreferredDCServer' key.</string>
			<key>pfm_name</key>
			<string>ADPreferredDCServerFlag</string>
			<key>pfm_title</key>
			<string>Enable ADPreferredDCServer Key</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADPreferredDCServerFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>The preferred domain server.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADPreferredDCServerFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ADPreferredDCServer</string>
			<key>pfm_title</key>
			<string>Preferred domain server</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system enables the 'ADDomainAdminGroupList' key.</string>
			<key>pfm_name</key>
			<string>ADDomainAdminGroupListFlag</string>
			<key>pfm_title</key>
			<string>Enable ADDomainAdminGroupList Key</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADDomainAdminGroupListFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>The list of Active Directory groups with admin access.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADDomainAdminGroupListFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ADDomainAdminGroupList</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>An active directory group</string>
					<key>pfm_name</key>
					<string>ADDomainAdminGroupListItem</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>Domain Admin Group Item</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Allow administration by specified Active Directory groups.</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system enables the 'ADAllowMultiDomainAuth' key.</string>
			<key>pfm_macos_min</key>
			<string>10.9</string>
			<key>pfm_name</key>
			<string>ADAllowMultiDomainAuthFlag</string>
			<key>pfm_title</key>
			<string>Enable ADAllowMultiDomainAuth Key</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>10.9</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADAllowMultiDomainAuthFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system allows authentication from any domain in the namespace.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADAllowMultiDomainAuthFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ADAllowMultiDomainAuth</string>
			<key>pfm_title</key>
			<string>Allow authentication from any domain in the forest</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system enables the 'ADNamespace' key.</string>
			<key>pfm_name</key>
			<string>ADNamespaceFlag</string>
			<key>pfm_title</key>
			<string>Enable ADNamespace Key</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADNamespaceFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_default</key>
			<string>domain</string>
			<key>pfm_description</key>
			<string>The primary user account naming convention; either 'forest' or 'domain'.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADNamespaceFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ADNamespace</string>
			<key>pfm_range_list</key>
			<array>
				<string>domain</string>
				<string>forest</string>
			</array>
			<key>pfm_title</key>
			<string>Set primary user account naming convention: "forest" or "domain"</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system enables the 'ADPacketSign' key.</string>
			<key>pfm_macos_min</key>
			<string>10.8</string>
			<key>pfm_name</key>
			<string>ADPacketSignFlag</string>
			<key>pfm_title</key>
			<string>Enable ADPacketSign Key</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>10.8</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADPacketSignFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_default</key>
			<string>allow</string>
			<key>pfm_description</key>
			<string>The packet signing policy.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADPacketSignFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ADPacketSign</string>
			<key>pfm_range_list</key>
			<array>
				<string>allow</string>
				<string>disable</string>
				<string>require</string>
			</array>
			<key>pfm_title</key>
			<string>Packet signing</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system enables the 'ADPacketEncrypt' key.</string>
			<key>pfm_name</key>
			<string>ADPacketEncryptFlag</string>
			<key>pfm_title</key>
			<string>Enable ADPacketEncrypt Key</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADPacketEncryptFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_default</key>
			<string>allow</string>
			<key>pfm_description</key>
			<string>The packet encryption policy.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADPacketEncryptFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ADPacketEncrypt</string>
			<key>pfm_range_list</key>
			<array>
				<string>allow</string>
				<string>disable</string>
				<string>require</string>
				<string>ssl</string>
			</array>
			<key>pfm_title</key>
			<string>Packet encryption</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system enables the 'ADRestrictDDNS' key.</string>
			<key>pfm_name</key>
			<string>ADRestrictDDNSFlag</string>
			<key>pfm_title</key>
			<string>Enable ADRestrictDDNS Key</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADRestrictDDNSFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>An array of strings that represent the interfaces allowed for dynamic DNS updates, such as en0 and en1.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADRestrictDDNSFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_macos_min</key>
			<string>10.8</string>
			<key>pfm_name</key>
			<string>ADRestrictDDNS</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>An interface name which is allowed to make DDNS updates</string>
					<key>pfm_name</key>
					<string>ADRestrictDDNSItem</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>Allowed DDNS Interface Item</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Restrict DDNS on interfaces</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>10.8</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system enables the 'ADTrustChangePassIntervalDays' key.</string>
			<key>pfm_name</key>
			<string>ADTrustChangePassIntervalDaysFlag</string>
			<key>pfm_title</key>
			<string>Enable ADTrustChangePassIntervalDays Key</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADTrustChangePassIntervalDaysFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_default</key>
			<integer>14</integer>
			<key>pfm_description</key>
			<string>The number of days before requiring a change of the computer trust account password. Set to '0' to disable the feature.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ADTrustChangePassIntervalDaysFlag</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ADTrustChangePassIntervalDays</string>
			<key>pfm_title</key>
			<string>Password trust interval</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>days</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The directory service description.</string>
			<key>pfm_name</key>
			<string>Description</string>
			<key>pfm_title</key>
			<string>Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Active Directory</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>1</integer>
	<key>pfmx_supported_oses</key>
	<dict>
		<key>macOS</key>
		<dict>
			<key>pfmx_allow_manual_install</key>
			<true/>
			<key>pfmx_device_channel</key>
			<true/>
			<key>pfmx_introduced</key>
			<string>10.8</string>
			<key>pfmx_multiple</key>
			<true/>
			<key>pfmx_requires_dep</key>
			<false/>
			<key>pfmx_user_approved_mdm</key>
			<false/>
			<key>pfmx_user_channel</key>
			<false/>
			<key>pfmx_user_enrollment</key>
			<dict>
				<key>pfmx_mode</key>
				<string>allowed</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
