<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Configures an app extension to handle SSO.</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/extensiblesinglesignon</string>
	<key>pfm_domain</key>
	<string>com.apple.extensiblesso</string>
	<key>pfm_format_version</key>
	<real>1</real>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_ios_min</key>
	<string>13.0</string>
	<key>pfm_last_modified</key>
	<date>2025-03-03T11:08:08Z</date>
	<key>pfm_macos_min</key>
	<string>10.15</string>
	<key>pfm_platforms</key>
	<array>
		<string>iOS</string>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures an app extension to handle SSO.</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Extensible Single Sign-On</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.extensiblesso</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile.
During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.extensiblesso</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs.
During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The bundle identifier of the app extension that performs SSO for the specified URLs.</string>
			<key>pfm_ios_min</key>
			<string>13.0</string>
			<key>pfm_macos_min</key>
			<string>10.15</string>
			<key>pfm_name</key>
			<string>ExtensionIdentifier</string>
			<key>pfm_range_list</key>
			<array>
				<string>com.apple.AppSSOKerberos.KerberosExtension</string>
				<string>com.microsoft.azureauthenticator.ssoextension</string>
				<string>com.microsoft.CompanyPortalMac.ssoextension</string>
			</array>
			<key>pfm_range_list_allow_custom_value</key>
			<true/>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Extension Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>com.apple.AppSSOKerberos.KerberosExtension</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The type of SSO.</string>
			<key>pfm_ios_min</key>
			<string>13.0</string>
			<key>pfm_macos_min</key>
			<string>10.15</string>
			<key>pfm_name</key>
			<string>Type</string>
			<key>pfm_note</key>
			<string>If ExtensionIdentifier is set to com.apple.AppSSOKerberos.KerberosExtension, this preference must be set to 'Credential'.</string>
			<key>pfm_range_list</key>
			<array>
				<string>Credential</string>
				<string>Redirect</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>com.apple.AppSSOKerberos.KerberosExtension</string>
							</array>
							<key>pfm_target</key>
							<string>ExtensionIdentifier</string>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_platforms</key>
							<array>
								<string>macOS</string>
							</array>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>The team identifier of the app extension.
This key is required on macOS and ignored elsewhere.</string>
			<key>pfm_ios_min</key>
			<string>13.0</string>
			<key>pfm_macos_min</key>
			<string>10.15</string>
			<key>pfm_name</key>
			<string>TeamIdentifier</string>
			<key>pfm_note</key>
			<string>If ExtensionIdentifier is set to com.apple.AppSSOKerberos.KerberosExtension, this preference value must be 'apple'.</string>
			<key>pfm_title</key>
			<string>Team Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
				<key>visionOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>Credential</string>
							</array>
							<key>pfm_target</key>
							<string>Type</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>An array of host or domain names that apps can authenticate through the app extension.
Required for 'Credential' payloads. Ignored for 'Redirect' payloads.
The system:
* Matches host or domain names case-insensitively
* Requires that all the host and domain names of all installed Extensible SSO payloads are unique
Host names that begin with a “.” are wildcard suffixes that match all subdomains; otherwise the host name needs be an exact match.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>Redirect</string>
							</array>
							<key>pfm_target</key>
							<string>Type</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_ios_min</key>
			<string>13.0</string>
			<key>pfm_macos_min</key>
			<string>10.15</string>
			<key>pfm_name</key>
			<string>Hosts</string>
			<key>pfm_note</key>
			<string>Host or domain names are matched case-insensitively, and all the host / domain names of all installed Extensible SSO payloads must be unique.

Hosts that begin with a "." are wildcard suffixes and will match all subdomains, otherwise the host must be an exact match.</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>A host or domain name, with or without a leading dot.</string>
					<key>pfm_name</key>
					<string>hostname</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>Hostname / Domain name</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>com.apple.AppSSOKerberos.KerberosExtension</string>
							</array>
							<key>pfm_target</key>
							<string>ExtensionIdentifier</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>The realm name for 'Credential' payloads. Use proper capitalization for this value. Ignored for 'Redirect' payloads.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>Redirect</string>
							</array>
							<key>pfm_target</key>
							<string>Type</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_ios_min</key>
			<string>13.0</string>
			<key>pfm_macos_min</key>
			<string>10.15</string>
			<key>pfm_name</key>
			<string>Realm</string>
			<key>pfm_note</key>
			<string>If ExtensionIdentifier is set to com.apple.AppSSOKerberos.KerberosExtension, this preference is required. The Kerberos realm, which should be properly capitalized. If in an Active Directory forest, this is the realm where the user logs in.</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>Redirect</string>
							</array>
							<key>pfm_target</key>
							<string>Type</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>An array of URL prefixes of identity providers where the app extension performs SSO.
Required for 'Redirect' payloads. Ignored for 'Credential' payloads.
The URLs need to begin with 'http://' or 'https://'.
The system:
* Matches scheme and host name case-insensitively
* Doesn't allow query parameters and URL fragments
* Requires that the URLs of all installed Extensible SSO payloads are unique</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>Credential</string>
							</array>
							<key>pfm_target</key>
							<string>Type</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_ios_min</key>
			<string>13.0</string>
			<key>pfm_macos_min</key>
			<string>10.15</string>
			<key>pfm_name</key>
			<string>URLs</string>
			<key>pfm_note</key>
			<string>The URLs must begin with http:// or https://, the scheme and host name are matched case-insensitively, query parameters and URL fragments are not allowed, and the URLs of all installed Extensible SSO payloads must be unique.</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>An http or https URL prefix.</string>
					<key>pfm_format</key>
					<string>^https?://.*</string>
					<key>pfm_name</key>
					<string>URL</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>URL</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>http(s)://</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>URLs</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>An array of bundle identifiers of apps that don't use SSO provided by this extension. Available in iOS 15 and later, and macOS 12 and later.</string>
			<key>pfm_ios_min</key>
			<string>15.0</string>
			<key>pfm_macos_min</key>
			<string>12.0</string>
			<key>pfm_name</key>
			<string>DeniedBundleIdentifiers</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>The bundle identifier of the app.</string>
					<key>pfm_name</key>
					<string>bundleIdentifier</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>Bundle Identifier</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Denied Bundle Identifiers</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>15.0</string>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>12.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Cancel</string>
			<key>pfm_description</key>
			<string>If set to 'Cancel', the system cancels authentication requests when the screen is locked. If set to 'DoNotHandle', the request continues without SSO instead. This doesn't apply to requests where 'userInterfaceEnabled' is 'false', or for background URLSession requests. Available in iOS 15 and later, and macOS 12 and later.</string>
			<key>pfm_ios_min</key>
			<string>15.0</string>
			<key>pfm_macos_min</key>
			<string>12.0</string>
			<key>pfm_name</key>
			<string>ScreenLockedBehavior</string>
			<key>pfm_range_list</key>
			<array>
				<string>Cancel</string>
				<string>DoNotHandle</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Cancel</string>
				<string>Do Not Handle</string>
			</array>
			<key>pfm_title</key>
			<string>Screen Locked Behavior</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>15.0</string>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>12.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>com.apple.AppSSOKerberos.KerberosExtension</string>
							</array>
							<key>pfm_target</key>
							<string>ExtensionIdentifier</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>A dictionary of arbitrary data passed through to the app extension.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>com.apple.AppSSOKerberos.KerberosExtension</string>
								<string>com.microsoft.azureauthenticator.ssoextension</string>
								<string>com.microsoft.CompanyPortalMac.ssoextension</string>
							</array>
							<key>pfm_target</key>
							<string>ExtensionIdentifier</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_ios_min</key>
			<string>13.0</string>
			<key>pfm_macos_min</key>
			<string>10.15</string>
			<key>pfm_name</key>
			<string>ExtensionData</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If 'false', the system doesn't allow saving passwords in the keychain.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_min</key>
					<string>13.0</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>allowAutomaticLogin</string>
					<key>pfm_title</key>
					<string>Allow Automatic Login</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If 'false', the system disables password changes. Available in macOS 10.15 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>allowPasswordChange</string>
					<key>pfm_title</key>
					<string>Allow Password Change</string>
					<key>pfm_type</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>visionOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If 'true', the system requires this configuration uses a TGT from Platform SSO instead of requesting a new one. Available in macOS 13 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_macos_min</key>
					<string>13.0</string>
					<key>pfm_name</key>
					<string>usePlatformSSOTGT</string>
					<key>pfm_platforms</key>
					<array>
						<string>macOS</string>
					</array>
					<key>pfm_title</key>
					<string>Use Platform SSO TGT</string>
					<key>pfm_type</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>13.0</string>
						</dict>
						<key>visionOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If 'true' and 'usePlatformSSOTGT' is 'true', the system allows the user to manually sign in. Available in macOS 13 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<true/>
									</array>
									<key>pfm_target</key>
									<string>ExtensionData.usePlatformSSOTGT</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_macos_min</key>
					<string>13.0</string>
					<key>pfm_name</key>
					<string>allowPlatformSSOAuthFallback</string>
					<key>pfm_platforms</key>
					<array>
						<string>macOS</string>
					</array>
					<key>pfm_title</key>
					<string>Allow Platform SSO Authentication Fallback</string>
					<key>pfm_type</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>13.0</string>
						</dict>
						<key>visionOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If 'true', the Kerberos Extension handles Kerberos requests only. It doesn't check for password expiration, show the password expiration in the menu, check for external password changes, perform password sync, or retrieve the home directory. Available in macOS 13 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_min</key>
					<string>16.0</string>
					<key>pfm_macos_min</key>
					<string>13.0</string>
					<key>pfm_name</key>
					<string>performKerberosOnly</string>
					<key>pfm_title</key>
					<string>Perform Kerberos Requests Only</string>
					<key>pfm_type</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>16.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>13.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The GSS name of the Kerberos cache to use. Rarely set by an administrator.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_deprecated</key>
					<string>15.0</string>
					<key>pfm_ios_min</key>
					<string>13.0</string>
					<key>pfm_macos_deprecated</key>
					<string>12.0</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>cacheName</string>
					<key>pfm_title</key>
					<string>Cache Name</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_deprecated</key>
							<string>15.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_deprecated</key>
							<string>12.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default_copy</key>
					<string>com.apple.security.pkcs1@PayloadUUID</string>
					<key>pfm_description</key>
					<string>The PayloadUUID of a PKINIT certificate.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_min</key>
					<string>13.0</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>certificateUUID</string>
					<key>pfm_note</key>
					<string>Add the Certificate PKCS1 payload to have the appropriate value copied to this preference.</string>
					<key>pfm_title</key>
					<string>Certificate UUID</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A list of bundle IDs allowed to access the ticket-granting ticket (TGT).</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_min</key>
					<string>13.0</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>credentialBundleIdACL</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Bundle IDs allowed to access the TGT. These values are case sensitive.</string>
							<key>pfm_name</key>
							<string>credentialBundleIdACLItem</string>
							<key>pfm_title</key>
							<string>Bundle ID</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Credential Bundle ID ACL</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>always</string>
					<key>pfm_description</key>
					<string>This setting affects how other processes use the Kerberos Extension credential. Allowed values:

* 'always': The system always uses the credential if the SPN matches the Kerberos Extension 'Hosts' array and the caller hasn't specified another credential. However, the system won't use the credential if the calling app isn't in the 'credentialBundleIDACL'.
* 'whenNotSpecified': The system only uses the extension credential if the SPN matches the Kerberos Extension 'Hosts' array. However, the system won't use the credential if the calling app isn't in the 'credentialBundleIDACL'.
* 'kerberosDefault': The system uses the default Kerberos processes to select credentials, and normally uses the default Kerberos credential. This is the same as turning off this capability.

Available in macOS 11 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_min</key>
					<string>14.0</string>
					<key>pfm_macos_min</key>
					<string>11.0</string>
					<key>pfm_name</key>
					<string>credentialUseMode</string>
					<key>pfm_note</key>
					<string>always - The extension credential will always be used if the SPN matches the Kerberos Extension Hosts array. The credential will not be used if the calling app is not in the credentialBundleIDACL.

whenNotSpecified - The credential will only be used when another credential has not been specified by the caller and the SPN matches the Kerberos Extensions Hosts array. The credential will not be used if the calling app is not in the credentialBundleIDACL.

kerberosDefault - The default Kerberos processes for selecting credentials is used which normally uses the default Kerberos credential. This is the same as turning off this capability.</string>
					<key>pfm_range_list</key>
					<array>
						<string>always</string>
						<string>whenNotSpecified</string>
						<string>kerberosDefault</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Always</string>
						<string>When Not Specified</string>
						<string>Kerberos Default</string>
					</array>
					<key>pfm_title</key>
					<string>Credential Use Mode</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>14.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>11.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The custom user name label used in the Kerberos extension instead of “Username,” such as “Company ID”. Available in macOS 11 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_min</key>
					<string>14.0</string>
					<key>pfm_macos_min</key>
					<string>11.0</string>
					<key>pfm_name</key>
					<string>customUsernameLabel</string>
					<key>pfm_title</key>
					<string>Custom Username Label</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>14.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>11.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If 'true', the system doesn't prompt the user to setup the Kerberos extension until either the administrator enables it with the 'app-sso' tool or the system receives a Kerberos challenge. Available in macOS 11 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_macos_min</key>
					<string>11.0</string>
					<key>pfm_name</key>
					<string>delayUserSetup</string>
					<key>pfm_title</key>
					<string>Delay User Setup</string>
					<key>pfm_type</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>11.0</string>
						</dict>
						<key>visionOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The text to display to the user at the bottom of the Kerberos login window. You can also use this to display help information or disclaimer text. Available in iOS 14 and later, and macOS 11 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_min</key>
					<string>14.0</string>
					<key>pfm_macos_min</key>
					<string>11.0</string>
					<key>pfm_name</key>
					<string>helpText</string>
					<key>pfm_title</key>
					<string>Help Text</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>14.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>11.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>Specifies whether this is the default realm if there's more than one Kerberos extension configuration.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_min</key>
					<string>14.0</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>isDefaultRealm</string>
					<key>pfm_title</key>
					<string>Is Default Realm</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If 'true', the Kerberos extension allows only managed apps to access and use the credential. This is in addition to the 'credentialBundleIDACL', if you specify that value. Available in iOS 14 and later, and macOS 12 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_min</key>
					<string>14.0</string>
					<key>pfm_macos_min</key>
					<string>12.0</string>
					<key>pfm_name</key>
					<string>includeManagedAppsInBundleIdACL</string>
					<key>pfm_title</key>
					<string>Include Managed Apps in Bundle ID ACL</string>
					<key>pfm_type</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>14.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>12.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If 'true', the Kerberos extension allows the standard Kerberos utilities including 'TicketViewer' and 'klist' to access and use the credential. This is in addition to 'includeManagedAppsInBundleIdACL' or the 'credentialBundleIdACL', if you specify those values. Available in macOS 12 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_macos_min</key>
					<string>12.0</string>
					<key>pfm_name</key>
					<string>includeKerberosAppsInBundleIdACL</string>
					<key>pfm_title</key>
					<string>Include Kerberos Apps in Bundle ID ACL</string>
					<key>pfm_type</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>12.0</string>
						</dict>
						<key>visionOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If 'false', the system requests the credential on the next matching Kerberos challenge or network state change. If the credential is expired or missing, the system creates a new one. Available in macOS 11 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_macos_min</key>
					<string>11.0</string>
					<key>pfm_name</key>
					<string>monitorCredentialsCache</string>
					<key>pfm_title</key>
					<string>Monitor Credential Cache</string>
					<key>pfm_type</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>11.0</string>
						</dict>
						<key>visionOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The principal (username) to use. You don't need to include the realm.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_min</key>
					<string>14.0</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>principalName</string>
					<key>pfm_title</key>
					<string>Principal Name</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The ordered list of preferred Key Distribution Centers (KDCs) to use for Kerberos traffic. Use this if the servers aren't discoverable through DNS. If the servers are specified, then the system uses them for both connectivity checks and attempts to use them first for Kerberos traffic. If the servers don't respond, the device falls back to DNS discovery. Format each entry the same as it would be in a 'krb5.conf' file, for example:
* 'adserver1.example.com'
* 'tcp/adserver1.example.com:88'
* 'kkdcp://kerberosproxy.example.com:443/kkdcp'</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_format</key>
					<string>^((kkdcp:\/\/)|(tcp\/))?[^:\/]+(:\d+)?(\/[^:]*)?$</string>
					<key>pfm_ios_min</key>
					<string>15.0</string>
					<key>pfm_macos_min</key>
					<string>12.0</string>
					<key>pfm_name</key>
					<string>preferredKDCs</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>A host or domain name in the format of [protocol/]hostname[:port][/path]</string>
							<key>pfm_name</key>
							<string>preferredKDC</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Key Distribution Center</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Preferred KDCs</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>15.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>12.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>This URL will launch in the user's default web browser when they initiate a password change. Available in macOS 10.15 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>pwChangeURL</string>
					<key>pfm_title</key>
					<string>Password Change URL</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>visionOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>15</integer>
					<key>pfm_description</key>
					<string>The number of days prior to password expiration when the system sends a notification of password expiration to the user. Available in macOS 10.15 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>pwNotificationDays</string>
					<key>pfm_title</key>
					<string>Password Notification Days</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_unit</key>
					<string>days</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>visionOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The number of days that the system allows using passwords on this domain. For most domains, this calculation is automatic. Available in macOS 10.15 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_macos_deprecated</key>
					<string>12.0</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>pwExpireOverride</string>
					<key>pfm_title</key>
					<string>Password Expiration Override</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_unit</key>
					<string>days</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_deprecated</key>
							<string>12.0</string>
						</dict>
						<key>visionOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If 'true', the system requires passwords to meet Active Directory's definition of 'complex'. Available in macOS 10.15 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>pwReqComplexity</string>
					<key>pfm_title</key>
					<string>Password Requirement Complexity</string>
					<key>pfm_type</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>visionOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The number of prior passwords that the system disallows reuse on this domain. Available in macOS 10.15 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>pwReqHistory</string>
					<key>pfm_title</key>
					<string>Password Requirement History</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_unit</key>
					<string>prior passwords</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>visionOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The minimum length of passwords on the domain.Available in macOS 10.15 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>pwReqLength</string>
					<key>pfm_title</key>
					<string>Password Requirement Length</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_unit</key>
					<string>characters</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>visionOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The minimum age of passwords before the system allows changing them on this domain. Available in macOS 10.15 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>pwReqMinAge</string>
					<key>pfm_title</key>
					<string>Password Requirement Minimum Age</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_unit</key>
					<string>days</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>visionOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The text version of the domain's password requirements. Only for use if 'pwReqComplexity' or 'pwReqLength' aren't specified. Available in macOS 10.15 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>pwReqText</string>
					<key>pfm_title</key>
					<string>Password Requirement Text</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>visionOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The RTF file formatted version of the domain's password requirements. Only for use if 'pwReqComplexity' or 'pwReqLength' aren't specified. Available in macOS 15 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<true/>
									</array>
									<key>pfm_target</key>
									<string>ExtensionData.pwReqComplexity</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_target</key>
									<string>ExtensionData.pwReqLength</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_macos_min</key>
					<string>15.0</string>
					<key>pfm_name</key>
					<string>pwReqRTFData</string>
					<key>pfm_platforms</key>
					<array>
						<string>macOS</string>
					</array>
					<key>pfm_type</key>
					<string>data</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>15.0</string>
						</dict>
						<key>visionOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>900</integer>
					<key>pfm_description</key>
					<string>The time, in seconds, required to replicate changes in the Active Directory domain. The Kerberos extension uses this when checking password age after a change. Available in macOS 11 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_macos_deprecated</key>
					<string>12.0</string>
					<key>pfm_macos_min</key>
					<string>11.0</string>
					<key>pfm_name</key>
					<string>replicationTime</string>
					<key>pfm_title</key>
					<string>Replication Time</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_unit</key>
					<string>seconds</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_deprecated</key>
							<string>12.0</string>
							<key>pfmx_introduced</key>
							<string>11.0</string>
						</dict>
						<key>visionOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>Require that LDAP connections use TLS. Available in macOS 11 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_min</key>
					<string>14.0</string>
					<key>pfm_macos_min</key>
					<string>11.0</string>
					<key>pfm_name</key>
					<string>requireTLSForLDAP</string>
					<key>pfm_title</key>
					<string>Require TLS for LDAP</string>
					<key>pfm_type</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>14.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>11.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If 'true', the system requires the user to provide Touch ID, Face ID or their passcode to access the keychain entry.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_min</key>
					<string>14.0</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>requireUserPresence</string>
					<key>pfm_title</key>
					<string>Require User Presence</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The name of the Active Directory site the Kerberos extension should use. Most administrators don't need to modify this value, as the Kerberos extension can normally find the site automatically.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_min</key>
					<string>14.0</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>siteCode</string>
					<key>pfm_title</key>
					<string>Site Code</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If 'false', the system disables password sync. Note that this will not work if the user is logged in with a mobile account. Available in macOS 10.15 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>syncLocalPassword</string>
					<key>pfm_title</key>
					<string>Sync Local Password</string>
					<key>pfm_type</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>visionOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If 'false', the Kerberos extension doesn't automatically use LDAP and DNS to determine its AD site name.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>useSiteAutoDiscovery</string>
					<key>pfm_title</key>
					<string>Use Site Auto Discovery</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A custom domain-realm mapping for Kerberos. The system uses this when the DNS name of hosts doesn't match the realm name. Most administrators don't need to customize this.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>domainRealmMapping</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>The key should be the name of the realm, and the value is an array of DNS suffixes that map to the realm.</string>
							<key>pfm_name</key>
							<string>Realm</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>Domains to map to the realm</string>
									<key>pfm_name</key>
									<string>RealmItem</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_type</key>
							<string>array</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/azure/active-directory/develop/apple-sso-plugin</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.microsoft.azureauthenticator.ssoextension</string>
										<string>com.microsoft.CompanyPortalMac.ssoextension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>Enable_SSO_On_All_ManagedApps</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable SSO on All Managed Apps</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Enable SSO for specific apps</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/azure/active-directory/develop/apple-sso-plugin</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.microsoft.azureauthenticator.ssoextension</string>
										<string>com.microsoft.CompanyPortalMac.ssoextension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>AppAllowList</string>
					<key>pfm_title</key>
					<string>App Allow List</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>com.contoso.workapp, com.contoso.travelapp</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Enable SSO for all apps with a specific bundle ID prefix</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/azure/active-directory/develop/apple-sso-plugin</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.microsoft.azureauthenticator.ssoextension</string>
										<string>com.microsoft.CompanyPortalMac.ssoextension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>AppPrefixAllowList</string>
					<key>pfm_title</key>
					<string>App Prefix Allow List</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>com.contoso., com.fabrikam.</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Disable SSO for specific apps</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/azure/active-directory/develop/apple-sso-plugin</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.microsoft.azureauthenticator.ssoextension</string>
										<string>com.microsoft.CompanyPortalMac.ssoextension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>AppBlockList</string>
					<key>pfm_title</key>
					<string>App Block List</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>com.contoso.studyapp, com.contoso.travelapp</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Enable SSO through cookies for a specific application</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/azure/active-directory/develop/apple-sso-plugin</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.microsoft.azureauthenticator.ssoextension</string>
										<string>com.microsoft.CompanyPortalMac.ssoextension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>AppCookieSSOAllowList</string>
					<key>pfm_title</key>
					<string>App Cookie SSO Allow List</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>com.contoso.studyapp, com.contoso.travelapp</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/azure/active-directory/develop/apple-sso-plugin</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.microsoft.azureauthenticator.ssoextension</string>
										<string>com.microsoft.CompanyPortalMac.ssoextension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>browser_sso_interaction_enabled</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Allow Users to Sign in from Unknown Applications using the Safari Browser</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/azure/active-directory/develop/apple-sso-plugin</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.microsoft.azureauthenticator.ssoextension</string>
										<string>com.microsoft.CompanyPortalMac.ssoextension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>browser_sso_disable_mfa</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Enable</string>
						<string>Disable</string>
					</array>
					<key>pfm_title</key>
					<string>Disable Asking for MFA During Initial Bootstrapping</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/azure/active-directory/develop/apple-sso-plugin</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.microsoft.azureauthenticator.ssoextension</string>
										<string>com.microsoft.CompanyPortalMac.ssoextension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>disable_explicit_app_prompt</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Enable</string>
						<string>Disable</string>
					</array>
					<key>pfm_title</key>
					<string>Disable OAuth2 Application Prompts</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/azure/active-directory/develop/apple-sso-plugin</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.microsoft.azureauthenticator.ssoextension</string>
										<string>com.microsoft.CompanyPortalMac.ssoextension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>disable_explicit_app_prompt_and_autologin</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Enable</string>
						<string>Disable</string>
					</array>
					<key>pfm_title</key>
					<string>Disable OAuth2 Application Prompts and Autologin</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A string with wildcards that can use used to filter the list of available SmartCards by issuer. e.g “*My CA2*”. If there is one remaining, it will be auto-selected. If there more than one remaining, then the list is shorter. Available in macOS 15 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_macos_min</key>
					<string>15.0</string>
					<key>pfm_name</key>
					<string>identityIssuerAutoSelectFilter</string>
					<key>pfm_platforms</key>
					<array>
						<string>macOS</string>
					</array>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>15.0</string>
						</dict>
						<key>visionOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If 'true', allow the user to switch the user interface to SmartCard mode. Available in macOS 15 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_macos_min</key>
					<string>15.0</string>
					<key>pfm_name</key>
					<string>allowSmartCard</string>
					<key>pfm_platforms</key>
					<array>
						<string>macOS</string>
					</array>
					<key>pfm_type</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>15.0</string>
						</dict>
						<key>visionOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If 'true', allow the user to switch the user interface to Password mode. Available in macOS 15 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_macos_min</key>
					<string>15.0</string>
					<key>pfm_name</key>
					<string>allowPassword</string>
					<key>pfm_platforms</key>
					<array>
						<string>macOS</string>
					</array>
					<key>pfm_type</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>15.0</string>
						</dict>
						<key>visionOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If 'true', the user interface will start in SmartCard mode. Available in macOS 15 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.apple.AppSSOKerberos.KerberosExtension</string>
									</array>
									<key>pfm_target</key>
									<string>ExtensionIdentifier</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_macos_min</key>
					<string>15.0</string>
					<key>pfm_name</key>
					<string>startInSmartCardMode</string>
					<key>pfm_platforms</key>
					<array>
						<string>macOS</string>
					</array>
					<key>pfm_type</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>15.0</string>
						</dict>
						<key>visionOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Kerberos Extension Data</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The Platform SSO authentication method the extension uses. Requires that the SSO Extension also supports the method. Available in macOS 13 and later, and deprecated in macOS 14.</string>
			<key>pfm_macos_deprecated</key>
			<string>14.0</string>
			<key>pfm_macos_min</key>
			<string>13.0</string>
			<key>pfm_name</key>
			<string>AuthenticationMethod</string>
			<key>pfm_platforms</key>
			<array>
				<string>macOS</string>
			</array>
			<key>pfm_range_list</key>
			<array>
				<string>Password</string>
				<string>UserSecureEnclaveKey</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Password</string>
				<string>User Secure Enclave Key</string>
			</array>
			<key>pfm_title</key>
			<string>Authentication Method</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_deprecated</key>
					<string>14.0</string>
					<key>pfmx_introduced</key>
					<string>13.0</string>
				</dict>
				<key>visionOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The dictionary to configure Platform SSO.</string>
			<key>pfm_macos_min</key>
			<string>14.0</string>
			<key>pfm_name</key>
			<string>PlatformSSO</string>
			<key>pfm_platforms</key>
			<array>
				<string>macOS</string>
			</array>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>The Platform SSO authentication method to use with the extension. Requires that the SSO Extension also support the method.</string>
					<key>pfm_name</key>
					<string>AuthenticationMethod</string>
					<key>pfm_range_list</key>
					<array>
						<string>Password</string>
						<string>UserSecureEnclaveKey</string>
						<string>SmartCard</string>
					</array>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If 'true', the system uses the same signing and encryption keys for all users. Only supported on the device channel.</string>
					<key>pfm_name</key>
					<string>UseSharedDeviceKeys</string>
					<key>pfm_type</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_user_channel</key>
							<false/>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The display name for the account in notifications and authentication requests.</string>
					<key>pfm_name</key>
					<string>AccountDisplayName</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>64800</integer>
					<key>pfm_description</key>
					<string>The duration, in seconds, until the system requires a full login instead of a refresh. The default value is 64,800 (18 hours). The minimum value is 3600 (1 hour).</string>
					<key>pfm_name</key>
					<string>LoginFrequency</string>
					<key>pfm_range_min</key>
					<integer>3600</integer>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>Enables creating new users at the login window with an 'AuthenticationMethod' of either 'Password' or 'SmartCard'. Requires that 'UseSharedDeviceKeys' is 'true'.</string>
					<key>pfm_name</key>
					<string>EnableCreateUserAtLogin</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>Enables using identity provider accounts at authorization prompts. Requires that 'UseSharedDeviceKeys' is 'true'. The system assigns groups using 'AdministratorGroups', 'AdditionalGroups', or 'AuthorizationGroups'.</string>
					<key>pfm_name</key>
					<string>EnableAuthorization</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The attribute mapping to use when creating new users or for authorization.</string>
					<key>pfm_name</key>
					<string>TokenToUserMapping</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>The claim name to use for the user's account name.</string>
							<key>pfm_name</key>
							<string>AccountName</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The claim name to use for the user's full name.</string>
							<key>pfm_name</key>
							<string>FullName</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The permission to apply to newly created accounts at login. Allowed values:

* 'Standard': The account is a standard user.
* 'Admin': The system adds the account to the local administrators group.
* 'Groups': The system assigns group to the account using 'AdministratorGroups', 'AdditionalGroups', or 'AuthorizationGroups'.</string>
					<key>pfm_name</key>
					<string>NewUserAuthorizationMode</string>
					<key>pfm_range_list</key>
					<array>
						<string>Standard</string>
						<string>Admin</string>
						<string>Groups</string>
					</array>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The permission to apply to an account each time the user authenticates. Allowed values:

* 'Standard': The account is a standard user.
* 'Admin': The system adds the account to the local administrators group.
* 'Groups': The system assigns group to the account using 'AdministratorGroups', 'AdditionalGroups', or 'AuthorizationGroups'.</string>
					<key>pfm_name</key>
					<string>UserAuthorizationMode</string>
					<key>pfm_range_list</key>
					<array>
						<string>Standard</string>
						<string>Admin</string>
						<string>Groups</string>
					</array>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The list of groups to use for administrator access. The system requests membership during authentication.</string>
					<key>pfm_name</key>
					<string>AdministratorGroups</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>The group name.</string>
							<key>pfm_name</key>
							<string>Group</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The list of created groups that don't have administrator access.</string>
					<key>pfm_name</key>
					<string>AdditionalGroups</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>The group name.</string>
							<key>pfm_name</key>
							<string>Group</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The pairing of Authorization Rights to group names. The system updates the Authorization Right to use the group when used.</string>
					<key>pfm_name</key>
					<string>AuthorizationGroups</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string></string>
							<key>pfm_name</key>
							<string>{{key}}</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The key is an access right value, the value is the group to be associated with that access right.</string>
							<key>pfm_name</key>
							<string>{{value}}</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The policy to apply when using Platform SSO at FileVault unlock on Apple Silicon Macs. Applies when 'AuthenticationMethod' is 'Password'. Available in macOS 15 and later.</string>
					<key>pfm_macos_min</key>
					<string>15.0</string>
					<key>pfm_name</key>
					<string>FileVaultPolicy</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>* AttemptAuthentication
    Platform SSO authentication is attempted before proceeding. If offline, unlock will continue
    if the local account password matches. If online and the credential is incorrect, then a
    successful Platform SSO authentication is required to proceed, even if taken offline.
* RequireAuthentication
    Platform SSO authentication is required before proceeding.  If the device is offline and
    `AllowOfflineGracePeriod` is enabled, then the offline `OfflineGracePeriod` is used to determine
    if the user can proceed or not. If online and the credential is incorrect, then a valid Platform
    SSO authentication is required to proceed regardless of the `OfflineGracePeriod`. If the account
    is not registered for Platform SSO and `AllowAuthenticationGracePeriod` is enabled, then the
    `AuthenticationGracePeriod` is used to determine if the user can proceed or not.
* AllowOfflineGracePeriod
    Allow the use of the `OfflineGracePeriod` when `RequireAuthentication` is enabled.  If
    `AllowOfflineGracePeriod` is not set, then offline access is denied.
* AllowAuthenticationGracePeriod
    Allow the use of the `AuthenticationGracePeriod` for other local accounts when `RequireAuthentication`
    is enabled. The `AuthenticationGracePeriod` starts when any of the policies have been updated. If
    `AllowAuthenticationGracePeriod` is not set, then unregistered account access is denied.</string>
							<key>pfm_name</key>
							<string>policy</string>
							<key>pfm_range_list</key>
							<array>
								<string>AttemptAuthentication</string>
								<string>RequireAuthentication</string>
								<string>AllowOfflineGracePeriod</string>
								<string>AllowAuthenticationGracePeriod</string>
							</array>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>15.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The policy to apply when using Platform SSO at the login window. Applies when 'AuthenticationMethod' is 'Password'. Available in macOS 15 and later.</string>
					<key>pfm_macos_min</key>
					<string>15.0</string>
					<key>pfm_name</key>
					<string>LoginPolicy</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>* AttemptAuthentication
    Platform SSO authentication is attempted before proceeding. If offline, unlock will continue
    if the local account password matches. If online and the credential is incorrect, then a
    successful Platform SSO authentication is required to proceed, even if taken offline.
* RequireAuthentication
    Platform SSO authentication is required before proceeding.  If the device is offline and
    `AllowOfflineGracePeriod` is enabled, then the offline `OfflineGracePeriod` is used to determine
    if the user can proceed or not. If online and the credential is incorrect, then a valid Platform
    SSO authentication is required to proceed regardless of the `OfflineGracePeriod`. If the account
    is not registered for Platform SSO and `AllowAuthenticationGracePeriod` is enabled, then the
    `AuthenticationGracePeriod` is used to determine if the user can proceed or not.
* AllowOfflineGracePeriod
    Allow the use of the `OfflineGracePeriod` when `RequireAuthentication` is enabled.  If
    `AllowOfflineGracePeriod` is not set, then offline access is denied.
* AllowAuthenticationGracePeriod
    Allow the use of the `AuthenticationGracePeriod` for other local accounts when `RequireAuthentication`
    is enabled. The `AuthenticationGracePeriod` starts when any of the policies have been updated. If
    `AllowAuthenticationGracePeriod` is not set, then unregistered account access is denied.</string>
							<key>pfm_name</key>
							<string>policy</string>
							<key>pfm_range_list</key>
							<array>
								<string>AttemptAuthentication</string>
								<string>RequireAuthentication</string>
								<string>AllowOfflineGracePeriod</string>
								<string>AllowAuthenticationGracePeriod</string>
							</array>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>15.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The policy to apply when using Platform SSO at screensaver unlock. Applies when 'AuthenticationMethod' is 'Password'. Available in macOS 15 and later.</string>
					<key>pfm_macos_min</key>
					<string>15.0</string>
					<key>pfm_name</key>
					<string>UnlockPolicy</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>* AttemptAuthentication
    Platform SSO authentication is attempted before proceeding. If offline, unlock will continue
    if the local account password matches. If online and the credential is incorrect, then a
    successful Platform SSO authentication is required to proceed, even if taken offline.
* RequireAuthentication
    Platform SSO authentication is required before proceeding.  If the device is offline and
    `AllowOfflineGracePeriod` is enabled, then the offline `OfflineGracePeriod` is used to determine
    if the user can proceed or not. If online and the credential is incorrect, then a valid Platform
    SSO authentication is required to proceed regardless of the `OfflineGracePeriod`. If the account
    is not registered for Platform SSO and `AllowAuthenticationGracePeriod` is enabled, then the
    `AuthenticationGracePeriod` is used to determine if the user can proceed or not.
* AllowOfflineGracePeriod
    Allow the use of the `OfflineGracePeriod` when `RequireAuthentication` is enabled.  If
    `AllowOfflineGracePeriod` is not set, then offline access is denied.
* AllowAuthenticationGracePeriod
    Allow the use of the `AuthenticationGracePeriod` for other local accounts when `RequireAuthentication`
    is enabled. The `AuthenticationGracePeriod` starts when any of the policies have been updated. If
    `AllowAuthenticationGracePeriod` is not set, then unregistered account access is denied.
* AllowTouchIDOrWatchForUnlock
    Allow TouchID or Watch to unlock the screensaver instead of Platform SSO authentication when
    `RequireAuthentication` is enabled.</string>
							<key>pfm_name</key>
							<string>policy</string>
							<key>pfm_range_list</key>
							<array>
								<string>AttemptAuthentication</string>
								<string>RequireAuthentication</string>
								<string>AllowOfflineGracePeriod</string>
								<string>AllowAuthenticationGracePeriod</string>
								<string>AllowTouchIDOrWatchForUnlock</string>
							</array>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>15.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The amount of time after the last successful Platform SSO login a local account password can be used offline. Required when 'AllowOfflineGracePeriod' is set. Available in macOS 15 and later.</string>
					<key>pfm_macos_min</key>
					<string>15.0</string>
					<key>pfm_name</key>
					<string>OfflineGracePeriod</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>15.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The amount of time after a 'FileVaultPolicy', 'LoginPolicy', or 'UnlockPolicy' is received or updated that unregistered local accounts can be used. Required when 'AllowAuthenticationGracePeriod' is set. Available in macOS 15 and later.</string>
					<key>pfm_macos_min</key>
					<string>15.0</string>
					<key>pfm_name</key>
					<string>AuthenticationGracePeriod</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>15.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The list of local accounts that aren't subject to the 'FileVaultPolicy', 'LoginPolicy', or 'UnlockPolicy'. The accounts aren't prompted to register for Platform SSO. Available in macOS 15 and later.</string>
					<key>pfm_macos_min</key>
					<string>15.0</string>
					<key>pfm_name</key>
					<string>NonPlatformSSOAccounts</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>A local account username.</string>
							<key>pfm_name</key>
							<string>username</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>15.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If set to true, the device UDID and serial number will be included in Platform SSO attestations.</string>
					<key>pfm_macos_min</key>
					<string>15.4</string>
					<key>pfm_name</key>
					<string>AllowDeviceIdentifiersInAttestation</string>
					<key>pfm_type</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>15.4</string>
						</dict>
					</dict>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>dictionary</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>14.0</string>
				</dict>
				<key>visionOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The token this device uses for registration with Platform SSO. Use it for silent registration with the Identity Provider. Requires that 'PlatformSSO.AuthenticationMethod' isn't empty. Available in macOS 13 and later.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>AuthenticationMethod</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>PlatformSSO.AuthenticationMethod</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_macos_min</key>
			<string>13.0</string>
			<key>pfm_name</key>
			<string>RegistrationToken</string>
			<key>pfm_platforms</key>
			<array>
				<string>macOS</string>
			</array>
			<key>pfm_title</key>
			<string>Registration Token</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>13.0</string>
				</dict>
				<key>visionOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
			</dict>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>Extensible Single Sign-On</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_user_approved</key>
	<true/>
	<key>pfm_version</key>
	<integer>8</integer>
	<key>pfmx_supported_oses</key>
	<dict>
		<key>iOS</key>
		<dict>
			<key>pfmx_allow_manual_install</key>
			<false/>
			<key>pfmx_introduced</key>
			<string>13.0</string>
			<key>pfmx_multiple</key>
			<true/>
			<key>pfmx_shared_ipad</key>
			<dict>
				<key>pfmx_device_channel</key>
				<false/>
				<key>pfmx_mode</key>
				<string>allowed</string>
				<key>pfmx_user_channel</key>
				<true/>
			</dict>
			<key>pfmx_supervised</key>
			<false/>
			<key>pfmx_user_enrollment</key>
			<dict>
				<key>pfmx_mode</key>
				<string>allowed</string>
			</dict>
		</dict>
		<key>macOS</key>
		<dict>
			<key>pfmx_allow_manual_install</key>
			<false/>
			<key>pfmx_device_channel</key>
			<true/>
			<key>pfmx_introduced</key>
			<string>10.15</string>
			<key>pfmx_multiple</key>
			<true/>
			<key>pfmx_requires_dep</key>
			<false/>
			<key>pfmx_supervised</key>
			<false/>
			<key>pfmx_user_approved_mdm</key>
			<true/>
			<key>pfmx_user_channel</key>
			<true/>
			<key>pfmx_user_enrollment</key>
			<dict>
				<key>pfmx_mode</key>
				<string>allowed</string>
			</dict>
		</dict>
		<key>visionOS</key>
		<dict>
			<key>pfmx_allow_manual_install</key>
			<false/>
			<key>pfmx_introduced</key>
			<string>1.1</string>
			<key>pfmx_multiple</key>
			<true/>
			<key>pfmx_supervised</key>
			<false/>
			<key>pfmx_user_enrollment</key>
			<dict>
				<key>pfmx_mode</key>
				<string>allowed</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
