<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Use this section to define settings for VPN access.</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/vpn</string>
	<key>pfm_domain</key>
	<string>com.apple.vpn.managed</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_ios_min</key>
	<string>4.0</string>
	<key>pfm_last_modified</key>
	<date>2025-03-15T16:11:44Z</date>
	<key>pfm_macos_min</key>
	<string>10.7</string>
	<key>pfm_platforms</key>
	<array>
		<string>iOS</string>
		<string>macOS</string>
		<string>tvOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Use this section to define settings for VPN access.</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>VPN</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.vpn.managed</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile.
During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.vpn.managed</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs.
During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>General</string>
				<string>DNS</string>
				<string>Proxies</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>DNS</key>
				<array>
					<string>DNS</string>
				</array>
				<key>General</key>
				<array>
					<string>AlwaysOn</string>
					<string>IKEv2</string>
					<string>IPSec</string>
					<string>IPv4</string>
					<string>PPP</string>
					<string>TransparentProxy</string>
					<string>UserDefinedName</string>
					<string>VendorConfig</string>
					<string>VPN</string>
					<string>VPNSubType</string>
					<string>VPNType</string>
				</array>
				<key>Proxies</key>
				<array>
					<string>Proxies</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The description of the VPN connection that the system displays on the device. Not available in watchOS.</string>
			<key>pfm_name</key>
			<string>UserDefinedName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>User Defined Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>L2TP</string>
			<key>pfm_description</key>
			<string>The type of the VPN, which defines which settings are appropriate for this VPN payload.
If the type is 'VPN' or 'TransparentProxy', then the system requires a value for 'VPNSubType'.
'TransparentProxy' is only available in macOS. 'L2TP' and 'IPSec' aren't available in tvOS. 'AlwaysOn' is only available on iOS and Apple Watch pairing isn't supported with 'AlwaysOn'. For a previously paired Apple Watch, all phone-watch communications cease when 'AlwaysOn' is enabled. Not available in watchOS.</string>
			<key>pfm_name</key>
			<string>VPNType</string>
			<key>pfm_range_list</key>
			<array>
				<string>VPN</string>
				<string>L2TP</string>
				<string>IPSec</string>
				<string>IKEv2</string>
				<string>AlwaysOn</string>
				<string>PPTP</string>
				<string>TransparentProxy</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>VPN (vendor-specific)</string>
				<string>L2TP (no tvOS)</string>
				<string>IPSec (no tvOS)</string>
				<string>IKEv2</string>
				<string>IKEv2 Always-On (supervised iOS only)</string>
				<string>PPTP (removed in iOS 10 and macOS 10.12)</string>
				<string>Transparent Proxy (macOS only)</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>VPN</string>
								<string>TransparentProxy</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>An identifier for a vendor-specified configuration dictionary when the value for 'VPNType' is 'VPN'.
If 'VPNType' is 'VPN', the system requires this field. If the configuration targets a VPN solution that uses a VPN plugin, then this field contains the bundle identifier of the plugin. Here are some examples:
* Cisco AnyConnect: 'com.cisco.anyconnect.applevpn.plugin'
* Juniper SSL: 'net.juniper.sslvpn'
* F5 SSL: 'com.f5.F5-Edge-Client.vpnplugin'
* SonicWALL Mobile Connect: 'com.sonicwall.SonicWALL-SSLVPN.vpnplugin'
* ``Aruba VIA: 'com.arubanetworks.aruba-via.vpnplugin'
If the configuration targets a VPN solution that uses a network extension provider, then this field contains the bundle identifier of the app that contains the provider. Contact the VPN solution vendor for the value of the identifier.
If 'VPNType' is 'IKEv2', then the 'VPNSubType' field is optional and reserved for future use. If it's specified, it needs to contain an empty string.
Not available in watchOS.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>VPN</string>
								<string>TransparentProxy</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>VPNSubType</string>
			<key>pfm_range_list</key>
			<array>
				<string>com.arubanetworks.aruba-via.vpnplugin</string>
				<string>com.checkpoint.CheckPoint-VPN.vpnplugin</string>
				<string>com.cisco.anyconnect.applevpn.plugin</string>
				<string>com.cisco.anyconnect</string>
				<string>com.f5.F5-Edge-Client.vpnplugin</string>
				<string>com.sonicwall.SonicWALL-SSLVPN.vpnplugin</string>
				<string>net.juniper.sslvpn</string>
				<string>net.pulsesecure.PulseSecure.vpnplugin</string>
			</array>
			<key>pfm_range_list_allow_custom_value</key>
			<true/>
			<key>pfm_title</key>
			<string>VPN Subtype</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The dictionary to use when 'VPNType' is 'L2TP' or 'PTPP'. Not available in watchOS.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>PPTP</string>
								<string>L2TP</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>PPP</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
			</array>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>The IP address or host name of VPN server. This key is for use with L2TP and PPTP networks.</string>
					<key>pfm_name</key>
					<string>CommRemoteAddress</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>Remote Address</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The VPN account user name. This key is for use with L2TP and PPTP networks.</string>
					<key>pfm_name</key>
					<string>AuthName</string>
					<key>pfm_require</key>
					<string>push</string>
					<key>pfm_title</key>
					<string>Account Username</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>If 'TokenCard' is '1', use this password for authentication. This key is for use with L2TP and PPTP networks.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_target</key>
									<string>PPP.AuthEAPPlugins</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_target</key>
									<string>PPP.AuthProtocol</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>AuthPassword</string>
					<key>pfm_title</key>
					<string>Account Password</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_target</key>
									<string>PPP.AuthProtocol</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>An array of authentication plugins. For use of RSA SecurID, this array should only have one value: 'EAP-RSA'. This key is for use with L2TP and PPTP networks.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_target</key>
									<string>PPP.AuthPassword</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>AuthEAPPlugins</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<string>EAP-RSA</string>
							<key>pfm_name</key>
							<string>EAPPluginElement</string>
							<key>pfm_range_list</key>
							<array>
								<string>EAP-RSA</string>
								<string>EAP-TLS</string>
								<string>EAP-KRB</string>
							</array>
							<key>pfm_repetition_max</key>
							<integer>1</integer>
							<key>pfm_repetition_min</key>
							<integer>1</integer>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>EAP Plugin</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>EAP Plugins</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_target</key>
									<string>PPP.AuthEAPPlugins</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>An array of authentication protocols. For use of RSA SecurID, this array should have one value, 'EAP'. This key is for use with L2TP and PPTP networks.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_target</key>
									<string>PPP.AuthPassword</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>AuthProtocol</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<string>EAP</string>
							<key>pfm_name</key>
							<string>AuthProtocolElement</string>
							<key>pfm_range_list</key>
							<array>
								<string>EAP</string>
							</array>
							<key>pfm_repetition_max</key>
							<integer>1</integer>
							<key>pfm_repetition_min</key>
							<integer>1</integer>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Auth Protocol</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Protocol</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '1', uses a token card such as an RSA SecurID card for connecting. This key is for use with L2TP networks.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>L2TP</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>TokenCard</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_title</key>
					<string>Use Token Card</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>If '1', enables encryption on the connection. This key is for use with PPTP networks.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>PPTP</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>CCPEnabled</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable CCP</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>If '1' and 'CCPEnabled' is also '1', enables CCPMPPE128 encryption.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>PPTP</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>PPP.CCPEnabled</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>PPP.CCPMPPE128Enabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>CCPMPPE40Enabled</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable CCPMPPE40</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>If '1' and 'CCPEnabled' is also '1', enables CCPMPPE40 encryption.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>PPTP</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>PPP.CCPEnabled</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>PPP.CCPMPPE40Enabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>CCPMPPE128Enabled</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable CCPMPPE128</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '1', disconnects after an on demand connection idles.</string>
					<key>pfm_name</key>
					<string>DisconnectOnIdle</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable Disconnect on Idle</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The length of time to wait before disconnecting an on demand connection</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>PPP.DisconnectOnIdle</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>DisconnectOnIdleTimer</string>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Disconnect on Idle time</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>PPP</string>
			<key>pfm_type</key>
			<string>dictionary</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>tvOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The dictionary to use when 'VPNType' is 'TransparentProxy'. Available in macOS 14 and later.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>TransparentProxy</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_macos_min</key>
			<string>14.0</string>
			<key>pfm_name</key>
			<string>TransparentProxy</string>
			<key>pfm_platforms</key>
			<array>
				<string>macOS</string>
			</array>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<string>TransparentProxy</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_default</key>
					<string>Password</string>
					<key>pfm_description</key>
					<string>The type of authentication method to use: 'Password', 'Certificate', or 'Password+Certificate'.
Available in macOS 14 and later.</string>
					<key>pfm_name</key>
					<string>AuthenticationMethod</string>
					<key>pfm_range_list</key>
					<array>
						<string>Password</string>
						<string>Certificate</string>
						<string>Password+Certificate</string>
					</array>
					<key>pfm_title</key>
					<string>Authentication Method</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The password to use for the account credentials. Only used if 'AuthenticationMethod' is 'Password'.
Available in macOS 14 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>Password</string>
										<string>Password+Certificate</string>
									</array>
									<key>pfm_target</key>
									<string>TransparentProxy.AuthenticationMethod</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>Password</string>
					<key>pfm_title</key>
					<string>Account Password</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The UUID of the identity certificate as the account credential. If 'AuthenticationMethod' is 'Certificate', and extended authentication (EAP) isn't used, this certificate is sent out for IKE client authentication. If extended authentication is used, this certificate can be used for EAP-TLS.
Available in macOS 14 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>Certificate</string>
										<string>Password+Certificate</string>
									</array>
									<key>pfm_target</key>
									<string>TransparentProxy.AuthenticationMethod</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_min</key>
					<string>16.0</string>
					<key>pfm_macos_min</key>
					<string>13.0</string>
					<key>pfm_name</key>
					<string>PayloadCertificateUUID</string>
					<key>pfm_platforms</key>
					<array>
						<string>iOS</string>
						<string>macOS</string>
					</array>
					<key>pfm_title</key>
					<string>PayloadCertificateUUID</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '1', the system brings up the VPN on demand.
Available in macOS 14 and later.</string>
					<key>pfm_name</key>
					<string>OnDemandEnabled</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable VPN On Demand</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Determines when and how the system uses an OnDemand VPN.
Available in macOS 14 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>TransparentProxy.OnDemandEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>OnDemandRules</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>OnDemandRulesElement</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The action to take if this dictionary matches the current network. Possible values are:
* 'Allow': Deprecated. Allow VPN On Demand to connect if triggered.
* 'Connect': Unconditionally initiate a VPN connection on the next network attempt.
* 'Disconnect': Tear down the VPN connection and don't reconnect on demand as long as this dictionary matches.
* 'EvaluateConnection': Evaluate the ActionParameters array for each connection attempt.
* 'Ignore:' Leave any existing VPN connection up, but don't reconnect on demand as long as this dictionary matches.
Only the 'Disconnect' action is available on watchOS 10 and later.</string>
									<key>pfm_name</key>
									<string>Action</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Connect</string>
										<string>Disconnect</string>
										<string>EvaluateConnection</string>
										<string>Ignore</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Allow</string>
										<string>Connect</string>
										<string>Disconnect</string>
										<string>Evaluate Connection</string>
										<string>Ignore</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>On Demand Action</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>An interface type. If specified, this rule matches only if the primary network interface hardware matches the specified type.</string>
									<key>pfm_name</key>
									<string>InterfaceTypeMatch</string>
									<key>pfm_range_list</key>
									<array>
										<string>Ethernet</string>
										<string>WiFi</string>
										<string>Cellular</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Ethernet</string>
										<string>Wi-Fi</string>
										<string>Cellular</string>
									</array>
									<key>pfm_title</key>
									<string>Interface Type Match</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>An array of domain names. This rule matches if any of the domain names in the specified list matches any domain in the device's search domains list.
The system supports a wildcard ('*') prefix. For example, '*.example.com' matches against either 'mydomain.example.com' or 'yourdomain.example.com'.</string>
									<key>pfm_name</key>
									<string>DNSDomainMatch</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_name</key>
											<string>DNSDomainMatchElement</string>
											<key>pfm_title</key>
											<string>DNS Domain Match Element</string>
											<key>pfm_type</key>
											<string>string</string>
											<key>pfm_value_placeholder</key>
											<string>*.example.com</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>DNS Domain Match</string>
									<key>pfm_type</key>
									<string>array</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>An array of IP addresses. This rule matches if any of the network's specified DNS servers match any entry in the array.
The system supports matching with a single wildcard. For example, '17.*' matches any DNS server in the '17.0.0.0/8' subnet.</string>
									<key>pfm_name</key>
									<string>DNSServerAddressMatch</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_name</key>
											<string>DNSServerAddressMatchElement</string>
											<key>pfm_title</key>
											<string>DNS Server Address Match Element</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>DNS Server Address Match</string>
									<key>pfm_type</key>
									<string>array</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>An array of SSIDs to match against the current network. If the network isn't a Wi-Fi network or if the SSID doesn't appear in this array, the match fails.
Omit this key and the corresponding array to match against any SSID.</string>
									<key>pfm_name</key>
									<string>SSIDMatch</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_name</key>
											<string>SSIDMatchElement</string>
											<key>pfm_title</key>
											<string>SSID Match Element</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>SSID Match</string>
									<key>pfm_type</key>
									<string>array</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>A URL to probe. This rule matches when this URL is successfully fetched (returns a '200' HTTP status code) without redirection. Not available in watchOS.</string>
									<key>pfm_name</key>
									<string>URLStringProbe</string>
									<key>pfm_title</key>
									<string>URL String Probe</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>An array of dictionaries that provides rules similar to the 'OnDemandRules' dictionary, but evaluated on each connection instead of when the network changes. This value is only for use with dictionaries in which the 'Action' value is 'EvaluateConnection'. The system evaluates these dictionaries in order and the first dictionary that matches determines the behavior. Not available in watchOS.</string>
									<key>pfm_name</key>
									<string>ActionParameters</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_description</key>
											<string>A dictionary that provides rules similar to the OnDemandRules dictionary, but evaluated on each connection instead of when the network changes. These dictionaries are evaluated in order, and the behavior is determined by the first dictionary that matches.
The keys allowed in each dictionary are described below. Note: This array is used only for dictionaries in which EvaluateConnection is the Action value.</string>
											<key>pfm_name</key>
											<string>ActionParameter</string>
											<key>pfm_subkeys</key>
											<array>
												<dict>
													<key>pfm_description</key>
													<string>Defines the VPN behavior for the specified domains. Allowed values are:
* 'ConnectIfNeeded': The specified domains should trigger a VPN connection attempt if domain name resolution fails, such as when the DNS server indicates that it can't resolve the domain, responds with a redirection to a different server, or fails to respond (timeout).
* 'NeverConnect': The specified domains should never trigger a VPN connection attempt.</string>
													<key>pfm_name</key>
													<string>DomainAction</string>
													<key>pfm_range_list</key>
													<array>
														<string>ConnectIfNeeded</string>
														<string>NeverConnect</string>
													</array>
													<key>pfm_range_list_titles</key>
													<array>
														<string>Connect If Needed</string>
														<string>Never Connect</string>
													</array>
													<key>pfm_require</key>
													<string>always</string>
													<key>pfm_title</key>
													<string>Domain Action</string>
													<key>pfm_type</key>
													<string>string</string>
												</dict>
												<dict>
													<key>pfm_description</key>
													<string>The domains to apply this evaluation.</string>
													<key>pfm_name</key>
													<string>Domains</string>
													<key>pfm_require</key>
													<string>always</string>
													<key>pfm_subkeys</key>
													<array>
														<dict>
															<key>pfm_name</key>
															<string>DomainsElement</string>
															<key>pfm_title</key>
															<string>Domains Element</string>
															<key>pfm_type</key>
															<string>string</string>
														</dict>
													</array>
													<key>pfm_title</key>
													<string>Domains</string>
													<key>pfm_type</key>
													<string>array</string>
												</dict>
												<dict>
													<key>pfm_description</key>
													<string>An array of IP addresses of DNS servers to use for resolving the specified domains. These servers don't need to be part of the device's current network configuration. If these DNS servers aren't reachable, the system establishes a VPN connection. These DNS servers need to be either internal DNS servers or trusted external DNS servers.
This key is valid only if the value of 'DomainAction' is 'ConnectIfNeeded'.</string>
													<key>pfm_name</key>
													<string>RequiredDNSServers</string>
													<key>pfm_subkeys</key>
													<array>
														<dict>
															<key>pfm_name</key>
															<string>RequiredDNSServersElement</string>
															<key>pfm_title</key>
															<string>Required DNS Servers Element</string>
															<key>pfm_type</key>
															<string>string</string>
														</dict>
													</array>
													<key>pfm_title</key>
													<string>Required DNS Servers</string>
													<key>pfm_type</key>
													<string>array</string>
												</dict>
												<dict>
													<key>pfm_description</key>
													<string>An HTTP or HTTPS (preferred) URL to probe, using a GET request. If the URL's hostname can't be resolved, if the server is unreachable, or if the server doesn't respond with a 200 HTTP status code, a VPN connection is established in response.
This key is valid only if the value of 'DomainAction' is 'ConnectIfNeeded'.</string>
													<key>pfm_name</key>
													<string>RequiredURLStringProbe</string>
													<key>pfm_title</key>
													<string>Required URL String Probe</string>
													<key>pfm_type</key>
													<string>string</string>
												</dict>
											</array>
											<key>pfm_title</key>
											<string>Action Parameter</string>
											<key>pfm_type</key>
											<string>dictionary</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>Action Parameters</string>
									<key>pfm_type</key>
									<string>array</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>On Demand Rules Element</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>On Demand Rules</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>packet-tunnel</string>
					<key>pfm_description</key>
					<string>If the value of this key is 'app-proxy', the VPN service tunnels traffic at the application layer. If the value of this key is 'packet-tunnel', the VPN service tunnels traffic at the IP layer.
Available in macOS 14 and later.</string>
					<key>pfm_name</key>
					<string>ProviderType</string>
					<key>pfm_range_list</key>
					<array>
						<string>packet-tunnel</string>
						<string>app-proxy</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Packet Tunnel - Tunnel Traffic at IP Level</string>
						<string>App Proxy - Tunnel Traffic at Application Level</string>
					</array>
					<key>pfm_title</key>
					<string>Tunnel Provider Type</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>If the VPNSubType field contains the bundle identifier of an app that contains multiple VPN providers of the same type (app-proxy or packet-tunnel), then the system uses this field to choose which provider to use for this configuration. If the VPN provider is implemented as a System Extension, then this field is required.
Available in macOS 14 and later.</string>
					<key>pfm_name</key>
					<string>ProviderBundleIdentifier</string>
					<key>pfm_title</key>
					<string>Provider Bundle Identifier</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>If the VPN provider is implemented as a System Extension, then this field is required.
Available in macOS 14 and later.</string>
					<key>pfm_name</key>
					<string>ProviderDesignatedRequirement</string>
					<key>pfm_title</key>
					<string>Provider Designated Requirement</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '1', the VPN disconnects automatically disconnect after a period defined by 'DisconnectOnIdleTimer'.
Available in macOS 14 and later.</string>
					<key>pfm_name</key>
					<string>DisconnectOnIdle</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable Disconnect on Idle</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '1', then all the VPN's non-default routes take precedence over any locally-defined routes. If 'IncludeAllNetworks' is '1', the system ignores the value of 'EnforceRoutes'.
Available in macOS 14 and later.</string>
					<key>pfm_name</key>
					<string>EnforceRoutes</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_title</key>
					<string>Enforce Routes</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The number of seconds before the VPN disconnects. This value is only used if 'DisconnectOnIdle' is '1'.
Available in macOS 14 and later.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>TransparentProxy.DisconnectOnIdle</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>DisconnectOnIdleTimer</string>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Disconnect on Idle time</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A positive integer.
Available in macOS 14 and later.</string>
					<key>pfm_name</key>
					<string>Order</string>
					<key>pfm_title</key>
					<string>Order</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>14.0</string>
						</dict>
					</dict>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>TransparentProxy</string>
			<key>pfm_type</key>
			<string>dictionary</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>14.0</string>
				</dict>
				<key>tvOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
				<key>visionOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The dictionary to use when 'VPNType' is 'IKEv2'.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>IKEv2</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>IKEv2</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>The IP address or host name of the VPN server.</string>
					<key>pfm_name</key>
					<string>RemoteAddress</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>RemoteAddress</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The remote identifier.</string>
					<key>pfm_name</key>
					<string>RemoteIdentifier</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>RemoteIdentifier</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Identifier of the IKEv2 client.</string>
					<key>pfm_name</key>
					<string>LocalIdentifier</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>LocalIdentifier</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>SharedSecret</string>
					<key>pfm_description</key>
					<string>The type of authentication method for the VPN.
To enable EAP-only authentication, set this to 'None' and 'ExtendedAuthEnabled' to '1'. If this is 'None' and the 'ExtendedAuthEnabled' key isn't set, the authentication configuration defaults to 'SharedSecret'.</string>
					<key>pfm_name</key>
					<string>AuthenticationMethod</string>
					<key>pfm_range_list</key>
					<array>
						<string>None</string>
						<string>SharedSecret</string>
						<string>Certificate</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>None</string>
						<string>Shared Secret</string>
						<string>Certificate</string>
					</array>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>AuthenticationMethod</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '1', enables EAP-only authentication.</string>
					<key>pfm_name</key>
					<string>ExtendedAuthEnabled</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>ExtendedAuthEnabled</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The user name to use for authentication.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IKEv2.ExtendedAuthEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>AuthName</string>
					<key>pfm_title</key>
					<string>AuthName</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The password to use for authentication.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IKEv2.ExtendedAuthEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>AuthPassword</string>
					<key>pfm_title</key>
					<string>AuthPassword</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>1.0</string>
					<key>pfm_description</key>
					<string>The minimum TLS version to use with EAP-TLS authentication.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IKEv2.ExtendedAuthEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_min</key>
					<string>11.0</string>
					<key>pfm_macos_min</key>
					<string>10.13</string>
					<key>pfm_name</key>
					<string>TLSMinimumVersion</string>
					<key>pfm_range_list</key>
					<array>
						<string>1.0</string>
						<string>1.1</string>
						<string>1.2</string>
					</array>
					<key>pfm_title</key>
					<string>TLS Minimum Version</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>11.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.13</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>1.2</string>
					<key>pfm_description</key>
					<string>The maximum TLS version to use with EAP-TLS authentication.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IKEv2.ExtendedAuthEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_min</key>
					<string>11.0</string>
					<key>pfm_macos_min</key>
					<string>10.13</string>
					<key>pfm_name</key>
					<string>TLSMaximumVersion</string>
					<key>pfm_range_list</key>
					<array>
						<string>1.0</string>
						<string>1.1</string>
						<string>1.2</string>
					</array>
					<key>pfm_title</key>
					<string>TLS Maximum Version</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>11.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.13</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>If 'AuthenticationMethod' is 'SharedSecret', this value is used for IKE authentication.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>SharedSecret</string>
									</array>
									<key>pfm_target</key>
									<string>IKEv2.AuthenticationMethod</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>SharedSecret</string>
					<key>pfm_title</key>
					<string>SharedSecret</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The UUID of the certificate payload within the same profile to use as the account credential. If the value of 'AuthenticationMethod' is 'Certificate', the system sends this certificate out for IKEv2 machine authentication. If extended authentication (EAP) is used, the system sends this certificate out for EAP-TLS authentication.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>Certificate</string>
									</array>
									<key>pfm_target</key>
									<string>IKEv2.AuthenticationMethod</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IKEv2.ExtendedAuthEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_min</key>
					<string>16.0</string>
					<key>pfm_macos_min</key>
					<string>13.0</string>
					<key>pfm_name</key>
					<string>PayloadCertificateUUID</string>
					<key>pfm_title</key>
					<string>PayloadCertificateUUID</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>RSA</string>
					<key>pfm_description</key>
					<string>The type of 'PayloadCertificateUUID' to use for IKEv2 machine authentication. If this key is included, the system requires a value for 'ServerCertificateIssuerCommonName'.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>Certificate</string>
									</array>
									<key>pfm_target</key>
									<string>IKEv2.AuthenticationMethod</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>CertificateType</string>
					<key>pfm_range_list</key>
					<array>
						<string>RSA</string>
						<string>ECDSA256</string>
						<string>ECDSA384</string>
						<string>ECDSA521</string>
						<string>RSA-PSS</string>
					</array>
					<key>pfm_title</key>
					<string>Certificate Type</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_target</key>
									<string>IKEv2.CertificateType</string>
								</dict>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IKEv2.ExtendedAuthEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>Common Name of the server certificate issuer. If set, this field causes IKE to send a certificate request based on this certificate issuer to the server. This key is required if the 'CertificateType' key is included and the 'ExtendedAuthEnabled' key is '1'.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>Certificate</string>
									</array>
									<key>pfm_target</key>
									<string>IKEv2.AuthenticationMethod</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>ServerCertificateIssuerCommonName</string>
					<key>pfm_title</key>
					<string>ServerCertificateIssuerCommonName</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The common name of the server certificate. The system uses this name to validate the certificate sent by the IKE server. If not set, the system uses the remote identifier to validate the certificate.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>Certificate</string>
									</array>
									<key>pfm_target</key>
									<string>IKEv2.AuthenticationMethod</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>ServerCertificateCommonName</string>
					<key>pfm_title</key>
					<string>ServerCertificateCommonName</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '1', the VPN disconnects automatically after a period defined by 'DisconnectOnIdleTimer'.</string>
					<key>pfm_name</key>
					<string>DisconnectOnIdle</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable Disconnect on Idle</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Only used if 'DisconnectOnIdle' is '1'. The number of seconds before the VPN disconnects. On watchOS, maximum allowed value is 15 seconds</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IKEv2.DisconnectOnIdle</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>DisconnectOnIdleTimer</string>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Disconnect on Idle time</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>Medium</string>
					<key>pfm_description</key>
					<string>One of the following:
* 'None': No keepalive.
* 'Low': Send keepalive every 30 minutes.
* 'Medium': Send keepalive every 10 minutes.
* 'High': Send keepalive every 1 minute.
Not available in watchOS.</string>
					<key>pfm_name</key>
					<string>DeadPeerDetectionRate</string>
					<key>pfm_range_list</key>
					<array>
						<string>None</string>
						<string>Low</string>
						<string>Medium</string>
						<string>High</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>None - keepalive not sent</string>
						<string>Low - keepalive sent every 30 minutes</string>
						<string>Medium - keepalive sent every 10 minutes</string>
						<string>High - keepalive sent every minute</string>
					</array>
					<key>pfm_title</key>
					<string>Dead Peer Detection Rate</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>watchOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '1', the system disables IKEv2 redirect. If not set, the system redirects an IKEv2 connection when it receives a redirect request from the server.</string>
					<key>pfm_ios_min</key>
					<string>9.0</string>
					<key>pfm_name</key>
					<string>DisableRedirect</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Enable</string>
						<string>Disable</string>
					</array>
					<key>pfm_title</key>
					<string>Disable Redirect</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>9.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '1', the system disables MOBIKE.</string>
					<key>pfm_ios_min</key>
					<string>9.0</string>
					<key>pfm_name</key>
					<string>DisableMOBIKE</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Enable</string>
						<string>Disable</string>
					</array>
					<key>pfm_title</key>
					<string>Disable Mobility and Multihoming</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>9.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '1', negotiations should use IKEv2 Configuration Attribute 'INTERNAL_IP4_SUBNET' and 'INTERNAL_IP6_SUBNET'.</string>
					<key>pfm_ios_min</key>
					<string>9.0</string>
					<key>pfm_name</key>
					<string>UseConfigurationAttributeInternalIPSubnet</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Use IPv4 / IPv6 Internal Subnet Attributes</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>9.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '1',  enables Perfect Forward Secrecy (PFS) for IKEv2 Connections.</string>
					<key>pfm_ios_min</key>
					<string>9.0</string>
					<key>pfm_name</key>
					<string>EnablePFS</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable perfect forward secrecy</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>9.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '1', the system performs a certificate revocation check for IKEv2 connections. This is a best-effort revocation check and server response timeouts won't cause it to fail.</string>
					<key>pfm_ios_min</key>
					<string>9.0</string>
					<key>pfm_name</key>
					<string>EnableCertificateRevocationCheck</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable certificate revocation check</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>9.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '1', the system enables a tunnel over cellular data to carry traffic that's eligible for WiFi Assist and also requires VPN.
Enabling fallback requires that the server support multiple tunnels for a single user.
This field is available in iOS 13 and later, and tvOS 17 and later. Not available in watchOS.</string>
					<key>pfm_ios_min</key>
					<string>13.0</string>
					<key>pfm_name</key>
					<string>EnableFallback</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable fallback</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>13.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>watchOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>These parameters apply to Child Security Association unless 'ChildSecurityAssociationParameters' is specified.</string>
					<key>pfm_name</key>
					<string>IKESecurityAssociationParameters</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<string>AES-256</string>
							<key>pfm_description</key>
							<string>The encryption algorithm.</string>
							<key>pfm_name</key>
							<string>EncryptionAlgorithm</string>
							<key>pfm_range_list</key>
							<array>
								<string>DES</string>
								<string>3DES</string>
								<string>AES-128</string>
								<string>AES-256</string>
								<string>AES-128-GCM</string>
								<string>AES-256-GCM</string>
								<string>ChaCha20Poly1305</string>
							</array>
							<key>pfm_title</key>
							<string>EncryptionAlgorithm</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<string>SHA2-256</string>
							<key>pfm_description</key>
							<string>The integrity algorithm.</string>
							<key>pfm_name</key>
							<string>IntegrityAlgorithm</string>
							<key>pfm_range_list</key>
							<array>
								<string>SHA1-96</string>
								<string>SHA1-160</string>
								<string>SHA2-256</string>
								<string>SHA2-384</string>
								<string>SHA2-512</string>
							</array>
							<key>pfm_title</key>
							<string>IntegrityAlgorithm</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<integer>14</integer>
							<key>pfm_description</key>
							<string>The Diffie-Hellman group. For AlwaysOn VPN, minimum allowed Diffie Hellman Group is '14' in iOS 14.2 and later.</string>
							<key>pfm_name</key>
							<string>DiffieHellmanGroup</string>
							<key>pfm_range_list</key>
							<array>
								<integer>1</integer>
								<integer>2</integer>
								<integer>5</integer>
								<integer>14</integer>
								<integer>15</integer>
								<integer>16</integer>
								<integer>17</integer>
								<integer>18</integer>
								<integer>19</integer>
								<integer>20</integer>
								<integer>21</integer>
								<integer>31</integer>
								<integer>32</integer>
							</array>
							<key>pfm_title</key>
							<string>DiffieHellmanGroup</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<integer>1440</integer>
							<key>pfm_description</key>
							<string>The SA lifetime (rekey interval) in minutes.</string>
							<key>pfm_name</key>
							<string>LifeTimeInMinutes</string>
							<key>pfm_range_max</key>
							<integer>1440</integer>
							<key>pfm_range_min</key>
							<integer>10</integer>
							<key>pfm_title</key>
							<string>LifeTimeInMinutes</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>IKESecurityAssociationParameters</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The 'ChildSecurityAssociationParameters' dictionaries.</string>
					<key>pfm_name</key>
					<string>ChildSecurityAssociationParameters</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<string>AES-256</string>
							<key>pfm_description</key>
							<string>The encryption algorithm.</string>
							<key>pfm_name</key>
							<string>EncryptionAlgorithm</string>
							<key>pfm_range_list</key>
							<array>
								<string>DES</string>
								<string>3DES</string>
								<string>AES-128</string>
								<string>AES-256</string>
								<string>AES-128-GCM</string>
								<string>AES-256-GCM</string>
								<string>ChaCha20Poly1305</string>
							</array>
							<key>pfm_title</key>
							<string>EncryptionAlgorithm</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<string>SHA2-256</string>
							<key>pfm_description</key>
							<string>The integrity algorithm.</string>
							<key>pfm_name</key>
							<string>IntegrityAlgorithm</string>
							<key>pfm_range_list</key>
							<array>
								<string>SHA1-96</string>
								<string>SHA1-160</string>
								<string>SHA2-256</string>
								<string>SHA2-384</string>
								<string>SHA2-512</string>
							</array>
							<key>pfm_title</key>
							<string>IntegrityAlgorithm</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<integer>14</integer>
							<key>pfm_description</key>
							<string>The Diffie-Hellman group. For AlwaysOn VPN, minimum allowed Diffie Hellman Group is '14' in iOS 14.2 and later.</string>
							<key>pfm_name</key>
							<string>DiffieHellmanGroup</string>
							<key>pfm_range_list</key>
							<array>
								<integer>1</integer>
								<integer>2</integer>
								<integer>5</integer>
								<integer>14</integer>
								<integer>15</integer>
								<integer>16</integer>
								<integer>17</integer>
								<integer>18</integer>
								<integer>19</integer>
								<integer>20</integer>
								<integer>21</integer>
								<integer>31</integer>
								<integer>32</integer>
							</array>
							<key>pfm_title</key>
							<string>DiffieHellmanGroup</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<integer>1440</integer>
							<key>pfm_description</key>
							<string>The SA lifetime (rekey interval) in minutes.</string>
							<key>pfm_name</key>
							<string>LifeTimeInMinutes</string>
							<key>pfm_range_max</key>
							<integer>1440</integer>
							<key>pfm_range_min</key>
							<integer>10</integer>
							<key>pfm_title</key>
							<string>LifeTimeInMinutes</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>ChildSecurityAssociationParameters</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>1280</integer>
					<key>pfm_description</key>
					<string>The Maximum Transmission Unit (MTU) specifies the maximum size in bytes of each packet that the system sends over the IKEv2 VPN interface. Available in iOS 14 and later, and macOS 11 and later.</string>
					<key>pfm_ios_min</key>
					<string>14.0</string>
					<key>pfm_macos_min</key>
					<string>11.0</string>
					<key>pfm_name</key>
					<string>MTU</string>
					<key>pfm_range_max</key>
					<integer>1400</integer>
					<key>pfm_range_min</key>
					<integer>1280</integer>
					<key>pfm_title</key>
					<string>Maximum Transmission Unit</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>14.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>11.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '1', all the VPN's non-default routes take precedence over any locally-defined routes. If 'IncludeAllNetworks' is '1', the system ignores 'EnforceRoutes'.</string>
					<key>pfm_ios_min</key>
					<string>14.2</string>
					<key>pfm_macos_min</key>
					<string>11.0</string>
					<key>pfm_name</key>
					<string>EnforceRoutes</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_title</key>
					<string>Enforce Routes</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>14.2</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>11.0</string>
						</dict>
						<key>watchOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>1</integer>
					<key>pfm_description</key>
					<string>If '1' and either 'IncludeAllNetworks' or 'EnforceRoutes' are '1', then the system routes local network traffic outside of the VPN. The default for this value is '0' on macOS and '1' on iOS.</string>
					<key>pfm_ios_min</key>
					<string>14.2</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>ExcludeLocalNetworks</string>
					<key>pfm_platforms</key>
					<array>
						<string>iOS</string>
						<string>macOS</string>
					</array>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_title</key>
					<string>Exclude Local Networks</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>14.2</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.15</string>
						</dict>
						<key>tvOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>watchOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '1', then the system routes all network traffic through the VPN, with some controllable exclusions, such as 'ExcludeLocalNetworks', 'ExcludeCellularServices', 'ExcludeAPNs', and 'ExcludeDeviceCommunication' properties. The system always excludes the following traffic from the tunnel:
* Traffic necessary for connecting and maintaining the device's network connection, such as DHCP.
* Traffic necessary for connecting to captive networks.
* Certain cellular services traffic that's not routable over the internet and is instead directly routed to the cellular network. See the 'ExcludeCellularServices' field for more information.
* Network communication with a companion device such as a watchOS device.</string>
					<key>pfm_ios_min</key>
					<string>14.0</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>IncludeAllNetworks</string>
					<key>pfm_platforms</key>
					<array>
						<string>iOS</string>
						<string>macOS</string>
					</array>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_title</key>
					<string>Include All Networks</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>14.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.15</string>
						</dict>
						<key>tvOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>watchOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>1</integer>
					<key>pfm_description</key>
					<string>If '1' and 'IncludeAllNetworks' is '1', the system excludes internet-routable network traffic for cellular services (VoLTE, Wi-Fi Calling, IMS, MMS, Visual Voicemail, etc.) from the tunnel. Note that some cellular carriers route cellular services traffic directly to the carrier network, bypassing the internet. Such cellular services traffic is always excluded from the tunnel.</string>
					<key>pfm_ios_min</key>
					<string>16.4</string>
					<key>pfm_macos_min</key>
					<string>13.3</string>
					<key>pfm_name</key>
					<string>ExcludeCellularServices</string>
					<key>pfm_platforms</key>
					<array>
						<string>iOS</string>
						<string>macOS</string>
					</array>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_title</key>
					<string>Exclude Cellular Services</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>16.4</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>13.3</string>
						</dict>
						<key>tvOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>watchOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>1</integer>
					<key>pfm_description</key>
					<string>If 1 and IncludeAllNetworks is 1, then network traffic used for communicating with devices connected via USB or Wi-Fi is excluded from the tunnel.</string>
					<key>pfm_ios_min</key>
					<string>17.4</string>
					<key>pfm_macos_min</key>
					<string>14.4</string>
					<key>pfm_name</key>
					<string>ExcludeDeviceCommunication</string>
					<key>pfm_platforms</key>
					<array>
						<string>iOS</string>
						<string>macOS</string>
					</array>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_title</key>
					<string>Exclude Device Communication</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>17.4</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>14.4</string>
						</dict>
						<key>tvOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>visionOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>1.1</string>
						</dict>
						<key>watchOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>1</integer>
					<key>pfm_description</key>
					<string>If '1' and 'IncludeAllNetworks' is '1', the system excludes network traffic for the Apple Push Notification service (APNs) from the tunnel.</string>
					<key>pfm_ios_min</key>
					<string>16.4</string>
					<key>pfm_macos_min</key>
					<string>13.3</string>
					<key>pfm_name</key>
					<string>ExcludeAPNs</string>
					<key>pfm_platforms</key>
					<array>
						<string>iOS</string>
						<string>macOS</string>
					</array>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_title</key>
					<string>Exclude APNs</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>16.4</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>13.3</string>
						</dict>
						<key>tvOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>watchOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The password to use for the account credentials. Only used if 'AuthenticationMethod' is 'Password'.</string>
					<key>pfm_name</key>
					<string>Password</string>
					<key>pfm_title</key>
					<string>Account Password</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>If the VPNSubType field contains the bundle identifier of an app that contains multiple VPN providers of the same type (app-proxy or packet-tunnel), then the system uses this field to choose which provider to use for this configuration. If the VPN provider is implemented as a System Extension, then this field is required.</string>
					<key>pfm_name</key>
					<string>ProviderBundleIdentifier</string>
					<key>pfm_title</key>
					<string>Provider Bundle Identifier</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>If the VPN provider is implemented as a System Extension, then this field is required. Available in macOS 10.15 and later, tvOS 17 and later, and watchOS 10 and later.</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>ProviderDesignatedRequirement</string>
					<key>pfm_platforms</key>
					<array>
						<string>macOS</string>
						<string>tvOS</string>
					</array>
					<key>pfm_title</key>
					<string>Provider Designated Requirement</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.15</string>
						</dict>
						<key>visionOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '1', enables VPN up on demand.</string>
					<key>pfm_name</key>
					<string>OnDemandEnabled</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_title</key>
					<string>Enable VPN On Demand</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '1', the system disables the Connect On Demand toggle in Settings for this configuration.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IKEv2.OnDemandEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_min</key>
					<string>14.0</string>
					<key>pfm_name</key>
					<string>OnDemandUserOverrideDisabled</string>
					<key>pfm_platforms</key>
					<array>
						<string>iOS</string>
						<string>tvOS</string>
					</array>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_title</key>
					<string>Prevent users from toggling VPN On Demand</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>14.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A list of rules that determine when and how to use an OnDemand VPN.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IKEv2.OnDemandEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>OnDemandRules</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>OnDemandRulesElement</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The action to take if this dictionary matches the current network. Possible values are:
* 'Allow': Deprecated. Allow VPN On Demand to connect if triggered.
* 'Connect': Unconditionally initiate a VPN connection on the next network attempt.
* 'Disconnect': Tear down the VPN connection and don't reconnect on demand as long as this dictionary matches.
* 'EvaluateConnection': Evaluate the ActionParameters array for each connection attempt.
* 'Ignore:' Leave any existing VPN connection up, but don't reconnect on demand as long as this dictionary matches.
Only the 'Disconnect' action is available on watchOS 10 and later.</string>
									<key>pfm_name</key>
									<string>Action</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Connect</string>
										<string>Disconnect</string>
										<string>EvaluateConnection</string>
										<string>Ignore</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>On Demand Action</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>An array of dictionaries that provides rules similar to the 'OnDemandRules' dictionary, but evaluated on each connection instead of when the network changes. This value is only for use with dictionaries in which the 'Action' value is 'EvaluateConnection'. The system evaluates these dictionaries in order and the first dictionary that matches determines the behavior. Not available in watchOS.</string>
									<key>pfm_name</key>
									<string>ActionParameters</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_description</key>
											<string>A dictionary that provides rules similar to the OnDemandRules dictionary, but evaluated on each connection instead of when the network changes. These dictionaries are evaluated in order, and the behavior is determined by the first dictionary that matches.
The keys allowed in each dictionary are described below. Note: This array is used only for dictionaries in which EvaluateConnection is the Action value.</string>
											<key>pfm_name</key>
											<string>ActionParameter</string>
											<key>pfm_subkeys</key>
											<array>
												<dict>
													<key>pfm_description</key>
													<string>The domains to apply this evaluation.</string>
													<key>pfm_name</key>
													<string>Domains</string>
													<key>pfm_require</key>
													<string>always</string>
													<key>pfm_subkeys</key>
													<array>
														<dict>
															<key>pfm_name</key>
															<string>DomainsElement</string>
															<key>pfm_title</key>
															<string>Domains Element</string>
															<key>pfm_type</key>
															<string>string</string>
														</dict>
													</array>
													<key>pfm_title</key>
													<string>Domains</string>
													<key>pfm_type</key>
													<string>array</string>
												</dict>
												<dict>
													<key>pfm_description</key>
													<string>Defines the VPN behavior for the specified domains. Allowed values are:
* 'ConnectIfNeeded': The specified domains should trigger a VPN connection attempt if domain name resolution fails, such as when the DNS server indicates that it can't resolve the domain, responds with a redirection to a different server, or fails to respond (timeout).
* 'NeverConnect': The specified domains should never trigger a VPN connection attempt.</string>
													<key>pfm_name</key>
													<string>DomainAction</string>
													<key>pfm_range_list</key>
													<array>
														<string>ConnectIfNeeded</string>
														<string>NeverConnect</string>
													</array>
													<key>pfm_require</key>
													<string>always</string>
													<key>pfm_title</key>
													<string>Domain Action</string>
													<key>pfm_type</key>
													<string>string</string>
												</dict>
												<dict>
													<key>pfm_description</key>
													<string>An array of IP addresses of DNS servers to use for resolving the specified domains. These servers don't need to be part of the device's current network configuration. If these DNS servers aren't reachable, the system establishes a VPN connection. These DNS servers need to be either internal DNS servers or trusted external DNS servers.
This key is valid only if the value of 'DomainAction' is 'ConnectIfNeeded'.</string>
													<key>pfm_name</key>
													<string>RequiredDNSServers</string>
													<key>pfm_subkeys</key>
													<array>
														<dict>
															<key>pfm_name</key>
															<string>RequiredDNSServersElement</string>
															<key>pfm_title</key>
															<string>Required DNS Servers Element</string>
															<key>pfm_type</key>
															<string>string</string>
														</dict>
													</array>
													<key>pfm_title</key>
													<string>Required DNS Servers</string>
													<key>pfm_type</key>
													<string>array</string>
												</dict>
												<dict>
													<key>pfm_description</key>
													<string>An HTTP or HTTPS (preferred) URL to probe, using a GET request. If the URL's hostname can't be resolved, if the server is unreachable, or if the server doesn't respond with a 200 HTTP status code, a VPN connection is established in response.
This key is valid only if the value of 'DomainAction' is 'ConnectIfNeeded'.</string>
													<key>pfm_name</key>
													<string>RequiredURLStringProbe</string>
													<key>pfm_title</key>
													<string>Required URL String Probe</string>
													<key>pfm_type</key>
													<string>string</string>
												</dict>
											</array>
											<key>pfm_title</key>
											<string>Action Parameter</string>
											<key>pfm_type</key>
											<string>dictionary</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>Action Parameters</string>
									<key>pfm_type</key>
									<string>array</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>An array of domain names. This rule matches if any of the domain names in the specified list matches any domain in the device's search domains list.
The system supports a wildcard ('*') prefix. For example, '*.example.com' matches against either 'mydomain.example.com' or 'yourdomain.example.com'.</string>
									<key>pfm_name</key>
									<string>DNSDomainMatch</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_name</key>
											<string>DNSDomainMatchElement</string>
											<key>pfm_title</key>
											<string>DNS Domain Match Element</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>DNS Domain Match</string>
									<key>pfm_type</key>
									<string>array</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>An array of IP addresses. This rule matches if any of the network's specified DNS servers match any entry in the array.
The system supports matching with a single wildcard. For example, '17.*' matches any DNS server in the '17.0.0.0/8' subnet.</string>
									<key>pfm_name</key>
									<string>DNSServerAddressMatch</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_name</key>
											<string>DNSServerAddressMatchElement</string>
											<key>pfm_title</key>
											<string>DNS Server Address Match Element</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>DNS Server Address Match</string>
									<key>pfm_type</key>
									<string>array</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>An interface type. If specified, this rule matches only if the primary network interface hardware matches the specified type.</string>
									<key>pfm_name</key>
									<string>InterfaceTypeMatch</string>
									<key>pfm_range_list</key>
									<array>
										<string>Ethernet</string>
										<string>WiFi</string>
										<string>Cellular</string>
									</array>
									<key>pfm_title</key>
									<string>Interface Type Match</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>An array of SSIDs to match against the current network. If the network isn't a Wi-Fi network or if the SSID doesn't appear in this array, the match fails.
Omit this key and the corresponding array to match against any SSID.</string>
									<key>pfm_name</key>
									<string>SSIDMatch</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_name</key>
											<string>SSIDMatchElement</string>
											<key>pfm_title</key>
											<string>SSID Match Element</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>SSID Match</string>
									<key>pfm_type</key>
									<string>array</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>A URL to probe. This rule matches when this URL is successfully fetched (returns a '200' HTTP status code) without redirection. Not available in watchOS.</string>
									<key>pfm_name</key>
									<string>URLStringProbe</string>
									<key>pfm_title</key>
									<string>URL String Probe</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>On Demand Rules Element</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>On Demand Rules</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>1</integer>
					<key>pfm_description</key>
					<string>If '1', enables NAT keepalive offload for Always On VPN IKEv2 connections. The device sends keepalive packets to maintain NAT mappings for IKEv2 connections that have a NAT on the path. It sends keepalive packets at regular intervals when the device is awake. If 'NATKeepAliveOffloadEnable' is '1', the system offloads keepalive packets to hardware while the device is asleep.
NAT keepalive offload has an impact on the battery life due to the extra workload during sleep. The default interval for the keepalive offload packets is 20 seconds over WiFi and 110 seconds over Cellular interface. The default NAT keepalive works well on networks with small NAT mapping timeouts but imposes a potential battery impact. If a network has larger NAT mapping timeouts, larger keepalive intervals may be safely used to minimize battery impact. Modify the keepalive interval through the 'NATKeepAliveInterval' key.</string>
					<key>pfm_ios_min</key>
					<string>9.0</string>
					<key>pfm_name</key>
					<string>NATKeepAliveOffloadEnable</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_title</key>
					<string>NAT Keep Alive Offload Enable</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>9.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>20</integer>
					<key>pfm_description</key>
					<string>The NAT Keepalive interval for Always On VPN IKEv2 connections. This value controls the interval that the device sends keepalive offload packets. The minimum value is 20 seconds. If no key is specified, the default is 20 seconds over Wi-Fi and 110 seconds over a cellular interface.</string>
					<key>pfm_ios_min</key>
					<string>9.0</string>
					<key>pfm_name</key>
					<string>NATKeepAliveInterval</string>
					<key>pfm_title</key>
					<string>NAT Keepalive Interval</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>9.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>packet-tunnel</string>
					<key>pfm_description</key>
					<string>If the value of this key is 'app-proxy', the VPN service tunnels traffic at the application layer. If the value of this key is 'packet-tunnel', the VPN service tunnels traffic at the IP layer.</string>
					<key>pfm_name</key>
					<string>ProviderType</string>
					<key>pfm_range_list</key>
					<array>
						<string>packet-tunnel</string>
						<string>app-proxy</string>
					</array>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The Post-quantum Pre-shared key (PPK) used for this VPN. This key is meant to be used with VPN servers that support RFC 8784. If this key is present PPKIdentifier must also be present.</string>
					<key>pfm_ios_min</key>
					<string>18.0</string>
					<key>pfm_macos_min</key>
					<string>15.0</string>
					<key>pfm_name</key>
					<string>PPK</string>
					<key>pfm_title</key>
					<string>Post-quantum Pre-shared Key</string>
					<key>pfm_tvos_min</key>
					<string>18.0</string>
					<key>pfm_type</key>
					<string>data</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>18.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>15.0</string>
						</dict>
						<key>tvOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>18.0</string>
						</dict>
						<key>visionOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>2.0</string>
						</dict>
						<key>watchOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>11.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The identifier for the Post-quantum Pre-shared key (PPK) used for this VPN. This key is meant to be used with VPN servers that support RFC 8784. If this key is present PPK must also be present.</string>
					<key>pfm_ios_min</key>
					<string>18.0</string>
					<key>pfm_macos_min</key>
					<string>15.0</string>
					<key>pfm_name</key>
					<string>PPKIdentifier</string>
					<key>pfm_title</key>
					<string>Post-quantum Pre-shared Key Identifier</string>
					<key>pfm_tvos_min</key>
					<string>18.0</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>18.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>15.0</string>
						</dict>
						<key>tvOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>18.0</string>
						</dict>
						<key>visionOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>2.0</string>
						</dict>
						<key>watchOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>11.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>1</integer>
					<key>pfm_description</key>
					<string>This key has no effect if PPK and PPKIdentifier are not present. If the value of this key is 1, the VPN will fail to establish if the server does not support RFC 8784 or does not accept the PPK identifier specified in PPKIdentifier.</string>
					<key>pfm_ios_min</key>
					<string>18.0</string>
					<key>pfm_macos_min</key>
					<string>15.0</string>
					<key>pfm_name</key>
					<string>PPKMandatory</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_title</key>
					<string>Post-quantum Pre-shared Key Mandatory</string>
					<key>pfm_tvos_min</key>
					<string>18.0</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>18.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>15.0</string>
						</dict>
						<key>tvOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>18.0</string>
						</dict>
						<key>visionOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>2.0</string>
						</dict>
						<key>watchOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>11.0</string>
						</dict>
					</dict>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>IKEv2</string>
			<key>pfm_type</key>
			<string>dictionary</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>watchOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>10.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The dictionary to use when 'VPNType' is 'AlwaysOn'. Not available in tvOS or watchOS.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>AlwaysOn</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_ios_min</key>
			<string>8.0</string>
			<key>pfm_name</key>
			<string>AlwaysOn</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
			</array>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '1', allows traffic from all captive networking apps outside the VPN tunnel to perform captive network handling.</string>
					<key>pfm_name</key>
					<string>AllowAllCaptiveNetworkPlugins</string>
					<key>pfm_platforms</key>
					<array>
						<string>iOS</string>
					</array>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disallow</string>
						<string>Allow</string>
					</array>
					<key>pfm_title</key>
					<string>Allow All Captive Network Plugins</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '1', allows traffic from Captive Web Sheet outside the VPN tunnel.</string>
					<key>pfm_name</key>
					<string>AllowCaptiveWebSheet</string>
					<key>pfm_platforms</key>
					<array>
						<string>iOS</string>
					</array>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disallow</string>
						<string>Allow</string>
					</array>
					<key>pfm_title</key>
					<string>Allow Captive Web Sheet</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The array of captive networking apps whose traffic is allowed outside the VPN tunnel, to perform captive network handling. Used only when 'AllowAllCaptiveNetworkPlugins' is 'false'.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>AlwaysOn.AllowAllCaptiveNetworkPlugins</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>AllowedCaptiveNetworkPlugins</string>
					<key>pfm_platforms</key>
					<array>
						<string>iOS</string>
					</array>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>BundleIdentifier</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>AllowedCaptiveNetworkPluginElement</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle identifier for the app that's allowed on the captive network.</string>
									<key>pfm_name</key>
									<string>BundleIdentifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Bundle Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>An AllowedCaptiveNetworkPlugin Element</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>AllowedCaptiveNetworkPlugins</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>An array that contains an arbitrary number of service exceptions.</string>
					<key>pfm_name</key>
					<string>ServiceExceptions</string>
					<key>pfm_platforms</key>
					<array>
						<string>iOS</string>
					</array>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>ServiceExceptionsElement</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>Services to exmept from Always-On VPN</string>
									<key>pfm_name</key>
									<string>ServiceName</string>
									<key>pfm_range_list</key>
									<array>
										<string>VoiceMail</string>
										<string>AirPrint</string>
										<string>CellularServices</string>
										<string>DeviceCommunication</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Voice Mail</string>
										<string>AirPrint</string>
										<string>Cellular Services (introduced in iOS 11.3)</string>
										<string>Device Communication (introduced in iOS 17.5)</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Exempt Services</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Defines treatment of network connections from from specified services</string>
									<key>pfm_name</key>
									<string>Action</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Drop</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Action</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Service Exceptions Element</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>ServiceExceptionElement</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The name of a service that's exempt from Always On VPN. 'CellularServices' is available in iOS 11.3 and later; it exempts 'VoLTE', 'IMS' and 'MMS'. WiFiCalling is exempted in iOS 13.4 and later.  DeviceCommunication is available in iOS 17.4 and later; it exempts network traffic used for communicating with devices connected via USB or Wi-Fi.</string>
									<key>pfm_name</key>
									<string>ServiceName</string>
									<key>pfm_range_list</key>
									<array>
										<string>VoiceMail</string>
										<string>AirPrint</string>
										<string>CellularServices</string>
										<string>DeviceCommunication</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Service Name</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The action to take with network connections from the named service.</string>
									<key>pfm_name</key>
									<string>Action</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Drop</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Action</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>A ServiceException Element</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>ServiceExceptions</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>An array that contains an arbitrary number of tunnel configurations.</string>
					<key>pfm_name</key>
					<string>TunnelConfigurations</string>
					<key>pfm_platforms</key>
					<array>
						<string>iOS</string>
					</array>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>TunnelConfiguration</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_name</key>
									<string>Interfaces</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_range_list</key>
											<array>
												<string>Cellular</string>
												<string>WiFi</string>
											</array>
											<key>pfm_range_list_titles</key>
											<array>
												<string>Cellular</string>
												<string>Wi-Fi</string>
											</array>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>Interfaces</string>
									<key>pfm_type</key>
									<string>array</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<string>IKEv2</string>
									<key>pfm_description</key>
									<string>Must be set to "IKEv2" when configuring always-on VPN connections</string>
									<key>pfm_name</key>
									<string>ProtocolType</string>
									<key>pfm_range_list</key>
									<array>
										<string>IKEv2</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Protocol Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>IP address or hostname of the VPN server</string>
									<key>pfm_name</key>
									<string>RemoteAddress</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Server</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>FQDN, UserFQDN, Address, or ASN1DN of the IKEv2 server</string>
									<key>pfm_name</key>
									<string>RemoteIdentifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Remote Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>FQDN, UserFQDN, Address, or ASN1DN of the IKEv2 client</string>
									<key>pfm_name</key>
									<string>LocalIdentifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Local Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<string>SharedSecret</string>
									<key>pfm_description</key>
									<string>Type of authentication method for use with the VPN connection. Set to None when enabling EAP (ExtendedAuthEnabled)</string>
									<key>pfm_name</key>
									<string>AuthenticationMethod</string>
									<key>pfm_range_list</key>
									<array>
										<string>None</string>
										<string>SharedSecret</string>
										<string>Certificate</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>None</string>
										<string>Shared Secret</string>
										<string>Certificate</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Authentication Method</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<integer>0</integer>
									<key>pfm_description</key>
									<string>Enables extended authentication</string>
									<key>pfm_name</key>
									<string>ExtendedAuthEnabled</string>
									<key>pfm_range_list</key>
									<array>
										<integer>0</integer>
										<integer>1</integer>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Disable</string>
										<string>Enable</string>
									</array>
									<key>pfm_title</key>
									<string>Enable EAP-only authentication</string>
									<key>pfm_type</key>
									<string>integer</string>
									<key>pfm_type_input</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Username for EAP-only authentication</string>
									<key>pfm_name</key>
									<string>AuthName</string>
									<key>pfm_title</key>
									<string>Authentication Name</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Password used for EAP-only  authentication</string>
									<key>pfm_name</key>
									<string>AuthPassword</string>
									<key>pfm_title</key>
									<string>Authentication Password</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<string>1.0</string>
									<key>pfm_description</key>
									<string>The minimum TLS version to be used in EAP-only authentication</string>
									<key>pfm_ios_min</key>
									<string>11.0</string>
									<key>pfm_macos_min</key>
									<string>10.13</string>
									<key>pfm_name</key>
									<string>TLSMinimumVersion</string>
									<key>pfm_range_list</key>
									<array>
										<string>1.0</string>
										<string>1.1</string>
										<string>1.2</string>
									</array>
									<key>pfm_title</key>
									<string>Minimum TLS</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<string>1.2</string>
									<key>pfm_description</key>
									<string>The maximum TLS version to be used in EAP-only authentication</string>
									<key>pfm_ios_min</key>
									<string>11.0</string>
									<key>pfm_macos_min</key>
									<string>10.13</string>
									<key>pfm_name</key>
									<string>TLSMaximumVersion</string>
									<key>pfm_range_list</key>
									<array>
										<string>1.0</string>
										<string>1.1</string>
										<string>1.2</string>
									</array>
									<key>pfm_title</key>
									<string>Maximum TLS</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Shared secret string for the VPN connection</string>
									<key>pfm_name</key>
									<string>SharedSecret</string>
									<key>pfm_title</key>
									<string>Shared Secret</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>UUID of a certificate payload in this profile that will be used for authentication</string>
									<key>pfm_exclude</key>
									<array>
										<dict>
											<key>pfm_target_conditions</key>
											<array>
												<dict>
													<key>pfm_range_list</key>
													<array>
														<true/>
													</array>
													<key>pfm_target</key>
													<string>AlwaysOn.ExtendedAuthEnabled</string>
												</dict>
											</array>
										</dict>
									</array>
									<key>pfm_ios_min</key>
									<string>16.0</string>
									<key>pfm_macos_min</key>
									<string>13.0</string>
									<key>pfm_name</key>
									<string>PayloadCertificateUUID</string>
									<key>pfm_title</key>
									<string>Certificate</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<string>RSA</string>
									<key>pfm_description</key>
									<string>Type of certificate used for authentication</string>
									<key>pfm_name</key>
									<string>CertificateType</string>
									<key>pfm_range_list</key>
									<array>
										<string>RSA</string>
										<string>ECDSA256</string>
										<string>ECDSA384</string>
										<string>ECDSA521</string>
										<string>RSA-PSS</string>
									</array>
									<key>pfm_title</key>
									<string>Certificate Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Common name of the server certificate issuer</string>
									<key>pfm_name</key>
									<string>ServerCertificateIssuerCommonName</string>
									<key>pfm_title</key>
									<string>Server Certificate Issuer Common Name</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Common name of the server certificate</string>
									<key>pfm_name</key>
									<string>ServerCertificateCommonName</string>
									<key>pfm_title</key>
									<string>Server Certificate Common Name</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<integer>0</integer>
									<key>pfm_description</key>
									<string>Disconnect an on demand connection after it becomes idle</string>
									<key>pfm_name</key>
									<string>DisconnectOnIdle</string>
									<key>pfm_range_list</key>
									<array>
										<integer>0</integer>
										<integer>1</integer>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Disable</string>
										<string>Enable</string>
									</array>
									<key>pfm_title</key>
									<string>Enable Disconnect on Idle</string>
									<key>pfm_type</key>
									<string>integer</string>
									<key>pfm_type_input</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Time interval between a connection becoming idle and when it is finally disconnected, when Enable Disconnect on Idle (DisconnectOnIdle) is enabled. The value is an integer number representing seconds</string>
									<key>pfm_name</key>
									<string>DisconnectOnIdleTimer</string>
									<key>pfm_range_min</key>
									<integer>0</integer>
									<key>pfm_title</key>
									<string>Disconnect on Idle Interval</string>
									<key>pfm_type</key>
									<string>integer</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<string>Medium</string>
									<key>pfm_description</key>
									<string>Sets the frequency of sending a keepalive signal</string>
									<key>pfm_name</key>
									<string>DeadPeerDetectionRate</string>
									<key>pfm_range_list</key>
									<array>
										<string>None</string>
										<string>Low</string>
										<string>Medium</string>
										<string>High</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>None - keepalive not sent</string>
										<string>Low - keepalive sent every 30 minutes</string>
										<string>Medium - keepalive sent every 10 minutes</string>
										<string>High - keepalive sent every minute</string>
									</array>
									<key>pfm_title</key>
									<string>Dead Peer Detection Rate</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<integer>0</integer>
									<key>pfm_description</key>
									<string>Disables connection redirection by redirect requests from VPN server</string>
									<key>pfm_name</key>
									<string>DisableRedirect</string>
									<key>pfm_range_list</key>
									<array>
										<integer>0</integer>
										<integer>1</integer>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Enable</string>
										<string>Disable</string>
									</array>
									<key>pfm_title</key>
									<string>Disable Redirects</string>
									<key>pfm_type</key>
									<string>integer</string>
									<key>pfm_type_input</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<integer>0</integer>
									<key>pfm_description</key>
									<string>Disables mobility and multihoming (MOBIKE)</string>
									<key>pfm_name</key>
									<string>DisableMOBIKE</string>
									<key>pfm_range_list</key>
									<array>
										<integer>0</integer>
										<integer>1</integer>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Enable</string>
										<string>Disable</string>
									</array>
									<key>pfm_title</key>
									<string>Disable Mobility and Multihoming</string>
									<key>pfm_type</key>
									<string>integer</string>
									<key>pfm_type_input</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<integer>0</integer>
									<key>pfm_description</key>
									<string>Enables the use of IKEv2 Configuration Attributes INTERNAL_IP4_SUBNET and INTERNAL_IP6_SUBNET in connection negotiation</string>
									<key>pfm_name</key>
									<string>UseConfigurationAttributeInternalIPSubnet</string>
									<key>pfm_range_list</key>
									<array>
										<integer>0</integer>
										<integer>1</integer>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Disable</string>
										<string>Enable</string>
									</array>
									<key>pfm_title</key>
									<string>Enable IPv4 / IPv6 Internal Subnet Attributes</string>
									<key>pfm_type</key>
									<string>integer</string>
									<key>pfm_type_input</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<integer>0</integer>
									<key>pfm_description</key>
									<string>Enables Perfect Forward Secrecy for the VPN connection</string>
									<key>pfm_name</key>
									<string>EnablePFS</string>
									<key>pfm_range_list</key>
									<array>
										<integer>0</integer>
										<integer>1</integer>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Disable</string>
										<string>Enable</string>
									</array>
									<key>pfm_title</key>
									<string>Enable Perfect Forward Secrecy</string>
									<key>pfm_type</key>
									<string>integer</string>
									<key>pfm_type_input</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<integer>0</integer>
									<key>pfm_description</key>
									<string>Enables certificate revocation checks for the VPN connection</string>
									<key>pfm_name</key>
									<string>EnableCertificateRevocationCheck</string>
									<key>pfm_range_list</key>
									<array>
										<integer>0</integer>
										<integer>1</integer>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Disable</string>
										<string>Enable</string>
									</array>
									<key>pfm_title</key>
									<string>Enable Certificate Revocation Check</string>
									<key>pfm_type</key>
									<string>integer</string>
									<key>pfm_type_input</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<integer>0</integer>
									<key>pfm_description</key>
									<string>Enables Wi-Fi assist for the VPN connection</string>
									<key>pfm_name</key>
									<string>EnableFallback</string>
									<key>pfm_range_list</key>
									<array>
										<integer>0</integer>
										<integer>1</integer>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Disable</string>
										<string>Enable</string>
									</array>
									<key>pfm_title</key>
									<string>Enable Wi-Fi Assist (Cellular Fallback)</string>
									<key>pfm_type</key>
									<string>integer</string>
									<key>pfm_type_input</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Parameters for IKE Security Association</string>
									<key>pfm_name</key>
									<string>IKESecurityAssociationParameters</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_default</key>
											<string>AES-256</string>
											<key>pfm_name</key>
											<string>EncryptionAlgorithm</string>
											<key>pfm_range_list</key>
											<array>
												<string>DES</string>
												<string>3DES</string>
												<string>AES-128</string>
												<string>AES-256</string>
												<string>AES-128-GCM</string>
												<string>AES-256-GCM</string>
												<string>ChaCha20Poly1305</string>
											</array>
											<key>pfm_title</key>
											<string>IKE SA Encryption Algorithm</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
										<dict>
											<key>pfm_default</key>
											<string>SHA2-256</string>
											<key>pfm_name</key>
											<string>IntegrityAlgorithm</string>
											<key>pfm_range_list</key>
											<array>
												<string>SHA1-96</string>
												<string>SHA1-160</string>
												<string>SHA2-256</string>
												<string>SHA2-384</string>
												<string>SHA2-512</string>
											</array>
											<key>pfm_title</key>
											<string>IKE SA Integrity Algorithm</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
										<dict>
											<key>pfm_default</key>
											<integer>14</integer>
											<key>pfm_name</key>
											<string>DiffieHellmanGroup</string>
											<key>pfm_range_list</key>
											<array>
												<integer>1</integer>
												<integer>2</integer>
												<integer>5</integer>
												<integer>14</integer>
												<integer>15</integer>
												<integer>16</integer>
												<integer>17</integer>
												<integer>18</integer>
												<integer>19</integer>
												<integer>20</integer>
												<integer>21</integer>
												<integer>31</integer>
												<integer>32</integer>
											</array>
											<key>pfm_title</key>
											<string>IKE SA Diffie Hellman Group</string>
											<key>pfm_type</key>
											<string>integer</string>
										</dict>
										<dict>
											<key>pfm_default</key>
											<integer>1440</integer>
											<key>pfm_description</key>
											<string>SA lifetime (interval for rekey interval). The value is an integer number representing minutes</string>
											<key>pfm_name</key>
											<string>LifeTimeInMinutes</string>
											<key>pfm_range_max</key>
											<integer>1440</integer>
											<key>pfm_range_min</key>
											<integer>10</integer>
											<key>pfm_title</key>
											<string>IKE SA Lifetime</string>
											<key>pfm_type</key>
											<string>integer</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>IKE Security Association Parameters</string>
									<key>pfm_type</key>
									<string>dictionary</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Parameters for Child Security Association</string>
									<key>pfm_name</key>
									<string>ChildSecurityAssociationParameters</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_default</key>
											<string>AES-256</string>
											<key>pfm_name</key>
											<string>EncryptionAlgorithm</string>
											<key>pfm_range_list</key>
											<array>
												<string>DES</string>
												<string>3DES</string>
												<string>AES-128</string>
												<string>AES-256</string>
												<string>AES-128-GCM</string>
												<string>AES-256-GCM</string>
												<string>ChaCha20Poly1305</string>
											</array>
											<key>pfm_title</key>
											<string>Child SA Encryption Algorithm</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
										<dict>
											<key>pfm_default</key>
											<string>SHA2-256</string>
											<key>pfm_name</key>
											<string>IntegrityAlgorithm</string>
											<key>pfm_range_list</key>
											<array>
												<string>SHA1-96</string>
												<string>SHA1-160</string>
												<string>SHA2-256</string>
												<string>SHA2-384</string>
												<string>SHA2-512</string>
											</array>
											<key>pfm_title</key>
											<string>Child SA Integrity Algorithm</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
										<dict>
											<key>pfm_default</key>
											<integer>14</integer>
											<key>pfm_name</key>
											<string>DiffieHellmanGroup</string>
											<key>pfm_range_list</key>
											<array>
												<integer>1</integer>
												<integer>2</integer>
												<integer>5</integer>
												<integer>14</integer>
												<integer>15</integer>
												<integer>16</integer>
												<integer>17</integer>
												<integer>18</integer>
												<integer>19</integer>
												<integer>20</integer>
												<integer>21</integer>
												<integer>31</integer>
												<integer>32</integer>
											</array>
											<key>pfm_title</key>
											<string>Child SA Diffie Hellman Group</string>
											<key>pfm_type</key>
											<string>integer</string>
										</dict>
										<dict>
											<key>pfm_default</key>
											<integer>1440</integer>
											<key>pfm_description</key>
											<string>SA lifetime (interval for rekey interval). The value is an integer number representing minutes</string>
											<key>pfm_name</key>
											<string>LifeTimeInMinutes</string>
											<key>pfm_range_max</key>
											<integer>1440</integer>
											<key>pfm_range_min</key>
											<integer>10</integer>
											<key>pfm_title</key>
											<string>Child SA Lifetime</string>
											<key>pfm_type</key>
											<string>integer</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>Child Security Association Parameters</string>
									<key>pfm_type</key>
									<string>dictionary</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<integer>1280</integer>
									<key>pfm_name</key>
									<string>MTU</string>
									<key>pfm_title</key>
									<string>MTU</string>
									<key>pfm_type</key>
									<string>integer</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<integer>1</integer>
									<key>pfm_description</key>
									<string>Set to 1 to enable NAT Keepalive offload for Always-on VPN IKEv2 connections</string>
									<key>pfm_name</key>
									<string>NATKeepAliveOffloadEnable</string>
									<key>pfm_title</key>
									<string>Enable NAT keepalive while the device is asleep</string>
									<key>pfm_type</key>
									<string>integer</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<integer>110</integer>
									<key>pfm_description</key>
									<string>NAT Keepalive interval for Always-on VPN IKEv2 connections. This value controls the interval over which Keepalive offload packets are sent by the device. The minimum value is 20 seconds. If no key is specified, the default is 20 seconds over Wi-Fi and 110 seconds over Cellular interface.</string>
									<key>pfm_name</key>
									<string>NATKeepAliveInterval</string>
									<key>pfm_title</key>
									<string>NAT Keepalive Interval</string>
									<key>pfm_type</key>
									<string>integer</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Tunnel Configuration</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>TunnelConfigurationElement</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The type of connection, which needs to be 'IKEv2'.</string>
									<key>pfm_name</key>
									<string>ProtocolType</string>
									<key>pfm_range_list</key>
									<array>
										<string>IKEv2</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Protocol Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The interfaces to apply this configuration to.</string>
									<key>pfm_name</key>
									<string>Interfaces</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_name</key>
											<string>InterfacesElement</string>
											<key>pfm_range_list</key>
											<array>
												<string>Cellular</string>
												<string>WiFi</string>
											</array>
											<key>pfm_title</key>
											<string>Interfaces Element</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>Interfaces</string>
									<key>pfm_type</key>
									<string>array</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>A TunnelConfiguration Element</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>TunnelConfigurations</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '1', allows the user to disable the VPN configuration.</string>
					<key>pfm_name</key>
					<string>UIToggleEnabled</string>
					<key>pfm_platforms</key>
					<array>
						<string>iOS</string>
					</array>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>UI Toggle Enabled</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>An array that contains an arbitrary number of apps whose connections occur outside the VPN.</string>
					<key>pfm_ios_min</key>
					<string>13.6</string>
					<key>pfm_name</key>
					<string>ApplicationExceptions</string>
					<key>pfm_platforms</key>
					<array>
						<string>iOS</string>
					</array>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>ApplicationExceptionElement</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The app's bundle identifier.</string>
									<key>pfm_name</key>
									<string>BundleIdentifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Bundle Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Limit the exception to only the specified list of protocols, with support for 'UDP' only.</string>
									<key>pfm_name</key>
									<string>LimitToProtocols</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_name</key>
											<string>LimitToProtocolElement</string>
											<key>pfm_range_list</key>
											<array>
												<string>UDP</string>
											</array>
											<key>pfm_title</key>
											<string>LimitToProtocol Element</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>LimitToProtocols</string>
									<key>pfm_type</key>
									<string>array</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>A ApplicationException Element</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>ApplicationExceptions</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>13.6</string>
						</dict>
					</dict>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>AlwaysOn</string>
			<key>pfm_type</key>
			<string>dictionary</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>8.0</string>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
				<key>tvOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>A dictionary to use for all VPN types.</string>
			<key>pfm_ios_min</key>
			<string>10</string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
			<key>pfm_name</key>
			<string>DNS</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>The primary domain of the tunnel.</string>
					<key>pfm_ios_min</key>
					<string>10.0</string>
					<key>pfm_macos_min</key>
					<string>10.12</string>
					<key>pfm_name</key>
					<string>DomainName</string>
					<key>pfm_title</key>
					<string>Domain Name</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.12</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The array of DNS server IP address strings. These IP addresses can be a mixture of IPv4 and IPv6 addresses.</string>
					<key>pfm_ios_min</key>
					<string>10.0</string>
					<key>pfm_macos_min</key>
					<string>10.12</string>
					<key>pfm_name</key>
					<string>ServerAddresses</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>ServerAddressesElement</string>
							<key>pfm_title</key>
							<string>Server Address Element</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>DNS Server Addresses</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.12</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The list of domain strings used to fully qualify single-label host names.</string>
					<key>pfm_ios_min</key>
					<string>10.0</string>
					<key>pfm_macos_min</key>
					<string>10.12</string>
					<key>pfm_name</key>
					<string>SearchDomains</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>SearchDomainsElement</string>
							<key>pfm_title</key>
							<string>Search Domains Element</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>DNS Search Domains</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.12</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The list of domain strings used to determine which DNS queries use the DNS resolver settings in 'ServerAddresses'. The system uses this key to create a split DNS configuration where it resolves only hosts in certain domains using the tunnel's DNS resolver. The system uses the default resolver for hosts that aren't in one of the domains in this list.
If 'SupplementalMatchDomains' contains the empty string it becomes the default domain.
Split-tunnel configurations can direct all DNS queries to the VPN DNS servers before the primary DNS servers. If the VPN tunnel becomes the network's default route, the servers listed in 'ServerAddresses' become the default resolver and the system ignores the 'SupplementalMatchDomains' list.</string>
					<key>pfm_ios_min</key>
					<string>10.0</string>
					<key>pfm_macos_min</key>
					<string>10.12</string>
					<key>pfm_name</key>
					<string>SupplementalMatchDomains</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>SupplementalMatchDomainsElement</string>
							<key>pfm_title</key>
							<string>Supplemental Match Domains Element</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Supplemental Match Domains</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.12</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '0', append the domains in the 'SupplementalMatchDomains' list to the resolver's list of search domains.</string>
					<key>pfm_ios_min</key>
					<string>10.0</string>
					<key>pfm_macos_min</key>
					<string>10.12</string>
					<key>pfm_name</key>
					<string>SupplementalMatchDomainsNoSearch</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Append</string>
						<string>Do not append</string>
					</array>
					<key>pfm_title</key>
					<string>Supplemental Match Domains No Search</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.12</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The transport protocol to communicate with the DNS server.</string>
					<key>pfm_ios_min</key>
					<string>14.0</string>
					<key>pfm_macos_min</key>
					<string>11.0</string>
					<key>pfm_name</key>
					<string>DNSProtocol</string>
					<key>pfm_range_list</key>
					<array>
						<string>Cleartext</string>
						<string>HTTPS</string>
						<string>TLS</string>
					</array>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>DNS Protocol</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>14.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>11.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The URI template of a DNS-over-HTTPS server, as defined in RFC 8484, which needs to use the 'https://' scheme. The system uses the hostname or address in the URL to validate the server certificate. If 'ServerAddresses' isn't specified, the system uses the hostname or address in the URL to determine the server addresses. This key is required if the 'DNSProtocol' is 'HTTPS'.</string>
					<key>pfm_ios_min</key>
					<string>14.0</string>
					<key>pfm_macos_min</key>
					<string>11.0</string>
					<key>pfm_name</key>
					<string>ServerURL</string>
					<key>pfm_title</key>
					<string>Server URL</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>14.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>11.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The hostname of a DNS-over-TLS server to validate the server certificate, as defined in RFC 7858. If 'ServerAddresses' isn't specified, the system uses the hostname to determine the server addresses. This key is required if the 'DNSProtocol' is 'TLS'.</string>
					<key>pfm_ios_min</key>
					<string>14.0</string>
					<key>pfm_macos_min</key>
					<string>11.0</string>
					<key>pfm_name</key>
					<string>ServerName</string>
					<key>pfm_title</key>
					<string>Server Name</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>14.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>11.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>That UUID that points to an identity certificate payload. The system uses this identity to authenticate the user to the DNS resolver.</string>
					<key>pfm_format</key>
					<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
					<key>pfm_ios_min</key>
					<string>16.0</string>
					<key>pfm_macos_min</key>
					<string>13.0</string>
					<key>pfm_name</key>
					<string>PayloadCertificateUUID</string>
					<key>pfm_title</key>
					<string>DNS Certificate UUID</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>16.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>13.0</string>
						</dict>
					</dict>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>DNS</string>
			<key>pfm_type</key>
			<string>dictionary</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>watchOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>10.0</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The dictionary that contains IPSec settings. Not available in watchOS.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>IPSec</string>
								<string>L2TP</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>IPSec</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
			</array>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>The IP address or host name of the VPN server.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>RemoteAddress</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>Remote Address</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>If '1', enables Xauth for Cisco IPSec VPNs.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>XAuthEnabled</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>XAUTH Enabled</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The user name for the VPN account for Cisco IPSec.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IPSec.XAuthEnabled</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>XAuthName</string>
					<key>pfm_require</key>
					<string>push</string>
					<key>pfm_title</key>
					<string>Username</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The VPN account password for Cisco IPSec.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IPSec.XAuthEnabled</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>XAuthPassword</string>
					<key>pfm_require</key>
					<string>push</string>
					<key>pfm_title</key>
					<string>Password</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A string that either has the value “Prompt” or isn't present.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IPSec.XAuthEnabled</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>XAuthPasswordEncryption</string>
					<key>pfm_range_list</key>
					<array>
						<string>Prompt</string>
					</array>
					<key>pfm_title</key>
					<string>XAUTH Password Encryption</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>SharedSecret</string>
					<key>pfm_description</key>
					<string>The authentication method for L2TP and Cisco IPSec.</string>
					<key>pfm_name</key>
					<string>AuthenticationMethod</string>
					<key>pfm_range_list</key>
					<array>
						<string>SharedSecret</string>
						<string>Certificate</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Shared Secret</string>
						<string>Certificate</string>
					</array>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>Authentication Method</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The name of the group. For hybrid authentication, the string needs to end with “hybrid”.
Present only for Cisco IPSec if 'AuthenticationMethod' is 'SharedSecret'.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>SharedSecret</string>
									</array>
									<key>pfm_target</key>
									<string>IPSec.AuthenticationMethod</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>LocalIdentifier</string>
					<key>pfm_title</key>
					<string>Local Identifier</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>KeyID</string>
					<key>pfm_description</key>
					<string>Present only if 'AuthenticationMethod' is 'SharedSecret'. The value is 'KeyID'. The system uses this value for L2TP and Cisco IPSec VPNs.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>SharedSecret</string>
									</array>
									<key>pfm_target</key>
									<string>IPSec.AuthenticationMethod</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>LocalIdentifierType</string>
					<key>pfm_range_list</key>
					<array>
						<string>KeyID</string>
					</array>
					<key>pfm_title</key>
					<string>Local Identifier Type</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The shared secret for this VPN account.
Only use this with L2TP and Cisco IPSec VPNs and if the 'AuthenticationMethod' key is to 'SharedSecret'.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>SharedSecret</string>
									</array>
									<key>pfm_target</key>
									<string>IPSec.AuthenticationMethod</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>SharedSecret</string>
					<key>pfm_title</key>
					<string>Shared Secret</string>
					<key>pfm_type</key>
					<string>data</string>
					<key>pfm_type_input</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The UUID of the certificate payload within the same profile to use for the account credentials.
Only use this with Cisco IPSec VPNs and if the 'AuthenticationMethod' key is to 'Certificate'.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>Certificate</string>
									</array>
									<key>pfm_target</key>
									<string>IPSec.AuthenticationMethod</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_min</key>
					<string>16.0</string>
					<key>pfm_macos_min</key>
					<string>13.0</string>
					<key>pfm_name</key>
					<string>PayloadCertificateUUID</string>
					<key>pfm_title</key>
					<string>Certificate UUID</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>If 'true', prompts for a PIN when connecting to Cisco IPSec VPNs.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>PromptForVPNPIN</string>
					<key>pfm_title</key>
					<string>Prompt for PIN</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '1', enables bringing the VPN connection up on demand.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>OnDemandEnabled</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable VPN On Demand</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Deprecated. A list of domain names. In iOS 7 and later, if this key is present, the system treats associated domain names as though they're associated with the 'OnDemandMatchDomainsOnRetry' key. This behavior can be overridden by 'OnDemandRules'.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IPSec.OnDemandEnabled</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_deprecated</key>
					<string>7.0</string>
					<key>pfm_name</key>
					<string>OnDemandMatchDomainsAlways</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>MatchDomainAlwaysElement</string>
							<key>pfm_title</key>
							<string>Match Domain Always Element</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>On Demand Match Domains Always</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_deprecated</key>
							<string>7.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Deprecated. A list of domain names. In iOS 7 and later, this key is deprecated (but still supported) in favor of 'EvaluateConnection' actions in the 'OnDemandRules' dictionaries.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IPSec.OnDemandEnabled</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_deprecated</key>
					<string>7.0</string>
					<key>pfm_name</key>
					<string>OnDemandMatchDomainsNever</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>MatchDomainNeverElement</string>
							<key>pfm_title</key>
							<string>Match Domain Never Element</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>On Demand Match Domains Never</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_deprecated</key>
							<string>7.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Deprecated. A list of domain names. In iOS 7 and later, this field is deprecated (but still supported) in favor of 'EvaluateConnection' actions in the 'OnDemandRules' dictionaries.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IPSec.OnDemandEnabled</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_deprecated</key>
					<string>7.0</string>
					<key>pfm_name</key>
					<string>OnDemandMatchDomainsOnRetry</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>MatchDomainOnRetryElement</string>
							<key>pfm_title</key>
							<string>Match Domain On Retry Element</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>On Demand Match Domains On Retry</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_deprecated</key>
							<string>7.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The on-demand rules dictionary.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IPSec.OnDemandEnabled</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>OnDemandRules</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>OnDemandRulesElement</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The action to take if this dictionary matches the current network. Possible values are:
* 'Allow': Deprecated. Allow VPN On Demand to connect if triggered.
* 'Connect': Unconditionally initiate a VPN connection on the next network attempt.
* 'Disconnect': Tear down the VPN connection and don't reconnect on demand as long as this dictionary matches.
* 'EvaluateConnection': Evaluate the ActionParameters array for each connection attempt.
* 'Ignore:' Leave any existing VPN connection up, but don't reconnect on demand as long as this dictionary matches.
Only the 'Disconnect' action is available on watchOS 10 and later.</string>
									<key>pfm_name</key>
									<string>Action</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Connect</string>
										<string>Disconnect</string>
										<string>EvaluateConnection</string>
										<string>Ignore</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Allow</string>
										<string>Connect</string>
										<string>Disconnect</string>
										<string>Evaluate Connection</string>
										<string>Ignore</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>On Demand Action</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>An interface type. If specified, this rule matches only if the primary network interface hardware matches the specified type.</string>
									<key>pfm_name</key>
									<string>InterfaceTypeMatch</string>
									<key>pfm_range_list</key>
									<array>
										<string>Ethernet</string>
										<string>WiFi</string>
										<string>Cellular</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Ethernet</string>
										<string>Wi-Fi</string>
										<string>Cellular</string>
									</array>
									<key>pfm_title</key>
									<string>Interface Type Match</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>An array of domain names. This rule matches if any of the domain names in the specified list matches any domain in the device's search domains list.
The system supports a wildcard ('*') prefix. For example, '*.example.com' matches against either 'mydomain.example.com' or 'yourdomain.example.com'.</string>
									<key>pfm_name</key>
									<string>DNSDomainMatch</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_name</key>
											<string>DNSDomainMatchElement</string>
											<key>pfm_title</key>
											<string>DNS Domain Match Element</string>
											<key>pfm_type</key>
											<string>string</string>
											<key>pfm_value_placeholder</key>
											<string>*.example.com</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>DNS Domain Match</string>
									<key>pfm_type</key>
									<string>array</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>An array of IP addresses. This rule matches if any of the network's specified DNS servers match any entry in the array.
The system supports matching with a single wildcard. For example, '17.*' matches any DNS server in the '17.0.0.0/8' subnet.</string>
									<key>pfm_name</key>
									<string>DNSServerAddressMatch</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_name</key>
											<string>DNSServerAddressMatchElement</string>
											<key>pfm_title</key>
											<string>DNS Server Address Match Element</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>DNS Server Address Match</string>
									<key>pfm_type</key>
									<string>array</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>An array of SSIDs to match against the current network. If the network isn't a Wi-Fi network or if the SSID doesn't appear in this array, the match fails.
Omit this key and the corresponding array to match against any SSID.</string>
									<key>pfm_name</key>
									<string>SSIDMatch</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_name</key>
											<string>SSIDMatchElement</string>
											<key>pfm_title</key>
											<string>SSID Match Element</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>SSID Match</string>
									<key>pfm_type</key>
									<string>array</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>A URL to probe. This rule matches when this URL is successfully fetched (returns a '200' HTTP status code) without redirection. Not available in watchOS.</string>
									<key>pfm_name</key>
									<string>URLStringProbe</string>
									<key>pfm_title</key>
									<string>URL String Probe</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>An array of dictionaries that provides rules similar to the 'OnDemandRules' dictionary, but evaluated on each connection instead of when the network changes. This value is only for use with dictionaries in which the 'Action' value is 'EvaluateConnection'. The system evaluates these dictionaries in order and the first dictionary that matches determines the behavior. Not available in watchOS.</string>
									<key>pfm_name</key>
									<string>ActionParameters</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_description</key>
											<string>A dictionary that provides rules similar to the OnDemandRules dictionary, but evaluated on each connection instead of when the network changes. These dictionaries are evaluated in order, and the behavior is determined by the first dictionary that matches.
The keys allowed in each dictionary are described below. Note: This array is used only for dictionaries in which EvaluateConnection is the Action value.</string>
											<key>pfm_name</key>
											<string>ActionParameter</string>
											<key>pfm_subkeys</key>
											<array>
												<dict>
													<key>pfm_description</key>
													<string>Defines the VPN behavior for the specified domains. Allowed values are:
* 'ConnectIfNeeded': The specified domains should trigger a VPN connection attempt if domain name resolution fails, such as when the DNS server indicates that it can't resolve the domain, responds with a redirection to a different server, or fails to respond (timeout).
* 'NeverConnect': The specified domains should never trigger a VPN connection attempt.</string>
													<key>pfm_name</key>
													<string>DomainAction</string>
													<key>pfm_range_list</key>
													<array>
														<string>ConnectIfNeeded</string>
														<string>NeverConnect</string>
													</array>
													<key>pfm_range_list_titles</key>
													<array>
														<string>Connect If Needed</string>
														<string>Never Connect</string>
													</array>
													<key>pfm_require</key>
													<string>always</string>
													<key>pfm_title</key>
													<string>Domain Action</string>
													<key>pfm_type</key>
													<string>string</string>
												</dict>
												<dict>
													<key>pfm_description</key>
													<string>The domains to apply this evaluation.</string>
													<key>pfm_name</key>
													<string>Domains</string>
													<key>pfm_require</key>
													<string>always</string>
													<key>pfm_subkeys</key>
													<array>
														<dict>
															<key>pfm_name</key>
															<string>DomainsElement</string>
															<key>pfm_title</key>
															<string>Domains Element</string>
															<key>pfm_type</key>
															<string>string</string>
														</dict>
													</array>
													<key>pfm_title</key>
													<string>Domains</string>
													<key>pfm_type</key>
													<string>array</string>
												</dict>
												<dict>
													<key>pfm_description</key>
													<string>An array of IP addresses of DNS servers to use for resolving the specified domains. These servers don't need to be part of the device's current network configuration. If these DNS servers aren't reachable, the system establishes a VPN connection. These DNS servers need to be either internal DNS servers or trusted external DNS servers.
This key is valid only if the value of 'DomainAction' is 'ConnectIfNeeded'.</string>
													<key>pfm_name</key>
													<string>RequiredDNSServers</string>
													<key>pfm_subkeys</key>
													<array>
														<dict>
															<key>pfm_name</key>
															<string>RequiredDNSServersElement</string>
															<key>pfm_title</key>
															<string>Required DNS Servers Element</string>
															<key>pfm_type</key>
															<string>string</string>
														</dict>
													</array>
													<key>pfm_title</key>
													<string>Required DNS Servers</string>
													<key>pfm_type</key>
													<string>array</string>
												</dict>
												<dict>
													<key>pfm_description</key>
													<string>An HTTP or HTTPS (preferred) URL to probe, using a GET request. If the URL's hostname can't be resolved, if the server is unreachable, or if the server doesn't respond with a 200 HTTP status code, a VPN connection is established in response.
This key is valid only if the value of 'DomainAction' is 'ConnectIfNeeded'.</string>
													<key>pfm_name</key>
													<string>RequiredURLStringProbe</string>
													<key>pfm_title</key>
													<string>Required URL String Probe</string>
													<key>pfm_type</key>
													<string>string</string>
												</dict>
											</array>
											<key>pfm_title</key>
											<string>Action Parameter</string>
											<key>pfm_type</key>
											<string>dictionary</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>Action Parameters</string>
									<key>pfm_type</key>
									<string>array</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>On Demand Rules Element</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>On Demand Rules</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '1', disconnect after an on-demand connection idles.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>DisconnectOnIdle</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable Disconnect on Idle</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The length of time to wait before disconnecting an on-demand connection.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IPSec.DisconnectOnIdle</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>DisconnectOnIdleTimer</string>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Disconnect on Idle time</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>IPSec Settings</string>
			<key>pfm_type</key>
			<string>dictionary</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>tvOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>com.wireguard.ios</string>
								<string>com.wireguard.macos</string>
							</array>
							<key>pfm_target</key>
							<string>VPNSubType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>The vendor-specific configuration dictionary, which the system reads only when 'VPNSubType' has a value. Not available in watchOS.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>VPN</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>VPNSubType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>VendorConfig</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<string>com.cisco.anyconnect</string>
										<string>com.cisco.anyconnect.applevpn.plugin</string>
									</array>
									<key>pfm_target</key>
									<string>VPNSubType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>The group to connect to on the head end. Valid for Cisco AnyConnect and Cisco Legacy AnyConnect. Not available in watchOS.</string>
					<key>pfm_name</key>
					<string>Group</string>
					<key>pfm_title</key>
					<string>Group</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<string>com.sonicwall.SonicWALL-SSLVPN.vpnplugin</string>
									</array>
									<key>pfm_target</key>
									<string>VPNSubType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>The login group or domain. Valid only for SonicWALL Mobile Connect. Not available in watchOS.</string>
					<key>pfm_name</key>
					<string>LoginGroupOrDomain</string>
					<key>pfm_title</key>
					<string>Login Group or Domain</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<string>net.juniper.sslvpn</string>
										<string>net.pulsesecure.PulseSecure.vpnplugin</string>
									</array>
									<key>pfm_target</key>
									<string>VPNSubType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>The Kerberos realm name, which needs to be properly capitalized. Valid only for Juniper SSL and Pulse Secure. Not available in watchOS.</string>
					<key>pfm_name</key>
					<string>Realm</string>
					<key>pfm_title</key>
					<string>Realm</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_range_list</key>
									<array>
										<string>net.juniper.sslvpn</string>
										<string>net.pulsesecure.PulseSecure.vpnplugin</string>
									</array>
									<key>pfm_target</key>
									<string>VPNSubType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>The role to select when connecting to the server. Valid only for Juniper SSL and Pulse Secure. Not available in watchOS.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>net.juniper.sslvpn</string>
										<string>net.pulsesecure.PulseSecure.vpnplugin</string>
									</array>
									<key>pfm_target</key>
									<string>VPNSubType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>Role</string>
					<key>pfm_title</key>
					<string>Role</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_range_list</key>
									<array>
										<string>com.wireguard.ios</string>
										<string>com.wireguard.macos</string>
									</array>
									<key>pfm_target</key>
									<string>VPNSubType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>WireGuard configuration in wg-quick(8) or wg(8) format. The keys 'FwMark', 'Table', 'PreUp', 'PostUp', 'PreDown', 'PostDown' and 'SaveConfig' are not supported.</string>
					<key>pfm_documentation_url</key>
					<string>https://git.zx2c4.com/wireguard-apple/about/MOBILECONFIG.md</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>com.wireguard.ios</string>
										<string>com.wireguard.macos</string>
									</array>
									<key>pfm_target</key>
									<string>VPNSubType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>WgQuickConfig</string>
					<key>pfm_platforms</key>
					<array>
						<string>iOS</string>
						<string>macOS</string>
					</array>
					<key>pfm_title</key>
					<string>WireGuard Quick Config</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Vendor Configuration Dictionary</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The VPN dictionary is used when VPNType is VPN.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>VPN</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>VPN</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>IP address or hostname of the VPN server.</string>
					<key>pfm_name</key>
					<string>RemoteAddress</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>Server</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The VPN account username.</string>
					<key>pfm_name</key>
					<string>AuthName</string>
					<key>pfm_require</key>
					<string>push</string>
					<key>pfm_title</key>
					<string>Account Username</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<string>VPN</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_default</key>
					<string>Password</string>
					<key>pfm_description</key>
					<string>The authentication method to use.</string>
					<key>pfm_name</key>
					<string>AuthenticationMethod</string>
					<key>pfm_range_list</key>
					<array>
						<string>Password</string>
						<string>Certificate</string>
						<string>Password+Certificate</string>
					</array>
					<key>pfm_title</key>
					<string>Authentication Method</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The VPN user password.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>Password</string>
										<string>Password+Certificate</string>
									</array>
									<key>pfm_target</key>
									<string>VPN.AuthenticationMethod</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>Password</string>
					<key>pfm_title</key>
					<string>Account Password</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The UUID of the certificate payload within the same profile to use for account credentials.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>Certificate</string>
										<string>Password+Certificate</string>
									</array>
									<key>pfm_target</key>
									<string>VPN.AuthenticationMethod</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_min</key>
					<string>16.0</string>
					<key>pfm_macos_min</key>
					<string>13.0</string>
					<key>pfm_name</key>
					<string>PayloadCertificateUUID</string>
					<key>pfm_title</key>
					<string>Certificate UUID</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '1', enables VPN On Demand.</string>
					<key>pfm_name</key>
					<string>OnDemandEnabled</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable VPN On Demand</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A list of domain names. The system treats associated domain names as though they're associated with the 'OnDemandMatchDomainsOnRetry' key. This behavior can be overridden by 'OnDemandRules'.
In iOS 7 and later, this key is deprecated (but still supported) in favor of 'EvaluateConnection' actions in the 'OnDemandRules' dictionaries.
Not available in watchOS.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>VPN.OnDemandEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_deprecated</key>
					<string>7.0</string>
					<key>pfm_name</key>
					<string>OnDemandMatchDomainsAlways</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>MatchDomainAlwaysElement</string>
							<key>pfm_title</key>
							<string>Match Domain Always Element</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>On Demand Match Domains Always</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_deprecated</key>
							<string>7.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A list of domain names. If the host name ends with one of these domain names, the system doesn't start the VPN automatically. The system uses this value to exclude a subdomain within an included domain.
In iOS 7 and later, this key is deprecated (but still supported) in favor of 'EvaluateConnection' actions in the 'OnDemandRules' dictionaries.
Not available in watchOS.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>VPN.OnDemandEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_deprecated</key>
					<string>7.0</string>
					<key>pfm_name</key>
					<string>OnDemandMatchDomainsNever</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>MatchDomainNeverElement</string>
							<key>pfm_title</key>
							<string>Match Domain Never Element</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>On Demand Match Domains Never</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_deprecated</key>
							<string>7.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A list of domain names. If the host name ends with one of these domain names and a DNS query for that domain name fails, the system starts the VPN automatically.
In iOS 7 and later, this key is deprecated (but still supported) in favor of 'EvaluateConnection' actions in the 'OnDemandRules' dictionaries.
Not available in watchOS.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>VPN.OnDemandEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_deprecated</key>
					<string>7.0</string>
					<key>pfm_name</key>
					<string>OnDemandMatchDomainsOnRetry</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>MatchDomainOnRetryElement</string>
							<key>pfm_title</key>
							<string>Match Domain On Retry Element</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>On Demand Match Domains On Retry</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_deprecated</key>
							<string>7.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>An array of dictionaries defining On Demand Rules.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>VPN.OnDemandEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>OnDemandRules</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>OnDemandRulesElement</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The action to take if this dictionary matches the current network. Possible values are:
* 'Allow': Deprecated. Allow VPN On Demand to connect if triggered.
* 'Connect': Unconditionally initiate a VPN connection on the next network attempt.
* 'Disconnect': Tear down the VPN connection and don't reconnect on demand as long as this dictionary matches.
* 'EvaluateConnection': Evaluate the ActionParameters array for each connection attempt.
* 'Ignore:' Leave any existing VPN connection up, but don't reconnect on demand as long as this dictionary matches.
Only the 'Disconnect' action is available on watchOS 10 and later.</string>
									<key>pfm_name</key>
									<string>Action</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Connect</string>
										<string>Disconnect</string>
										<string>EvaluateConnection</string>
										<string>Ignore</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Allow</string>
										<string>Connect</string>
										<string>Disconnect</string>
										<string>Evaluate Connection</string>
										<string>Ignore</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>On Demand Action</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>An interface type. If specified, this rule matches only if the primary network interface hardware matches the specified type.</string>
									<key>pfm_name</key>
									<string>InterfaceTypeMatch</string>
									<key>pfm_range_list</key>
									<array>
										<string>Ethernet</string>
										<string>WiFi</string>
										<string>Cellular</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Ethernet</string>
										<string>Wi-Fi</string>
										<string>Cellular</string>
									</array>
									<key>pfm_title</key>
									<string>Interface Type Match</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>An array of domain names. This rule matches if any of the domain names in the specified list matches any domain in the device's search domains list.
The system supports a wildcard ('*') prefix. For example, '*.example.com' matches against either 'mydomain.example.com' or 'yourdomain.example.com'.</string>
									<key>pfm_name</key>
									<string>DNSDomainMatch</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_name</key>
											<string>DNSDomainMatchElement</string>
											<key>pfm_title</key>
											<string>DNS Domain Match Element</string>
											<key>pfm_type</key>
											<string>string</string>
											<key>pfm_value_placeholder</key>
											<string>*.example.com</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>DNS Domain Match</string>
									<key>pfm_type</key>
									<string>array</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>An array of IP addresses. This rule matches if any of the network's specified DNS servers match any entry in the array.
The system supports matching with a single wildcard. For example, '17.*' matches any DNS server in the '17.0.0.0/8' subnet.</string>
									<key>pfm_name</key>
									<string>DNSServerAddressMatch</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_name</key>
											<string>DNSServerAddressMatchElement</string>
											<key>pfm_title</key>
											<string>DNS Server Address Match Element</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>DNS Server Address Match</string>
									<key>pfm_type</key>
									<string>array</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>An array of SSIDs to match against the current network. If the network isn't a Wi-Fi network or if the SSID doesn't appear in this array, the match fails.
Omit this key and the corresponding array to match against any SSID.</string>
									<key>pfm_name</key>
									<string>SSIDMatch</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_name</key>
											<string>SSIDMatchElement</string>
											<key>pfm_title</key>
											<string>SSID Match Element</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>SSID Match</string>
									<key>pfm_type</key>
									<string>array</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>A URL to probe. This rule matches when this URL is successfully fetched (returns a '200' HTTP status code) without redirection. Not available in watchOS.</string>
									<key>pfm_name</key>
									<string>URLStringProbe</string>
									<key>pfm_title</key>
									<string>URL String Probe</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>An array of dictionaries that provides rules similar to the 'OnDemandRules' dictionary, but evaluated on each connection instead of when the network changes. This value is only for use with dictionaries in which the 'Action' value is 'EvaluateConnection'. The system evaluates these dictionaries in order and the first dictionary that matches determines the behavior. Not available in watchOS.</string>
									<key>pfm_name</key>
									<string>ActionParameters</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_description</key>
											<string>A dictionary that provides rules similar to the OnDemandRules dictionary, but evaluated on each connection instead of when the network changes. These dictionaries are evaluated in order, and the behavior is determined by the first dictionary that matches.
The keys allowed in each dictionary are described below. Note: This array is used only for dictionaries in which EvaluateConnection is the Action value.</string>
											<key>pfm_name</key>
											<string>ActionParameter</string>
											<key>pfm_subkeys</key>
											<array>
												<dict>
													<key>pfm_description</key>
													<string>Defines the VPN behavior for the specified domains. Allowed values are:
* 'ConnectIfNeeded': The specified domains should trigger a VPN connection attempt if domain name resolution fails, such as when the DNS server indicates that it can't resolve the domain, responds with a redirection to a different server, or fails to respond (timeout).
* 'NeverConnect': The specified domains should never trigger a VPN connection attempt.</string>
													<key>pfm_name</key>
													<string>DomainAction</string>
													<key>pfm_range_list</key>
													<array>
														<string>ConnectIfNeeded</string>
														<string>NeverConnect</string>
													</array>
													<key>pfm_range_list_titles</key>
													<array>
														<string>Connect If Needed</string>
														<string>Never Connect</string>
													</array>
													<key>pfm_require</key>
													<string>always</string>
													<key>pfm_title</key>
													<string>Domain Action</string>
													<key>pfm_type</key>
													<string>string</string>
												</dict>
												<dict>
													<key>pfm_description</key>
													<string>The domains to apply this evaluation.</string>
													<key>pfm_name</key>
													<string>Domains</string>
													<key>pfm_require</key>
													<string>always</string>
													<key>pfm_subkeys</key>
													<array>
														<dict>
															<key>pfm_name</key>
															<string>DomainsElement</string>
															<key>pfm_title</key>
															<string>Domains Element</string>
															<key>pfm_type</key>
															<string>string</string>
														</dict>
													</array>
													<key>pfm_title</key>
													<string>Domains</string>
													<key>pfm_type</key>
													<string>array</string>
												</dict>
												<dict>
													<key>pfm_description</key>
													<string>An array of IP addresses of DNS servers to use for resolving the specified domains. These servers don't need to be part of the device's current network configuration. If these DNS servers aren't reachable, the system establishes a VPN connection. These DNS servers need to be either internal DNS servers or trusted external DNS servers.
This key is valid only if the value of 'DomainAction' is 'ConnectIfNeeded'.</string>
													<key>pfm_name</key>
													<string>RequiredDNSServers</string>
													<key>pfm_subkeys</key>
													<array>
														<dict>
															<key>pfm_name</key>
															<string>RequiredDNSServersElement</string>
															<key>pfm_title</key>
															<string>Required DNS Servers Element</string>
															<key>pfm_type</key>
															<string>string</string>
														</dict>
													</array>
													<key>pfm_title</key>
													<string>Required DNS Servers</string>
													<key>pfm_type</key>
													<string>array</string>
												</dict>
												<dict>
													<key>pfm_description</key>
													<string>An HTTP or HTTPS (preferred) URL to probe, using a GET request. If the URL's hostname can't be resolved, if the server is unreachable, or if the server doesn't respond with a 200 HTTP status code, a VPN connection is established in response.
This key is valid only if the value of 'DomainAction' is 'ConnectIfNeeded'.</string>
													<key>pfm_name</key>
													<string>RequiredURLStringProbe</string>
													<key>pfm_title</key>
													<string>Required URL String Probe</string>
													<key>pfm_type</key>
													<string>string</string>
												</dict>
											</array>
											<key>pfm_title</key>
											<string>Action Parameter</string>
											<key>pfm_type</key>
											<string>dictionary</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>Action Parameters</string>
									<key>pfm_type</key>
									<string>array</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>On Demand Rules Element</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>On Demand Rules</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '1', the Connect On Demand toggle in Settings is disabled for this configuration. Available in iOS 14 and later. Not available in watchOS.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>VPN.OnDemandEnabled</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_min</key>
					<string>14.0</string>
					<key>pfm_name</key>
					<string>OnDemandUserOverrideDisabled</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Enable</string>
						<string>Disable</string>
					</array>
					<key>pfm_title</key>
					<string>Prevent users from toggling VPN On Demand</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>14.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '1', routes all traffic through the VPN, with some exclusions. Several of the exclusions can be controlled with the ExcludeLocalNetworks, ExcludeCellularServices, ExcludeAPNs and ExcludeDeviceCommunication properties. See the documentation for those properties. The following traffic is always excluded from the tunnel. Not available in watchOS.

* Traffic necessary for connecting and maintaining the device's network connection, such as DHCP.
* Traffic necessary for connecting to captive networks.
* Certain cellular services traffic that is not routable over the internet and is instead directly routed to the cellular network. See the ExcludeCellularServices property for more details.
* Network communication with a companion device such as a watchOS device.</string>
					<key>pfm_ios_min</key>
					<string>14.0</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>IncludeAllNetworks</string>
					<key>pfm_platforms</key>
					<array>
						<string>iOS</string>
						<string>macOS</string>
					</array>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_title</key>
					<string>Include All Networks</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>14.0</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.15</string>
						</dict>
						<key>tvOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>VPN.IncludeAllNetworks</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '1' and 'IncludeAllNetworks' is '1', routes all local network traffic outside the VPN. Not available in watchOS.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>VPN.IncludeAllNetworks</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_ios_min</key>
					<string>14.2</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>ExcludeLocalNetworks</string>
					<key>pfm_platforms</key>
					<array>
						<string>iOS</string>
						<string>macOS</string>
					</array>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_title</key>
					<string>Exclude Local Networks</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>14.2</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.15</string>
						</dict>
						<key>tvOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>packet-tunnel</string>
					<key>pfm_description</key>
					<string>The type of VPN service. If the value is 'app-proxy', the service tunnels traffic at the app level. If the value is 'packet-tunnel', the service tunnels traffic at the IP layer. Not available in watchOS.</string>
					<key>pfm_name</key>
					<string>ProviderType</string>
					<key>pfm_range_list</key>
					<array>
						<string>packet-tunnel</string>
						<string>app-proxy</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Packet Tunnel - Tunnel Traffic at IP Level</string>
						<string>App Proxy - Tunnel Traffic at Application Level</string>
					</array>
					<key>pfm_title</key>
					<string>Tunnel Provider Type</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The bundle identifier for the VPN provider. Not available in watchOS.</string>
					<key>pfm_name</key>
					<string>ProviderBundleIdentifier</string>
					<key>pfm_title</key>
					<string>Provider Bundle Identifier</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>If the VPN provider is implemented as a system extension, this field is required. Not available in watchOS.</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>ProviderDesignatedRequirement</string>
					<key>pfm_title</key>
					<string>Provider Designated Requirement</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.15</string>
						</dict>
						<key>visionOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '1', disconnects after an on-demand connection idles.</string>
					<key>pfm_name</key>
					<string>DisconnectOnIdle</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable Disconnect on Idle</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '1', all the VPN's non-default routes take precedence over any locally defined routes.
If 'IncludeAllNetworks' is '1', the system ignores the value of 'EnforceRoutes'.
Available in iOS 14.2 and later, and macOS 11 and later. Not available in watchOS.</string>
					<key>pfm_ios_min</key>
					<string>14.2</string>
					<key>pfm_macos_min</key>
					<string>11.0</string>
					<key>pfm_name</key>
					<string>EnforceRoutes</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_title</key>
					<string>Enforce Routes</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>14.2</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>11.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>1</integer>
					<key>pfm_description</key>
					<string>If '1' and 'IncludeAllNetworks' is '1', then the system excludes internet-routable network traffic for cellular services (VoLTE, Wi-Fi Calling, IMS, MMS, Visual Voicemail, etc.) from the tunnel. Note that some cellular carriers route cellular services traffic directly to the carrier network, bypassing the internet. Such cellular services traffic is always excluded from the tunnel. Not available in watchOS.</string>
					<key>pfm_ios_min</key>
					<string>16.4</string>
					<key>pfm_macos_min</key>
					<string>13.3</string>
					<key>pfm_name</key>
					<string>ExcludeCellularServices</string>
					<key>pfm_platforms</key>
					<array>
						<string>iOS</string>
						<string>macOS</string>
					</array>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_title</key>
					<string>Exclude Cellular Services</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>16.4</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>13.3</string>
						</dict>
						<key>tvOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>1</integer>
					<key>pfm_description</key>
					<string>If 1 and IncludeAllNetworks is 1, then network traffic used for communicating with devices connected via USB or Wi-Fi is excluded from the tunnel.</string>
					<key>pfm_ios_min</key>
					<string>17.4</string>
					<key>pfm_macos_min</key>
					<string>14.4</string>
					<key>pfm_name</key>
					<string>ExcludeDeviceCommunication</string>
					<key>pfm_platforms</key>
					<array>
						<string>iOS</string>
						<string>macOS</string>
					</array>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_title</key>
					<string>Exclude Device Communication</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>17.4</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>14.4</string>
						</dict>
						<key>tvOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
						<key>visionOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>1.1</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>1</integer>
					<key>pfm_description</key>
					<string>If '1' and 'IncludeAllNetworks' is '1', then the system excludes the network traffic for the Apple Push Notification service (APNs) from the tunnel. Not available in watchOS.</string>
					<key>pfm_ios_min</key>
					<string>16.4</string>
					<key>pfm_macos_min</key>
					<string>13.3</string>
					<key>pfm_name</key>
					<string>ExcludeAPNs</string>
					<key>pfm_platforms</key>
					<array>
						<string>iOS</string>
						<string>macOS</string>
					</array>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_title</key>
					<string>Exclude APNs</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>16.4</string>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>13.3</string>
						</dict>
						<key>tvOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>n/a</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The length of time to wait, in seconds, before disconnecting an on-demand connection. In watchOS, the maximum allowed value is '15'.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>VPN.DisconnectOnIdle</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>DisconnectOnIdleTimer</string>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Disconnect on Idle time</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The VPN account password. Only used if AuthenticationMethod is Password.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>Password</string>
										<string>Password+Certificate</string>
									</array>
									<key>pfm_target</key>
									<string>VPN.AuthenticationMethod</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>AuthPassword</string>
					<key>pfm_title</key>
					<string>Account Password</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>VPN</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The dictionary that contains IPv4 settings. Not available in watchOS.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>VPN</string>
								<string>L2TP</string>
								<string>PPTP</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>IPv4</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
				<string>macOS</string>
			</array>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '1', the system sends all network traffic over VPN. Only applies to Cisco IPsec and L2TP VPN types.</string>
					<key>pfm_name</key>
					<string>OverridePrimary</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Override Primary Connection</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>IPv4 Settings</string>
			<key>pfm_type</key>
			<string>dictionary</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>tvOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The dictionary to use to configure 'Proxies' for use with 'VPN'.</string>
			<key>pfm_name</key>
			<string>Proxies</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If '1', enables proxy for HTTP traffic.</string>
					<key>pfm_name</key>
					<string>HTTPEnable</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable HTTP</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If 'true', enables proxy for HTTPS traffic.</string>
					<key>pfm_name</key>
					<string>HTTPSEnable</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable HTTPS</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The host name of the HTTP proxy.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.HTTPEnable</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>HTTPProxy</string>
					<key>pfm_title</key>
					<string>HTTP Proxy</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_target</key>
									<string>Proxies.HTTPProxy</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>The port number of the HTTP proxy. This field is required if 'HTTPProxy' is specified.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.HTTPEnable</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>HTTPPort</string>
					<key>pfm_range_max</key>
					<integer>65535</integer>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>HTTP Port</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The host name of the HTTPS proxy.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.HTTPSEnable</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>HTTPSProxy</string>
					<key>pfm_title</key>
					<string>HTTPS Proxy</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_target</key>
									<string>Proxies.HTTPSProxy</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>The port number of the HTTPS proxy. This field is required if 'HTTPSProxy' is specified.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.HTTPSEnable</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>HTTPSPort</string>
					<key>pfm_range_max</key>
					<integer>65535</integer>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>HTTPS Port</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The user name used for authentication.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.HTTPEnable</string>
								</dict>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.HTTPSEnable</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>HTTPProxyUsername</string>
					<key>pfm_title</key>
					<string>HTTP ProxyUsername</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The password used for authentication.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.HTTPEnable</string>
								</dict>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.HTTPSEnable</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>HTTPProxyPassword</string>
					<key>pfm_title</key>
					<string>HTTP ProxyPassword</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If 'true', enables automatic proxy configuration.</string>
					<key>pfm_name</key>
					<string>ProxyAutoConfigEnable</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Proxy AutoConfig Enable</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>1</integer>
					<key>pfm_description</key>
					<string>If 'true', enables proxy auto discovery.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.ProxyAutoConfigEnable</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_target</key>
									<string>Proxies.ProxyAutoConfigURLString</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>ProxyAutoDiscoveryEnable</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Proxy Auto Discovery Enable</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_type_input</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The URL to the location of the proxy auto-configuration file. Used only when 'ProxyAutoConfigEnable' is 'true'.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.ProxyAutoConfigEnable</string>
								</dict>
							</array>
						</dict>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.ProxyAutoDiscoveryEnable</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>ProxyAutoConfigURLString</string>
					<key>pfm_title</key>
					<string>Proxy Server URL</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>An array of domains that defines which hosts use proxy settings for hosts.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.HTTPEnable</string>
								</dict>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.HTTPSEnable</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>SupplementalMatchDomains</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>SupplementalMatchDomainsElement</string>
							<key>pfm_title</key>
							<string>Supplemental Match Domains Element</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Supplemental Match Domains</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Proxies</string>
			<key>pfm_type</key>
			<string>dictionary</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>watchOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>10.0</string>
				</dict>
			</dict>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>VPN</string>
	<key>pfm_tvos_min</key>
	<string>17.0</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>7</integer>
	<key>pfmx_supported_oses</key>
	<dict>
		<key>iOS</key>
		<dict>
			<key>pfmx_allow_manual_install</key>
			<true/>
			<key>pfmx_introduced</key>
			<string>4.0</string>
			<key>pfmx_multiple</key>
			<true/>
			<key>pfmx_shared_ipad</key>
			<dict>
				<key>pfmx_device_channel</key>
				<true/>
				<key>pfmx_mode</key>
				<string>allowed</string>
				<key>pfmx_user_channel</key>
				<false/>
			</dict>
			<key>pfmx_supervised</key>
			<false/>
			<key>pfmx_user_enrollment</key>
			<dict>
				<key>pfmx_mode</key>
				<string>forbidden</string>
			</dict>
		</dict>
		<key>macOS</key>
		<dict>
			<key>pfmx_allow_manual_install</key>
			<true/>
			<key>pfmx_device_channel</key>
			<true/>
			<key>pfmx_introduced</key>
			<string>10.7</string>
			<key>pfmx_multiple</key>
			<true/>
			<key>pfmx_requires_dep</key>
			<false/>
			<key>pfmx_supervised</key>
			<false/>
			<key>pfmx_user_approved_mdm</key>
			<false/>
			<key>pfmx_user_channel</key>
			<true/>
			<key>pfmx_user_enrollment</key>
			<dict>
				<key>pfmx_mode</key>
				<string>forbidden</string>
			</dict>
		</dict>
		<key>tvOS</key>
		<dict>
			<key>pfmx_allow_manual_install</key>
			<true/>
			<key>pfmx_introduced</key>
			<string>17.0</string>
			<key>pfmx_multiple</key>
			<true/>
			<key>pfmx_supervised</key>
			<false/>
		</dict>
		<key>visionOS</key>
		<dict>
			<key>pfmx_allow_manual_install</key>
			<true/>
			<key>pfmx_introduced</key>
			<string>1.0</string>
			<key>pfmx_multiple</key>
			<true/>
			<key>pfmx_supervised</key>
			<false/>
			<key>pfmx_user_enrollment</key>
			<dict>
				<key>pfmx_mode</key>
				<string>forbidden</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
