<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>The payload that configures cellular settings.</string>
	<key>pfm_description_reference</key>
	<string>The cellular payload is designated by specifying com.apple.cellular as the PayloadType value.
A cellular payload configures cellular network settings for the user-selected data SIM on the device. It is supported
on iOS 7 and later and is not supported on macOS.
Cellular payloads have two important installation requirements:
• Nomorethanonecellularpayloadcanbeinstalledatanytime.
• AcellularpayloadcannotbeinstalledifanAPNpayloadisalreadyinstalled.
This payload replaces the com.apple.managedCarrier payload, which is supported, but deprecated.</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/cellular</string>
	<key>pfm_domain</key>
	<string>com.apple.cellular</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>exclusive</string>
	<key>pfm_ios_min</key>
	<string>7.0</string>
	<key>pfm_last_modified</key>
	<date>2025-12-10T12:16:57Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>iOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>The payload that configures cellular settings.</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Cellular</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.cellular</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the 'TopLevel' value, with an additional appended component. This string must be unique within the profile.

During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.cellular</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs.

During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>An array of access point name (APN) dictionaries.</string>
			<key>pfm_name</key>
			<string>APNs</string>
			<key>pfm_range_max</key>
			<integer>1</integer>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>A dictionary that contains details about an access point name (APN) configuration.</string>
					<key>pfm_name</key>
					<string>APNsItem</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>The name for this configuration.</string>
							<key>pfm_name</key>
							<string>Name</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Data APN name</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<string>PAP</string>
							<key>pfm_description</key>
							<string>The authentication type for logging in.</string>
							<key>pfm_name</key>
							<string>AuthenticationType</string>
							<key>pfm_range_list</key>
							<array>
								<string>CHAP</string>
								<string>PAP</string>
							</array>
							<key>pfm_title</key>
							<string>Data APN authentication type</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The user name for the APN.</string>
							<key>pfm_name</key>
							<string>Username</string>
							<key>pfm_title</key>
							<string>Data APN user name</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The user's password for the APN.</string>
							<key>pfm_name</key>
							<string>Password</string>
							<key>pfm_sensitive</key>
							<true/>
							<key>pfm_title</key>
							<string>Data APN password</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The proxy server's address.</string>
							<key>pfm_name</key>
							<string>ProxyServer</string>
							<key>pfm_title</key>
							<string>Data APN proxy server</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The proxy server's port number.</string>
							<key>pfm_name</key>
							<string>ProxyPort</string>
							<key>pfm_title</key>
							<string>Data APN proxy port</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The default Internet Protocol versions. Available in iOS 10.3 but no longer used in iOS 11 and later. Allowed values:

- '1': IPv4
- '2': IPv6
- '3': Both</string>
							<key>pfm_ios_deprecated</key>
							<string>11.0</string>
							<key>pfm_ios_min</key>
							<string>10.3</string>
							<key>pfm_name</key>
							<string>DefaultProtocolMask</string>
							<key>pfm_range_list</key>
							<array>
								<integer>1</integer>
								<integer>2</integer>
								<integer>3</integer>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>IPv4</string>
								<string>IPv6</string>
								<string>IPv4 and IPv6</string>
							</array>
							<key>pfm_title</key>
							<string>Data APN default IP versions</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The Internet Protocol versions that the system supports. Available in iOS 10.3 and later. Allowed values:

- '1': IPv4
- '2': IPv6
- '3': Both</string>
							<key>pfm_ios_min</key>
							<string>10.3</string>
							<key>pfm_name</key>
							<string>AllowedProtocolMask</string>
							<key>pfm_range_list</key>
							<array>
								<integer>1</integer>
								<integer>2</integer>
								<integer>3</integer>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>IPv4</string>
								<string>IPv6</string>
								<string>IPv4 and IPv6</string>
							</array>
							<key>pfm_title</key>
							<string>Data APN supported IP versions</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The Internet Protocol versions that the system supports while roaming. Available in iOS 10.3 and later. Allowed values:

- '1': IPv4
- '2': IPv6
- '3': Both</string>
							<key>pfm_ios_min</key>
							<string>10.3</string>
							<key>pfm_name</key>
							<string>AllowedProtocolMaskInRoaming</string>
							<key>pfm_range_list</key>
							<array>
								<integer>1</integer>
								<integer>2</integer>
								<integer>3</integer>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>IPv4</string>
								<string>IPv6</string>
								<string>IPv4 and IPv6</string>
							</array>
							<key>pfm_title</key>
							<string>Data APN supported roaming IP versions</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The Internet Protocol versions that the system supports while roaming. Available in iOS 10.3 and later. Allowed values:

- '1': IPv4
- '2': IPv6
- '3': Both</string>
							<key>pfm_ios_min</key>
							<string>10.3</string>
							<key>pfm_name</key>
							<string>AllowedProtocolMaskInDomesticRoaming</string>
							<key>pfm_range_list</key>
							<array>
								<integer>1</integer>
								<integer>2</integer>
								<integer>3</integer>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>IPv4</string>
								<string>IPv6</string>
								<string>IPv4 and IPv6</string>
							</array>
							<key>pfm_title</key>
							<string>Data APN supported domestic roaming IP versions</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<false/>
							<key>pfm_description</key>
							<string>If 'true', the system enables XLAT464. Available in iOS 16 and later and watchOS 9 and later.</string>
							<key>pfm_ios_min</key>
							<string>16.0</string>
							<key>pfm_name</key>
							<string>EnableXLAT464</string>
							<key>pfm_title</key>
							<string>Enable 464XLAT IPv6 and IPv4 Interoperability</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Data APN</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<dict/>
			<key>pfm_description</key>
			<string>A configuration dictionary.</string>
			<key>pfm_name</key>
			<string>AttachAPN</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>The name for this configuration.</string>
					<key>pfm_name</key>
					<string>Name</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>Default APN name</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>PAP</string>
					<key>pfm_description</key>
					<string>The authentication type.</string>
					<key>pfm_name</key>
					<string>AuthenticationType</string>
					<key>pfm_range_list</key>
					<array>
						<string>CHAP</string>
						<string>PAP</string>
					</array>
					<key>pfm_title</key>
					<string>Default APN authentication type</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The user name.</string>
					<key>pfm_name</key>
					<string>Username</string>
					<key>pfm_title</key>
					<string>Default APN user name</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The password for the user.</string>
					<key>pfm_name</key>
					<string>Password</string>
					<key>pfm_sensitive</key>
					<true/>
					<key>pfm_title</key>
					<string>Default APN password</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The Internet Protocol versions that the system supports. Allowed values:

- '1': IPv4
- '2': IPv6
- '3': Both</string>
					<key>pfm_ios_min</key>
					<string>10.3</string>
					<key>pfm_name</key>
					<string>AllowedProtocolMask</string>
					<key>pfm_range_list</key>
					<array>
						<integer>1</integer>
						<integer>2</integer>
						<integer>3</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>IPv4</string>
						<string>IPv6</string>
						<string>IPv4 and IPv6</string>
					</array>
					<key>pfm_title</key>
					<string>Default APN supported IP versions</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Default APN</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Cellular</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>3</integer>
</dict>
</plist>
