<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>The payload that configures a Calendar account.</string>
	<key>pfm_description_reference</key>
	<string>The payload is designated by specifying com.apple.caldav.account as the PayloadType. This payload configures a CalDAV account.</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/caldav</string>
	<key>pfm_domain</key>
	<string>com.apple.caldav.account</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_ios_min</key>
	<string>4.0</string>
	<key>pfm_last_modified</key>
	<date>2025-09-17T09:38:09Z</date>
	<key>pfm_macos_min</key>
	<string>10.7</string>
	<key>pfm_platforms</key>
	<array>
		<string>iOS</string>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>The payload that configures a Calendar account.</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>CalDAV</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.caldav.account</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the 'TopLevel' value, with an additional appended component. This string must be unique within the profile.

During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.caldav.account</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs.

During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>My Calendar Account</string>
			<key>pfm_description</key>
			<string>The description of the account.</string>
			<key>pfm_name</key>
			<string>CalDAVAccountDescription</string>
			<key>pfm_title</key>
			<string>Account Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The server's address.</string>
			<key>pfm_name</key>
			<string>CalDAVHostName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Account Hostname</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>443</integer>
			<key>pfm_description</key>
			<string>The server's port.</string>
			<key>pfm_name</key>
			<string>CalDAVPort</string>
			<key>pfm_range_max</key>
			<integer>65535</integer>
			<key>pfm_range_min</key>
			<integer>0</integer>
			<key>pfm_title</key>
			<string>Port Number</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The base URL to the user's calendar.</string>
			<key>pfm_name</key>
			<string>CalDAVPrincipalURL</string>
			<key>pfm_title</key>
			<string>Principal URL</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_platforms</key>
							<array>
								<string>macOS</string>
							</array>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>The user name for logins. If this profile is part of a non-interactive install, the system requires this field.</string>
			<key>pfm_name</key>
			<string>CalDAVUsername</string>
			<key>pfm_require</key>
			<string>push</string>
			<key>pfm_title</key>
			<string>Account Username</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The user's password. Only use this in encrypted profiles.</string>
			<key>pfm_name</key>
			<string>CalDAVPassword</string>
			<key>pfm_sensitive</key>
			<true/>
			<key>pfm_title</key>
			<string>Account Password</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'true', the system enables SSL.</string>
			<key>pfm_name</key>
			<string>CalDAVUseSSL</string>
			<key>pfm_note</key>
			<string>An issue resolved with the release of iOS 16 caused the actual default value of this preference on earlier versions of iOS to be false, as opposed to the documented value of true.</string>
			<key>pfm_title</key>
			<string>Use SSL</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The VPNUUID of the per-app VPN the account uses for network communication. Available in iOS 14 and later.</string>
			<key>pfm_ios_min</key>
			<string>14.0</string>
			<key>pfm_name</key>
			<string>VPNUUID</string>
			<key>pfm_platforms</key>
			<array>
				<string>iOS</string>
			</array>
			<key>pfm_title</key>
			<string>VPNUUID</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>14.0</string>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>n/a</string>
				</dict>
			</dict>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>Calendar</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>2</integer>
	<key>pfmx_supported_oses</key>
	<dict>
		<key>iOS</key>
		<dict>
			<key>pfmx_allow_manual_install</key>
			<true/>
			<key>pfmx_introduced</key>
			<string>4.0</string>
			<key>pfmx_multiple</key>
			<true/>
			<key>pfmx_shared_ipad</key>
			<dict>
				<key>pfmx_device_channel</key>
				<false/>
				<key>pfmx_mode</key>
				<string>allowed</string>
				<key>pfmx_user_channel</key>
				<true/>
			</dict>
			<key>pfmx_supervised</key>
			<false/>
			<key>pfmx_user_enrollment</key>
			<dict>
				<key>pfmx_mode</key>
				<string>allowed</string>
			</dict>
		</dict>
		<key>macOS</key>
		<dict>
			<key>pfmx_allow_manual_install</key>
			<true/>
			<key>pfmx_device_channel</key>
			<false/>
			<key>pfmx_introduced</key>
			<string>10.7</string>
			<key>pfmx_multiple</key>
			<true/>
			<key>pfmx_requires_dep</key>
			<false/>
			<key>pfmx_supervised</key>
			<false/>
			<key>pfmx_user_approved_mdm</key>
			<false/>
			<key>pfmx_user_channel</key>
			<true/>
			<key>pfmx_user_enrollment</key>
			<dict>
				<key>pfmx_mode</key>
				<string>allowed</string>
			</dict>
		</dict>
		<key>visionOS</key>
		<dict>
			<key>pfmx_allow_manual_install</key>
			<true/>
			<key>pfmx_introduced</key>
			<string>1.1</string>
			<key>pfmx_multiple</key>
			<true/>
			<key>pfmx_supervised</key>
			<false/>
			<key>pfmx_user_enrollment</key>
			<dict>
				<key>pfmx_mode</key>
				<string>allowed</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
