<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>The payload that configures restrictions on a device.</string>
	<key>pfm_description_reference</key>
	<string>The Restrictions payload is designated by specifying com.apple.applicationaccess as the PayloadType value. A Restrictions payload allows the administrator to restrict the user from doing certain things with the device, such as using the camera. The Restrictions payload is supported in iOS; some keys are also supported in macOS, as noted below.</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/restrictions</string>
	<key>pfm_domain</key>
	<string>com.apple.applicationaccess</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_last_modified</key>
	<date>2025-11-05T14:06:39Z</date>
	<key>pfm_macos_min</key>
	<string>10.7</string>
	<key>pfm_note</key>
	<string>Important:
The system allows multiple Restrictions payloads. However, don't attempt to manage the same restriction in different payloads. Doing so results in unexpected behavior.</string>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subdomain</key>
	<string>macOS</string>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>The payload that configures restrictions on a device.</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Restrictions</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.applicationaccess</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile.
During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.applicationaccess</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs.
During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>General</string>
				<string>AI and Siri</string>
				<string>AirDrop</string>
				<string>AirPlay</string>
				<string>AirPrint</string>
				<string>iCloud</string>
				<string>Media</string>
				<string>Passwords and Unlock</string>
				<string>Classroom</string>
				<string>Updates</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>AI and Siri</key>
				<array>
					<string>allowAssistant</string>
					<string>forceAssistantProfanityFilter</string>
					<string>allowGenmoji</string>
					<string>allowImagePlayground</string>
					<string>allowWritingTools</string>
					<string>allowMailSummary</string>
					<string>allowMailSmartReplies</string>
					<string>allowExternalIntelligenceIntegrations</string>
					<string>allowExternalIntelligenceIntegrationsSignIn</string>
					<string>allowedExternalIntelligenceWorkspaceIDs</string>
					<string>allowNotesTranscriptionSummary</string>
					<string>allowNotesTranscription</string>
					<string>allowAppleIntelligenceReport</string>
					<string>allowSafariSummary</string>
				</array>
				<key>AirDrop</key>
				<array>
					<string>allowAirDrop</string>
				</array>
				<key>AirPlay</key>
				<array>
					<string>allowAirPlayIncomingRequests</string>
				</array>
				<key>AirPrint</key>
				<array>
					<string>allowAirPrintiBeaconDiscovery</string>
					<string>forceAirPrintTrustedTLSRequirement</string>
				</array>
				<key>Classroom</key>
				<array>
					<string>forceClassroomAutomaticallyJoinClasses</string>
					<string>forceClassroomRequestPermissionToLeaveClasses</string>
					<string>forceClassroomUnpromptedAppAndDeviceLock</string>
					<string>forceClassroomUnpromptedScreenObservation</string>
				</array>
				<key>General</key>
				<array>
					<string>allowAccountModification</string>
					<string>allowApplePersonalizedAdvertising</string>
					<string>allowActivityContinuation</string>
					<string>allowAddingGameCenterFriends</string>
					<string>allowARDRemoteManagementModification</string>
					<string>allowBluetoothSharingModification</string>
					<string>allowCamera</string>
					<string>allowContentCaching</string>
					<string>allowDefinitionLookup</string>
					<string>allowDeprecatedWebKitTLS</string>
					<string>allowDeviceNameModification</string>
					<string>allowDictation</string>
					<string>allowEraseContentAndSettings</string>
					<string>allowFindMyDevice</string>
					<string>allowFindMyFriends</string>
					<string>allowFileSharingModification</string>
					<string>allowBookstore</string>
					<string>allowGameCenter</string>
					<string>allowLiveVoicemail</string>
					<string>allowMultiplayerGaming</string>
					<string>allowInternetSharingModification</string>
					<string>allowLocalUserCreation</string>
					<string>forceOnDeviceOnlyTranslation</string>
					<string>allowMailPrivacyProtection</string>
					<string>allowPrinterSharingModification</string>
					<string>allowUniversalControl</string>
					<string>allowMusicService</string>
					<string>allowRemoteAppleEventsModification</string>
					<string>allowRemoteScreenObservation</string>
					<string>allowScreenShot</string>
					<string>allowStartupDiskModification</string>
					<string>allowTimeMachineBackup</string>
					<string>allowUIConfigurationProfileInstallation</string>
					<string>allowSpotlightInternetResults</string>
					<string>allowiTunesFileSharing</string>
					<string>allowUSBRestrictedMode</string>
					<string>allowWallpaperModification</string>
					<string>forceOnDeviceOnlyDictation</string>
					<string>safariAllowAutoFill</string>
					<string>allowiPhoneMirroring</string>
					<string>allowCallRecording</string>
					<string>allowMediaSharingModification</string>
					<string>forceBypassScreenCaptureAlert</string>
					<string>allowSafariHistoryClearing</string>
					<string>allowSafariPrivateBrowsing</string>
					<string>allowRosettaUsageAwareness</string>
				</array>
				<key>Media</key>
				<array>
					<string>allowBookstoreErotica</string>
					<string>allowExplicitContent</string>
					<string>ratingApps</string>
					<string>ratingMovies</string>
					<string>ratingRegion</string>
					<string>ratingTVShows</string>
				</array>
				<key>Passwords and Unlock</key>
				<array>
					<string>allowAutoUnlock</string>
					<string>allowFingerprintForUnlock</string>
					<string>allowFingerprintModification</string>
					<string>allowPasscodeModification</string>
					<string>allowPasswordAutoFill</string>
					<string>allowPasswordProximityRequests</string>
					<string>allowPasswordSharing</string>
					<string>enforcedFingerprintTimeout</string>
				</array>
				<key>Updates</key>
				<array>
					<string>enforcedSoftwareUpdateDelay</string>
					<string>enforcedSoftwareUpdateMajorOSDeferredInstallDelay</string>
					<string>enforcedSoftwareUpdateMinorOSDeferredInstallDelay</string>
					<string>enforcedSoftwareUpdateNonOSDeferredInstallDelay</string>
					<string>forceDelayedAppSoftwareUpdates</string>
					<string>forceDelayedMajorSoftwareUpdates</string>
					<string>forceDelayedSoftwareUpdates</string>
					<string>allowRapidSecurityResponseInstallation</string>
					<string>allowRapidSecurityResponseRemoval</string>
				</array>
				<key>iCloud</key>
				<array>
					<string>allowCloudAddressBook</string>
					<string>allowCloudBTMM</string>
					<string>allowCloudBookmarks</string>
					<string>allowCloudCalendar</string>
					<string>allowCloudDesktopAndDocuments</string>
					<string>allowCloudDocumentSync</string>
					<string>allowCloudFMM</string>
					<string>allowCloudFreeform</string>
					<string>allowCloudKeychainSync</string>
					<string>allowCloudMail</string>
					<string>allowCloudNotes</string>
					<string>allowCloudPhotoLibrary</string>
					<string>allowCloudPrivateRelay</string>
					<string>allowCloudReminders</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables AirDrop.</string>
			<key>pfm_documentation_url</key>
			<string>https://developer.apple.com/documentation/devicemanagement/restrictions</string>
			<key>pfm_macos_min</key>
			<string>10.13</string>
			<key>pfm_name</key>
			<string>allowAirDrop</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow AirDrop</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables incoming AirPlay requests.</string>
			<key>pfm_macos_min</key>
			<string>12.3</string>
			<key>pfm_name</key>
			<string>allowAirPlayIncomingRequests</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow incoming AirPlay requests</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables:

- The AutoFill Passwords feature in iOS, with Keychain and third-party password managers
- Prompting the user to use a saved password in Safari or in apps
- Automatic strong passwords
- Suggesting strong passwords to users

However, if 'false', the system doesn't prevent AutoFill for contact info and credit cards in Safari.</string>
			<key>pfm_macos_min</key>
			<string>10.14</string>
			<key>pfm_name</key>
			<string>allowPasswordAutoFill</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow password AutoFill</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disallows auto unlock. Support for this restriction on unsupervised devices is deprecated.</string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
			<key>pfm_name</key>
			<string>allowAutoUnlock</string>
			<key>pfm_title</key>
			<string>Allow Apple Watch to auto unlock device</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables the camera and removes its icon from the Home Screen, and users are unable to take photographs. Support for this restriction on unsupervised devices is deprecated.</string>
			<key>pfm_macos_min</key>
			<string>10.11</string>
			<key>pfm_name</key>
			<string>allowCamera</string>
			<key>pfm_title</key>
			<string>Allow Camera Use</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables content caching. This restriction is not supported on the user channel.</string>
			<key>pfm_macos_deprecated</key>
			<string>10.13.4</string>
			<key>pfm_macos_min</key>
			<string>10.13</string>
			<key>pfm_name</key>
			<string>allowContentCaching</string>
			<key>pfm_targets</key>
			<array>
				<string>system</string>
			</array>
			<key>pfm_title</key>
			<string>Allow Content Caching</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_macos_min</key>
			<string>14.0</string>
			<key>pfm_name</key>
			<string>forceOnDeviceOnlyTranslation</string>
			<key>pfm_title</key>
			<string>Force on-device only translation</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system limits Apple personalized advertising.</string>
			<key>pfm_macos_min</key>
			<string>12.0</string>
			<key>pfm_name</key>
			<string>allowApplePersonalizedAdvertising</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_macos_min</key>
			<string>12</string>
			<key>pfm_name</key>
			<string>allowMailPrivacyProtection</string>
			<key>pfm_title</key>
			<string>Allow mail privacy protection</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents modifying Printer Sharing settings in System Settings.</string>
			<key>pfm_macos_min</key>
			<string>14.0</string>
			<key>pfm_name</key>
			<string>allowPrinterSharingModification</string>
			<key>pfm_title</key>
			<string>Allow modifying Printer Sharing setting</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables Universal Control.</string>
			<key>pfm_macos_min</key>
			<string>13.0</string>
			<key>pfm_name</key>
			<string>allowUniversalControl</string>
			<key>pfm_title</key>
			<string>Allow Universal Control</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables iTunes file sharing services.</string>
			<key>pfm_macos_min</key>
			<string>10.13</string>
			<key>pfm_name</key>
			<string>allowiTunesFileSharing</string>
			<key>pfm_title</key>
			<string>Allow iTunes File Sharing</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables modification of accounts, such as Apple Accounts, and internet-based accounts, such as Mail, Contacts, and Calendar.</string>
			<key>pfm_macos_min</key>
			<string>14.0</string>
			<key>pfm_name</key>
			<string>allowAccountModification</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables activity continuation. Support for this restriction on unsupervised devices and with Managed Apple Accounts is deprecated. In a future release, this restriction will begin requiring supervision and will apply to personal Apple Accounts only.</string>
			<key>pfm_macos_min</key>
			<string>10.15</string>
			<key>pfm_name</key>
			<string>allowActivityContinuation</string>
			<key>pfm_title</key>
			<string>Allow Handoff</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents the device from automatically submitting diagnostic reports to Apple.</string>
			<key>pfm_documentation_url</key>
			<string>https://developer.apple.com/documentation/devicemanagement/restrictions</string>
			<key>pfm_macos_min</key>
			<string>10.13</string>
			<key>pfm_name</key>
			<string>allowDiagnosticSubmission</string>
			<key>pfm_title</key>
			<string>Allow diagnostic submission</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables the Music service, and the Music app reverts to classic mode.</string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
			<key>pfm_name</key>
			<string>allowMusicService</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Apple Music</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents modifying Remote Apple Events Sharing settings in System Settings.</string>
			<key>pfm_macos_min</key>
			<string>14.0</string>
			<key>pfm_name</key>
			<string>allowRemoteAppleEventsModification</string>
			<key>pfm_title</key>
			<string>Allow modifying Remote Apple Events Sharing setting</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_description_reference</key>
			<string>Optional. When false, disallows macOS Back to My Mac iCloud service. Availability: Available in macOS 10.12 and 10.13.</string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
			<key>pfm_name</key>
			<string>allowCloudBTMM</string>
			<key>pfm_title</key>
			<string>Allow iCloud Back to My Mac</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables iCloud Bookmark sync.</string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
			<key>pfm_name</key>
			<string>allowCloudBookmarks</string>
			<key>pfm_title</key>
			<string>Allow iCloud Bookmarks</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables iCloud Calendar services.</string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
			<key>pfm_name</key>
			<string>allowCloudCalendar</string>
			<key>pfm_title</key>
			<string>Allow iCloud Calendar</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables iCloud Contacts services.</string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
			<key>pfm_name</key>
			<string>allowCloudAddressBook</string>
			<key>pfm_title</key>
			<string>Allow iCloud Contacts</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables document and key-value syncing to iCloud. Requires a supervised device in iOS 13 and later, and Shared iPad doesn't support it. Support for this restriction on unsupervised devices and with Managed Apple Accounts is deprecated.</string>
			<key>pfm_macos_min</key>
			<string>10.11</string>
			<key>pfm_name</key>
			<string>allowCloudDocumentSync</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow iCloud Document Sync</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables iCloud Desktop and Document services.</string>
			<key>pfm_macos_min</key>
			<string>10.12.4</string>
			<key>pfm_name</key>
			<string>allowCloudDesktopAndDocuments</string>
			<key>pfm_title</key>
			<string>Allow iCloud Desktop &amp; Documents</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_description_reference</key>
			<string>Optional. When false, disallows macOS Find My Mac iCloud service. Availability: Available in macOS 10.12 and later.</string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
			<key>pfm_name</key>
			<string>allowCloudFMM</string>
			<key>pfm_title</key>
			<string>Allow iCloud Find My Mac</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disallows iCloud Freeform services.</string>
			<key>pfm_macos_min</key>
			<string>14.0</string>
			<key>pfm_name</key>
			<string>allowCloudFreeform</string>
			<key>pfm_title</key>
			<string>Allow Cloud Freeform</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables iCloud Keychain synchronization. Support for this restriction on unsupervised devices and with Managed Apple Accounts is deprecated.</string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
			<key>pfm_name</key>
			<string>allowCloudKeychainSync</string>
			<key>pfm_title</key>
			<string>Allow iCloud Keychain</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables iCloud Mail services.</string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
			<key>pfm_name</key>
			<string>allowCloudMail</string>
			<key>pfm_title</key>
			<string>Allow iCloud Mail</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables iCloud Notes services.</string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
			<key>pfm_name</key>
			<string>allowCloudNotes</string>
			<key>pfm_title</key>
			<string>Allow iCloud Notes</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables iCloud Photo Library. The system removes any photos from local storage that aren't fully downloaded from iCloud Photo Library to the device. Support for this restriction on unsupervised devices and with Managed Apple Accounts is deprecated.</string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
			<key>pfm_name</key>
			<string>allowCloudPhotoLibrary</string>
			<key>pfm_title</key>
			<string>Allow iCloud Photo Library</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables iCloud Reminder services.</string>
			<key>pfm_macos_min</key>
			<string>10.12</string>
			<key>pfm_name</key>
			<string>allowCloudReminders</string>
			<key>pfm_title</key>
			<string>Allow iCloud Reminders</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables iCloud Private Relay. Support for this restriction on unsupervised devices and with Managed Apple Accounts is deprecated.</string>
			<key>pfm_macos_min</key>
			<string>12.0</string>
			<key>pfm_name</key>
			<string>allowCloudPrivateRelay</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow iCloud Private Relay</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables Spotlight Internet search results in Siri Suggestions. Support for this restriction on unsupervised devices is deprecated.</string>
			<key>pfm_macos_min</key>
			<string>10.11</string>
			<key>pfm_name</key>
			<string>allowSpotlightInternetResults</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Siri Suggestions</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables the Erase All Content and Settings option in the Reset UI.</string>
			<key>pfm_macos_min</key>
			<string>12.0</string>
			<key>pfm_name</key>
			<string>allowEraseContentAndSettings</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Erase All Content and Settings</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents modifying File Sharing setting in System Settings.</string>
			<key>pfm_macos_min</key>
			<string>14.0</string>
			<key>pfm_name</key>
			<string>allowFileSharingModification</string>
			<key>pfm_title</key>
			<string>Allow modifying File Sharing setting</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents Touch ID, Face ID, or Optic ID from unlocking a device. Support for this restriction on unsupervised devices is deprecated.</string>
			<key>pfm_macos_min</key>
			<string>10.12.4</string>
			<key>pfm_name</key>
			<string>allowFingerprintForUnlock</string>
			<key>pfm_title</key>
			<string>Allow Touch ID to Unlock Device</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents the user from modifying Touch ID or Face ID.</string>
			<key>pfm_macos_min</key>
			<string>14.0</string>
			<key>pfm_name</key>
			<string>allowFingerprintModification</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Modifying Touch ID Fingerprints</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables definition lookup.</string>
			<key>pfm_macos_deprecated</key>
			<string>26.4</string>
			<key>pfm_macos_min</key>
			<string>10.11</string>
			<key>pfm_name</key>
			<string>allowDefinitionLookup</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Define</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Allow websites that use TLS 1.0 and TLS 1.1 to be accessed using Safari.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.jamf.com/10.20.0/jamf-pro/release-notes/What%27s_New.html</string>
			<key>pfm_macos_min</key>
			<string>10.15.4</string>
			<key>pfm_name</key>
			<string>allowDeprecatedWebKitTLS</string>
			<key>pfm_title</key>
			<string>Allow accessing websites using TLS 1.0 and 1.1</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents the user from changing the device name.</string>
			<key>pfm_macos_min</key>
			<string>14.0</string>
			<key>pfm_name</key>
			<string>allowDeviceNameModification</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Modifying Device Name</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables Game Center, and the system removes its icon from the Home Screen.</string>
			<key>pfm_macos_min</key>
			<string>10.13</string>
			<key>pfm_name</key>
			<string>allowGameCenter</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Game Center</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prohibits multiplayer gaming.</string>
			<key>pfm_macos_min</key>
			<string>10.13</string>
			<key>pfm_name</key>
			<string>allowMultiplayerGaming</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Multiplayer Gaming</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents modifying the Internet Sharing setting in System Settings.</string>
			<key>pfm_macos_min</key>
			<string>14.0</string>
			<key>pfm_name</key>
			<string>allowInternetSharingModification</string>
			<key>pfm_title</key>
			<string>Allow modifying Internet Sharing setting</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents creating users in System Settings.</string>
			<key>pfm_macos_min</key>
			<string>14.0</string>
			<key>pfm_name</key>
			<string>allowLocalUserCreation</string>
			<key>pfm_title</key>
			<string>Allow creating users in System Settings</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prohibits adding friends to Game Center. Requires a supervised device in iOS 13 and later.</string>
			<key>pfm_macos_min</key>
			<string>10.13</string>
			<key>pfm_name</key>
			<string>allowAddingGameCenterFriends</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Adding Game Center Friends</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The two-letter key that profile tools use to display the proper ratings for the given region. The client doesn't recognize or report this data.</string>
			<key>pfm_name</key>
			<string>ratingRegion</string>
			<key>pfm_range_list</key>
			<array>
				<string>us</string>
				<string>au</string>
				<string>ca</string>
				<string>de</string>
				<string>fr</string>
				<string>ie</string>
				<string>jp</string>
				<string>nz</string>
				<string>gb</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>United States</string>
				<string>Australia</string>
				<string>Canada</string>
				<string>Germany</string>
				<string>France</string>
				<string>Ireland</string>
				<string>Japan</string>
				<string>New Zealand</string>
				<string>United Kingdom</string>
			</array>
			<key>pfm_title</key>
			<string>Ratings region</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1000</integer>
			<key>pfm_description</key>
			<string>The maximum level of app content allowed on the device. Starting with iOS 26.2, this rating may apply to certain system apps.

Age bands and the number of discrete age values vary by region, but the values are consistent across regions. For example, in a region that defines rating level 14+, its value is guaranteed to be larger than 300 (12+) and smaller than 600 (17+). Also, the value of rating level 15+ is guaranteed to be larger than the assigned value of rating level 14+. For more information about age ratings, see [Age ratings values and definitions](https://developer.apple.com/help/app-store-connect/reference/age-ratings-values-and-definitions).

Below is the complete list of age rating values used across all App Store regions.
- '1000': All
- '621': 21+
- '620': 20+
- '619': 19+
- '618': 18+
- '600': 17+
- '416': 16+
- '415': 15+
- '314': 14+
- '313': 13+
- '300': 12+
- '211': 11+
- '210': 10+
- '200': 9+
- '108': 8+
- '107': 7+
- '106': 6+
- '105': 5+
- '100': 4+
- '3': 3+
- '2': 2+
- '1': 1+
- '0': None

This restriction will require supervision in a future release.</string>
			<key>pfm_macos_min</key>
			<string>15.0</string>
			<key>pfm_name</key>
			<string>ratingApps</string>
			<key>pfm_range_max</key>
			<integer>1000</integer>
			<key>pfm_range_min</key>
			<integer>0</integer>
			<key>pfm_title</key>
			<string>Apps Ranking Number</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1000</integer>
			<key>pfm_description</key>
			<string>The maximum level of movie content allowed on the device. Support for this restriction on unsupervised devices is deprecated.

Possible values, with the U.S. description of the rating level:

- '1000': All
- '500': NC-17
- '400': R
- '300': PG-13
- '200': PG
- '100': G
- '0': None</string>
			<key>pfm_macos_min</key>
			<string>15.0</string>
			<key>pfm_name</key>
			<string>ratingMovies</string>
			<key>pfm_range_max</key>
			<integer>1000</integer>
			<key>pfm_range_min</key>
			<integer>0</integer>
			<key>pfm_title</key>
			<string>Movies Ranking Number</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1000</integer>
			<key>pfm_description</key>
			<string>The maximum level of TV content allowed on the device. Support for this restriction on unsupervised devices is deprecated.

Possible values, with the U.S. description of the rating level:

- '1000': All
- '600': TV-MA
- '500': TV-14
- '400': TV-PG
- '300': TV-G
- '200': TV-Y7
- '100': TV-Y
- '0': None</string>
			<key>pfm_macos_min</key>
			<string>15.0</string>
			<key>pfm_name</key>
			<string>ratingTVShows</string>
			<key>pfm_range_max</key>
			<integer>1000</integer>
			<key>pfm_range_min</key>
			<integer>0</integer>
			<key>pfm_title</key>
			<string>TV Shows Ranking Number</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system hides explicit music or video content purchased from the iTunes Store. The system marks explicit content as such by content providers, such as record labels, when sold through the iTunes Store. Explicit content in the News and Podcast apps is also hidden.

Requires a supervised device in iOS 13 and later. Support for this restriction on unsupervised devices is deprecated.</string>
			<key>pfm_macos_min</key>
			<string>15.0</string>
			<key>pfm_name</key>
			<string>allowExplicitContent</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Explicit Content</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system removes the Book Store tab from the Books app.</string>
			<key>pfm_macos_min</key>
			<string>15.0</string>
			<key>pfm_name</key>
			<string>allowBookstore</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Bookstore</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents the user from downloading Apple Books media that's tagged as erotica. Support for this restriction on unsupervised devices is deprecated.</string>
			<key>pfm_macos_min</key>
			<string>15.0</string>
			<key>pfm_name</key>
			<string>allowBookstoreErotica</string>
			<key>pfm_title</key>
			<string>Allow Bookstore Erotica</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents modifying the Remote Management Sharing setting in System Settings.</string>
			<key>pfm_macos_min</key>
			<string>14.0</string>
			<key>pfm_name</key>
			<string>allowARDRemoteManagementModification</string>
			<key>pfm_title</key>
			<string>Allow modifying Remote Management Sharing setting</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents modifying Bluetooth settings in System Settings.</string>
			<key>pfm_macos_min</key>
			<string>14.0</string>
			<key>pfm_name</key>
			<string>allowBluetoothSharingModification</string>
			<key>pfm_title</key>
			<string>Allow modifying Bluetooth Sharing setting</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables sharing passwords with the AirDrop passwords feature, or with the Passwords app.</string>
			<key>pfm_macos_min</key>
			<string>10.14</string>
			<key>pfm_name</key>
			<string>allowPasswordSharing</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow password sharing</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_description_reference</key>
			<string>Supervised only. If set to false, disables iBeacon discovery of AirPrint printers. This prevents spurious AirPrint Bluetooth beacons from phishing for network traffic. Defaults to true. Availability: Available in iOS 11.0 and later and macOS 10.13.</string>
			<key>pfm_macos_min</key>
			<string>10.13.0</string>
			<key>pfm_name</key>
			<string>allowAirPrintiBeaconDiscovery</string>
			<key>pfm_note</key>
			<string>Apple documentation does not indicate that this preference is supported on macOS, but Jamf includes it with a min macOS of 10.13.</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow discovery of AirPrint printers using iBeacons</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_description_reference</key>
			<string>Supervised only. If set to true, requires trusted certificates for TLS printing communication. Defaults to false. Availability: Available in iOS 11.0 and later and macOS 10.13 and later.</string>
			<key>pfm_macos_min</key>
			<string>10.13.0</string>
			<key>pfm_name</key>
			<string>forceAirPrintTrustedTLSRequirement</string>
			<key>pfm_note</key>
			<string>Apple documentation does not indicate that this preference is supported on macOS, but Jamf includes it with a min macOS of 10.13.</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Disallow AirPrint to destinations with untrusted certificates</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables saving a screenshot of the display and capturing a screen recording. It also disables the Classroom app from observing remote screens.</string>
			<key>pfm_macos_min</key>
			<string>10.14.4</string>
			<key>pfm_name</key>
			<string>allowScreenShot</string>
			<key>pfm_title</key>
			<string>Allow Screenshots and Screen Recording</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents modification of Startup Disk settings in System Settings.</string>
			<key>pfm_macos_min</key>
			<string>14.0</string>
			<key>pfm_name</key>
			<string>allowStartupDiskModification</string>
			<key>pfm_title</key>
			<string>Allow modifying Startup Disk settings</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents modification of Time Machine settings in System Settings. This restriction is not supported on the user channel.</string>
			<key>pfm_macos_min</key>
			<string>14.0</string>
			<key>pfm_name</key>
			<string>allowTimeMachineBackup</string>
			<key>pfm_targets</key>
			<array>
				<string>system</string>
			</array>
			<key>pfm_title</key>
			<string>Allow modifying Time Machine settings</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prohibits the user from installing configuration profiles and certificates interactively.</string>
			<key>pfm_macos_min</key>
			<string>13.0</string>
			<key>pfm_name</key>
			<string>allowUIConfigurationProfileInstallation</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow UI Configuration Profile Installation</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables remote screen observation by the Classroom app. Nest this key beneath 'allowScreenShot' as a subrestriction. If 'allowScreenShot' is 'false', the Classroom app doesn't observe remote screens. Requires a supervised device until iOS 13 and macOS 10.15. Allowed for user enrollments in macOS 12 and later.</string>
			<key>pfm_macos_min</key>
			<string>10.14.4</string>
			<key>pfm_name</key>
			<string>allowRemoteScreenObservation</string>
			<key>pfm_note</key>
			<string>As of iOS 13 and macOS 10.15, this preference requires the device to be supervised.</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Remote Screen Observation</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true' and 'ScreenObservationPermissionModificationAllowed' is also 'true' in the Education payload, a student enrolled in a managed course through the Classroom app automatically gives permission to that course teacher's requests to observe the student's screen without prompting the student.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_domain</key>
							<string>com.apple.education</string>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>ScreenObservationPermissionModificationAllowed</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_macos_min</key>
			<string>10.14.4</string>
			<key>pfm_name</key>
			<string>forceClassroomUnpromptedScreenObservation</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Classroom app to perform AirPlay and View Screen without prompting</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system allows the teacher to lock apps or the device without prompting the student.</string>
			<key>pfm_macos_min</key>
			<string>10.14.4</string>
			<key>pfm_name</key>
			<string>forceClassroomUnpromptedAppAndDeviceLock</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Classroom to lock apps or the device without prompting</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system automatically gives permission to the teacher's requests without prompting the student.</string>
			<key>pfm_macos_min</key>
			<string>10.14.4</string>
			<key>pfm_name</key>
			<string>forceClassroomAutomaticallyJoinClasses</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Automatically join Classroom classes without prompting</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', a student enrolled in an unmanaged course through Classroom needs to request permission from the teacher to leave the course.</string>
			<key>pfm_macos_min</key>
			<string>10.14.4</string>
			<key>pfm_name</key>
			<string>forceClassroomRequestPermissionToLeaveClasses</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Require teacher permission to leave Classroom app unmanaged classes</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents modification of Bluetooth settings.</string>
			<key>pfm_macos_min</key>
			<string>13.0</string>
			<key>pfm_name</key>
			<string>allowBluetoothModification</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow modifying Bluetooth settings</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables requesting passwords from nearby devices.</string>
			<key>pfm_macos_min</key>
			<string>10.14</string>
			<key>pfm_name</key>
			<string>allowPasswordProximityRequests</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow proximity based password sharing requests</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents adding, changing, or removing the passcode. The system ignores this restriction on Shared iPad.</string>
			<key>pfm_macos_min</key>
			<string>10.13</string>
			<key>pfm_name</key>
			<string>allowPasscodeModification</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Modifying Passcode</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prevents changing the wallpaper.</string>
			<key>pfm_macos_min</key>
			<string>10.13</string>
			<key>pfm_name</key>
			<string>allowWallpaperModification</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Modifying Wallpaper</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system allows iOS devices to always connect to USB accessories while locked. In macOS, allows new USB and Thunderbolt accessories, and SD cards to connect without authorization. If the system has Lockdown mode enabled, it ignores this value. This restriction is not supported on the user channel.</string>
			<key>pfm_macos_min</key>
			<string>13.0</string>
			<key>pfm_name</key>
			<string>allowUSBRestrictedMode</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_targets</key>
			<array>
				<string>system</string>
			</array>
			<key>pfm_title</key>
			<string>Allow USB Restricted Mode</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables Siri.</string>
			<key>pfm_macos_deprecated</key>
			<string>26.4</string>
			<key>pfm_macos_min</key>
			<string>14.0</string>
			<key>pfm_name</key>
			<string>allowAssistant</string>
			<key>pfm_title</key>
			<string>Allow Siri</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system forces the use of the profanity filter for Siri and dictation. Requires a supervised device in iOS.</string>
			<key>pfm_macos_deprecated</key>
			<string>26.4</string>
			<key>pfm_macos_min</key>
			<string>10.13</string>
			<key>pfm_name</key>
			<string>forceAssistantProfanityFilter</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Enable Siri Profanity Filter</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system delays user visibility of software updates. In macOS, the system allows seed build updates without delay. The delay is 30 days unless you set 'enforcedSoftwareUpdateDelay' to another value.</string>
			<key>pfm_macos_deprecated</key>
			<string>26.0</string>
			<key>pfm_macos_min</key>
			<string>10.13</string>
			<key>pfm_name</key>
			<string>forceDelayedSoftwareUpdates</string>
			<key>pfm_note</key>
			<string>The delay is 30 days unless enforcedSoftwareUpdateDelay is set to another value.</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Defer OS Software Updates</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prohibits installation of Background Security Improvements.</string>
			<key>pfm_macos_deprecated</key>
			<string>26.0</string>
			<key>pfm_macos_min</key>
			<string>13.0</string>
			<key>pfm_name</key>
			<string>allowRapidSecurityResponseInstallation</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Background Security Improvement Installation</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system prohibits removal of Background Security Improvements.</string>
			<key>pfm_macos_deprecated</key>
			<string>26.0</string>
			<key>pfm_macos_min</key>
			<string>13.0</string>
			<key>pfm_name</key>
			<string>allowRapidSecurityResponseRemoval</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Background Security Improvement Removal</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>30</integer>
			<key>pfm_description</key>
			<string>This restriction allows the administrator to set the number of days to delay a minor OS software update on the device. When this restriction is in place, the user sees a software update only after the specified delay after the release of the software update. This value controls the delay for 'forceDelayedSoftwareUpdates'.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>forceDelayedSoftwareUpdates</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_macos_deprecated</key>
			<string>26.0</string>
			<key>pfm_macos_min</key>
			<string>11.3</string>
			<key>pfm_name</key>
			<string>enforcedSoftwareUpdateMinorOSDeferredInstallDelay</string>
			<key>pfm_range_max</key>
			<integer>90</integer>
			<key>pfm_range_min</key>
			<integer>1</integer>
			<key>pfm_title</key>
			<string>Deferred Minor Software Updates Delay</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>days</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system delays user visibility of non-OS software updates. Control visibility of operating system updates through 'forceDelayedSoftwareUpdates'. The delay is 30 days unless you set 'enforcedSoftwareUpdateDelay' to another value.</string>
			<key>pfm_macos_deprecated</key>
			<string>26.0</string>
			<key>pfm_macos_min</key>
			<string>11.0</string>
			<key>pfm_name</key>
			<string>forceDelayedAppSoftwareUpdates</string>
			<key>pfm_note</key>
			<string>The delay is 30 days unless enforcedSoftwareUpdateDelay is set to another value.</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Defer non-OS Software Updates</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>30</integer>
			<key>pfm_description</key>
			<string>How many days to delay a software update on the device. With this restriction in place, the user doesn't see a software update until the specified number of days after the software update release date. The restrictions 'forceDelayedAppSoftwareUpdates' and 'forceDelayedSoftwareUpdates' use this value.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>forceDelayedSoftwareUpdates</string>
						</dict>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>forceDelayedAppSoftwareUpdates</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_macos_deprecated</key>
			<string>26.0</string>
			<key>pfm_macos_min</key>
			<string>10.13.4</string>
			<key>pfm_name</key>
			<string>enforcedSoftwareUpdateDelay</string>
			<key>pfm_range_max</key>
			<integer>90</integer>
			<key>pfm_range_min</key>
			<integer>1</integer>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Deferred Software Updates Delay</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>days</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>30</integer>
			<key>pfm_description</key>
			<string>This restriction allows the administrator to set the number of days to delay an app software update on the device. When this restriction is in place, the user sees a non-OS software update only after the specified delay after the release of the software. This value controls the delay for 'forceDelayedAppSoftwareUpdates'.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>forceDelayedAppSoftwareUpdates</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_macos_deprecated</key>
			<string>26.0</string>
			<key>pfm_macos_min</key>
			<string>11.3</string>
			<key>pfm_name</key>
			<string>enforcedSoftwareUpdateNonOSDeferredInstallDelay</string>
			<key>pfm_range_max</key>
			<integer>90</integer>
			<key>pfm_range_min</key>
			<integer>1</integer>
			<key>pfm_title</key>
			<string>Deferred non-OS Software Updates Delay</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>days</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system delays user visibility of major OS updates.</string>
			<key>pfm_macos_deprecated</key>
			<string>26.0</string>
			<key>pfm_macos_min</key>
			<string>11.3</string>
			<key>pfm_name</key>
			<string>forceDelayedMajorSoftwareUpdates</string>
			<key>pfm_note</key>
			<string>The delay is 30 days unless enforcedSoftwareUpdateMajorOSDeferredInstallDelay is set to another value.</string>
			<key>pfm_title</key>
			<string>Defer Major OS Software Updates</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>30</integer>
			<key>pfm_description</key>
			<string>This restriction allows the administrator to set the number of days to delay a major software upgrade on the device. When this restriction is in place, the user sees a software upgrade only after the specified delay after the release of the software upgrade. This value controls the delay for 'forceDelayedMajorSoftwareUpdates'.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>forceDelayedMajorSoftwareUpdates</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_macos_deprecated</key>
			<string>26.0</string>
			<key>pfm_macos_min</key>
			<string>11.3</string>
			<key>pfm_name</key>
			<string>enforcedSoftwareUpdateMajorOSDeferredInstallDelay</string>
			<key>pfm_range_max</key>
			<integer>90</integer>
			<key>pfm_range_min</key>
			<integer>1</integer>
			<key>pfm_title</key>
			<string>Deferred Major Software Updates Delay</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>days</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>172800</integer>
			<key>pfm_description</key>
			<string>The value, in seconds, after which the fingerprint unlock requires a password to authenticate. The default value is 48 hours.</string>
			<key>pfm_macos_min</key>
			<string>12.0</string>
			<key>pfm_name</key>
			<string>enforcedFingerprintTimeout</string>
			<key>pfm_title</key>
			<string>Enforced Fingerprint Timeout</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disallows dictation input.</string>
			<key>pfm_macos_deprecated</key>
			<string>26.4</string>
			<key>pfm_macos_min</key>
			<string>10.13</string>
			<key>pfm_name</key>
			<string>allowDictation</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow dictation</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', the system disables connections to Siri servers for the purposes of dictation.</string>
			<key>pfm_macos_deprecated</key>
			<string>26.4</string>
			<key>pfm_macos_min</key>
			<string>14.0</string>
			<key>pfm_name</key>
			<string>forceOnDeviceOnlyDictation</string>
			<key>pfm_title</key>
			<string>Force On-Device Only Dictation</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables Safari AutoFill for passwords, contact info, and credit cards, and also prevents using the Keychain for AutoFill. Requires a supervised device in iOS 13 and later.

Note:
The system still allows third-party password managers, and apps can use AutoFill.</string>
			<key>pfm_macos_min</key>
			<string>10.13</string>
			<key>pfm_name</key>
			<string>safariAllowAutoFill</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow AutoFill in Safari</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables Find My Device in the Find My app.</string>
			<key>pfm_macos_min</key>
			<string>10.15</string>
			<key>pfm_name</key>
			<string>allowFindMyDevice</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Find My Devices</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables Find My Friends in the Find My app.</string>
			<key>pfm_macos_min</key>
			<string>10.15</string>
			<key>pfm_name</key>
			<string>allowFindMyFriends</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Find My Friends</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', prohibits creating new Genmoji.</string>
			<key>pfm_macos_deprecated</key>
			<string>26.4</string>
			<key>pfm_macos_min</key>
			<string>15.0</string>
			<key>pfm_name</key>
			<string>allowGenmoji</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Genmoji</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', prohibits the use of image generation.</string>
			<key>pfm_macos_deprecated</key>
			<string>26.4</string>
			<key>pfm_macos_min</key>
			<string>15.0</string>
			<key>pfm_name</key>
			<string>allowImagePlayground</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Image Playground</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', prohibits the use of iPhone Mirroring. In macOS, this prevents the Mac from mirroring any iPhone. In iOS, this prevents the iPhone from mirroring to any Mac.</string>
			<key>pfm_macos_min</key>
			<string>15.0</string>
			<key>pfm_name</key>
			<string>allowiPhoneMirroring</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow iPhone mirroring</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', disables Apple Intelligence writing tools.</string>
			<key>pfm_macos_deprecated</key>
			<string>26.4</string>
			<key>pfm_macos_min</key>
			<string>15.0</string>
			<key>pfm_name</key>
			<string>allowWritingTools</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow writing tools</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', disables the ability to create summaries of email messages manually. This doesn't affect automatic summary generation.</string>
			<key>pfm_macos_deprecated</key>
			<string>26.4</string>
			<key>pfm_macos_min</key>
			<string>15.1</string>
			<key>pfm_name</key>
			<string>allowMailSummary</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Mail Summary</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', disables smart replies in Mail.</string>
			<key>pfm_macos_deprecated</key>
			<string>26.4</string>
			<key>pfm_macos_min</key>
			<string>15.4</string>
			<key>pfm_name</key>
			<string>allowMailSmartReplies</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Mail Smart Replies</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', prevents modification of Media Sharing settings.</string>
			<key>pfm_macos_min</key>
			<string>15.1</string>
			<key>pfm_name</key>
			<string>allowMediaSharingModification</string>
			<key>pfm_title</key>
			<string>Allow modifying Media Sharing setting</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', then the system bypasses the presentation of a screen capture alert.</string>
			<key>pfm_macos_min</key>
			<string>15.1</string>
			<key>pfm_name</key>
			<string>forceBypassScreenCaptureAlert</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', disables the use of external, cloud-based intelligence services with Siri. In iOS, this restriction is temporarily allowed on unsupervised and user enrollments. In a future release, this restriction will require supervision, and will be ignored on unsupervised devices.</string>
			<key>pfm_macos_deprecated</key>
			<string>26.4</string>
			<key>pfm_macos_min</key>
			<string>15.2</string>
			<key>pfm_name</key>
			<string>allowExternalIntelligenceIntegrations</string>
			<key>pfm_title</key>
			<string>Allow external intelligence integrations</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', forces external intelligence providers into anonymous mode. If a user is already signed in to an external intelligence provider, applying this restriction signs them out when attempting the next request.</string>
			<key>pfm_macos_deprecated</key>
			<string>26.4</string>
			<key>pfm_macos_min</key>
			<string>15.2</string>
			<key>pfm_name</key>
			<string>allowExternalIntelligenceIntegrationsSignIn</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow external intelligence integrations sign-in</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>An array of strings, but currently restricted to a single element. If present, Apple Intelligence allows use of only the given external integration workspace ID, and requires a sign-in to make requests. The user is required to sign in to integrations that support signing in. Multiple payloads combine using an intersect operation. This means the allowed set of workspace IDs can become the empty set if multiple payloads specify conflicting values.</string>
			<key>pfm_macos_deprecated</key>
			<string>26.4</string>
			<key>pfm_macos_min</key>
			<string>15.3</string>
			<key>pfm_name</key>
			<string>allowedExternalIntelligenceWorkspaceIDs</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_macos_deprecated</key>
					<string>26.4</string>
					<key>pfm_macos_min</key>
					<string>15.3</string>
					<key>pfm_name</key>
					<string>allowedWorkspaceID</string>
					<key>pfm_repetition_max</key>
					<integer>1</integer>
					<key>pfm_supervised</key>
					<true/>
					<key>pfm_title</key>
					<string>Allowed Workspace ID</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allowed External Intelligence Workspace IDs</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', disables transcription summarization in Notes.</string>
			<key>pfm_macos_deprecated</key>
			<string>26.4</string>
			<key>pfm_macos_min</key>
			<string>15.3</string>
			<key>pfm_name</key>
			<string>allowNotesTranscriptionSummary</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Notes Transcript Summary</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', disables transcription in Notes.</string>
			<key>pfm_macos_deprecated</key>
			<string>26.4</string>
			<key>pfm_macos_min</key>
			<string>15.4</string>
			<key>pfm_name</key>
			<string>allowNotesTranscription</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables Apple Intelligence reports.</string>
			<key>pfm_macos_deprecated</key>
			<string>26.4</string>
			<key>pfm_macos_min</key>
			<string>15.4</string>
			<key>pfm_name</key>
			<string>allowAppleIntelligenceReport</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Apple Intelligence Report</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables the ability to summarize content in Safari.</string>
			<key>pfm_macos_deprecated</key>
			<string>26.4</string>
			<key>pfm_macos_min</key>
			<string>15.4</string>
			<key>pfm_name</key>
			<string>allowSafariSummary</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Content Summary in Safari</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables the ability to clear browsing history in Safari.</string>
			<key>pfm_macos_min</key>
			<string>26.0</string>
			<key>pfm_name</key>
			<string>allowSafariHistoryClearing</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_targets</key>
			<array>
				<string>system</string>
				<string>user</string>
			</array>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables the ability to use private browsing in Safari.</string>
			<key>pfm_macos_min</key>
			<string>26.0</string>
			<key>pfm_name</key>
			<string>allowSafariPrivateBrowsing</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_targets</key>
			<array>
				<string>system</string>
				<string>user</string>
			</array>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', disables call recording.</string>
			<key>pfm_macos_min</key>
			<string>26.0</string>
			<key>pfm_name</key>
			<string>allowCallRecording</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Call Recording</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the system disables live voicemail on the device.</string>
			<key>pfm_macos_min</key>
			<string>26.0</string>
			<key>pfm_name</key>
			<string>allowLiveVoicemail</string>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow Live Voicemail</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', disables Rosetta usage awareness. When Rosetta usage awareness is active, a pop-up dialog is displayed to the user when an app that is using Rosetta is launched. The pop-up dialog indicates that Rosetta will be removed in a future version of the operating system so that the user can contact the app vendor regarding a replacement for the current app.</string>
			<key>pfm_macos_min</key>
			<string>26.4</string>
			<key>pfm_name</key>
			<string>allowRosettaUsageAwareness</string>
			<key>pfm_title</key>
			<string>Allow Rosetta Usage Awareness</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>Restrictions (macOS)</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_user_approved</key>
	<false/>
	<key>pfm_version</key>
	<integer>21</integer>
</dict>
</plist>
