<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>The payload that configures the preference panes.</string>
	<key>pfm_description_reference</key>
	<string></string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/systempreferences</string>
	<key>pfm_domain</key>
	<string>com.apple.systempreferences</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_last_modified</key>
	<date>2025-09-17T09:38:09Z</date>
	<key>pfm_macos_deprecated</key>
	<string>13.0</string>
	<key>pfm_macos_min</key>
	<string>10.7</string>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>The payload that configures the preference panes.</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>System Preferences</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.systempreferences</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the 'TopLevel' value, with an additional appended component. This string must be unique within the profile.

During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.systempreferences</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs.

During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Enabled</string>
				<string>Disabled</string>
				<string>Hidden</string>
				<string>Other</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Disabled</key>
				<array>
					<string>DisabledSystemSettings</string>
					<string>DisabledPreferencePanes</string>
				</array>
				<key>Enabled</key>
				<array>
					<string>EnabledPreferencePanes</string>
				</array>
				<key>Hidden</key>
				<array>
					<string>HiddenPreferencePanes</string>
				</array>
				<key>Other</key>
				<array>
					<string>AttentionPrefBundleIDs</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The list of disabled System Settings extensions. All other items will be enabled. When 'DisabledSystemSettings' is specified, the device ignores 'DisabledPreferencePanes' and 'EnabledPreferencePanes'.

Note:
A given System Settings extension can supply more than one section in System Settings; disabling such an extension disables all sections it supplies.</string>
			<key>pfm_macos_min</key>
			<string>13.0</string>
			<key>pfm_name</key>
			<string>DisabledSystemSettings</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>SettingsExtensions</string>
					<key>pfm_range_list</key>
					<array>
						<string>com.apple.Accessibility-Settings.extension</string>
						<string>com.apple.AirDrop-Handoff-Settings.extension</string>
						<string>com.apple.Battery-Settings.extension</string>
						<string>com.apple.BluetoothSettings</string>
						<string>com.apple.CD-DVD-Settings.extension</string>
						<string>com.apple.ClassKit-Settings.extension</string>
						<string>com.apple.Classroom-Settings.extension</string>
						<string>com.apple.ControlCenter-Settings.extension</string>
						<string>com.apple.Date-Time-Settings.extension</string>
						<string>com.apple.Desktop-Settings.extension</string>
						<string>com.apple.Displays-Settings.extension</string>
						<string>com.apple.ExtensionsPreferences</string>
						<string>com.apple.Family-Settings.extension</string>
						<string>com.apple.Focus-Settings.extension</string>
						<string>com.apple.Game-Center-Settings.extension</string>
						<string>com.apple.Game-Controller-Settings.extension</string>
						<string>com.apple.HeadphoneSettings</string>
						<string>com.apple.Internet-Accounts-Settings.extension</string>
						<string>com.apple.Keyboard-Settings.extension</string>
						<string>com.apple.Localization-Settings.extension</string>
						<string>com.apple.Lock-Screen-Settings.extension</string>
						<string>com.apple.LoginItems-Settings.extension</string>
						<string>com.apple.Mouse-Settings.extension</string>
						<string>com.apple.Network-Settings.extension</string>
						<string>com.apple.NetworkExtensionSettingsUI.NESettingsUIExtension</string>
						<string>com.apple.Notifications-Settings.extension</string>
						<string>com.apple.Passwords-Settings.extension</string>
						<string>com.apple.Print-Scan-Settings.extension</string>
						<string>com.apple.Screen-Time-Settings.extension</string>
						<string>com.apple.ScreenSaver-Settings.extension</string>
						<string>com.apple.Sharing-Settings.extension</string>
						<string>com.apple.Siri-Settings.extension</string>
						<string>com.apple.Software-Update-Settings.extension</string>
						<string>com.apple.Sound-Settings.extension</string>
						<string>com.apple.Startup-Disk-Settings.extension</string>
						<string>com.apple.Time-Machine-Settings.extension</string>
						<string>com.apple.Touch-ID-Settings.extension</string>
						<string>com.apple.Trackpad-Settings.extension</string>
						<string>com.apple.Transfer-Reset-Settings.extension</string>
						<string>com.apple.Users-Groups-Settings.extension</string>
						<string>com.apple.WalletSettingsExtension</string>
						<string>com.apple.Wallpaper-Settings.extension</string>
						<string>com.apple.settings.Storage</string>
						<string>com.apple.systempreferences.AppleIDSettings</string>
						<string>com.apple.wifi-settings-extension</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Accessibility</string>
						<string>AirDrop Handoff</string>
						<string>Battery</string>
						<string>Bluetooth Settings</string>
						<string>CD &amp; DVD</string>
						<string>ClassKit</string>
						<string>Classroom</string>
						<string>ControlCenter</string>
						<string>Date Time</string>
						<string>Desktop</string>
						<string>Displays</string>
						<string>Extensions Preferences</string>
						<string>Family</string>
						<string>Focus</string>
						<string>Game Center</string>
						<string>Game Controller</string>
						<string>HeadphoneSettings</string>
						<string>Internet Accounts</string>
						<string>Keyboard</string>
						<string>Localization</string>
						<string>Lock Screen</string>
						<string>LoginItems</string>
						<string>Mouse</string>
						<string>Network</string>
						<string>Network Extension Settings UI</string>
						<string>Notifications</string>
						<string>Passwords</string>
						<string>Print &amp; Scan</string>
						<string>Screen Time</string>
						<string>ScreenSaver</string>
						<string>Sharing</string>
						<string>Siri</string>
						<string>Software Update</string>
						<string>Sound</string>
						<string>Startup Disk</string>
						<string>Time Machine</string>
						<string>Touch ID</string>
						<string>Trackpad</string>
						<string>Transfer &amp; Reset</string>
						<string>Users Groups</string>
						<string>Wallet Settings</string>
						<string>Wallpaper</string>
						<string>Storage</string>
						<string>Apple Account</string>
						<string>Wi-Fi</string>
					</array>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The list of enabled System Preferences panes.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_target</key>
							<string>DisabledSystemSettings</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>EnabledPreferencePanes</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>PreferencePanes</string>
					<key>pfm_range_list</key>
					<array>
						<string>com.apple.preference.universalaccess</string>
						<string>com.apple.preferences.appstore</string>
						<string>com.apple.preferences.AppleIDPrefPane</string>
						<string>com.apple.preference.battery</string>
						<string>com.apple.preferences.Bluetooth</string>
						<string>com.apple.preference.digihub.discs</string>
						<string>com.apple.ClassroomSettings</string>
						<string>com.apple.preference.datetime</string>
						<string>com.apple.preference.desktopscreeneffect</string>
						<string>com.apple.preference.displays</string>
						<string>com.apple.preference.dock</string>
						<string>com.apple.preference.energysaver</string>
						<string>com.apple.preferences.extensions</string>
						<string>com.apple.preferences.FamilySharingPrefPane</string>
						<string>com.apple.prefpanel.fibrechannel</string>
						<string>com.apple.preference.general</string>
						<string>com.apple.preferences.icloud</string>
						<string>com.apple.preference.ink</string>
						<string>com.apple.preferences.internetaccounts</string>
						<string>com.apple.preference.keyboard</string>
						<string>com.apple.Localization</string>
						<string>com.apple.preference.expose</string>
						<string>com.apple.preference.internet</string>
						<string>com.apple.preference.mouse</string>
						<string>com.apple.preference.network</string>
						<string>com.apple.preference.notifications</string>
						<string>com.apple.preferences.parentalcontrols</string>
						<string>com.apple.preference.printfax</string>
						<string>com.apple.preferences.configurationprofiles</string>
						<string>com.apple.preference.screentime</string>
						<string>com.apple.preference.security</string>
						<string>com.apple.preferences.sharing</string>
						<string>com.apple.preference.sidecar</string>
						<string>com.apple.preference.speech</string>
						<string>com.apple.preferences.softwareupdate</string>
						<string>com.apple.preference.sound</string>
						<string>com.apple.preference.spotlight</string>
						<string>com.apple.preference.startupdisk</string>
						<string>com.apple.prefs.backup</string>
						<string>com.apple.preferences.password</string>
						<string>com.apple.preference.trackpad</string>
						<string>com.apple.preferences.users</string>
						<string>com.apple.preferences.wallet</string>
						<string>com.apple.Xsan</string>
						<string>com.adobe.flashplayerpreferences</string>
						<string>com.euphonix.prefpanel</string>
						<string>com.blackmagic-design.Blackmagic-Desktop-Video</string>
						<string>com.websense.endpoint.preference</string>
						<string>com.kensington.trackballworks2.prefPane</string>
						<string>com.mysql.prefpane</string>
						<string>com.oracle.java.JavaControlPanel</string>
						<string>com.smarttech.SMARTBoardPref</string>
						<string>cl.fail.lordkamina.SwiftDefaultApps</string>
						<string>com.tenablesecurity.NessusAgent.Preferences</string>
						<string>com.tuxera.ntfs.mac.prefpane</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Accessibility</string>
						<string>App Store</string>
						<string>Apple ID</string>
						<string>Battery</string>
						<string>Bluetooth</string>
						<string>CDs &amp; DVDs</string>
						<string>Classroom</string>
						<string>Date &amp; Time</string>
						<string>Desktop &amp; Screen Saver</string>
						<string>Displays</string>
						<string>Dock</string>
						<string>Energy Saver</string>
						<string>Extensions</string>
						<string>Family Sharing</string>
						<string>Fibre Channel</string>
						<string>General</string>
						<string>iCloud</string>
						<string>Ink</string>
						<string>Internet Accounts</string>
						<string>Keyboard</string>
						<string>Language &amp; Region</string>
						<string>Mission Control</string>
						<string>MobileMe</string>
						<string>Mouse</string>
						<string>Network</string>
						<string>Notifications</string>
						<string>Parental Controls</string>
						<string>Printers &amp; Scanners</string>
						<string>Profiles</string>
						<string>Screentime</string>
						<string>Security &amp; Privacy</string>
						<string>Sharing</string>
						<string>Sidecar</string>
						<string>Siri</string>
						<string>Software Update</string>
						<string>Sound</string>
						<string>Spotlight</string>
						<string>Startup Disk</string>
						<string>Time Machine</string>
						<string>Touch ID</string>
						<string>Trackpad</string>
						<string>Users &amp; Groups</string>
						<string>Wallet &amp; Apple Pay</string>
						<string>Xsan</string>
						<string>Adobe Flash</string>
						<string>Avid Euphonix</string>
						<string>Blackmagic Video</string>
						<string>Forcepoint</string>
						<string>KensingtonWorks</string>
						<string>MySQL</string>
						<string>Oracle Java</string>
						<string>SMART Board</string>
						<string>Swift Default Apps</string>
						<string>Tenable Nessus Agent</string>
						<string>Tuxera NTFS</string>
					</array>
					<key>pfm_title</key>
					<string></string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Enabled Preference Panes</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_type_input</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The list of disabled System Preferences panes.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_target</key>
							<string>DisabledSystemSettings</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>DisabledPreferencePanes</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>PreferencePanes</string>
					<key>pfm_range_list</key>
					<array>
						<string>com.apple.preference.universalaccess</string>
						<string>com.apple.preferences.appstore</string>
						<string>com.apple.preferences.AppleIDPrefPane</string>
						<string>com.apple.preference.battery</string>
						<string>com.apple.preferences.Bluetooth</string>
						<string>com.apple.preference.digihub.discs</string>
						<string>com.apple.ClassroomSettings</string>
						<string>com.apple.preference.datetime</string>
						<string>com.apple.preference.desktopscreeneffect</string>
						<string>com.apple.preference.displays</string>
						<string>com.apple.preference.dock</string>
						<string>com.apple.preference.energysaver</string>
						<string>com.apple.preferences.extensions</string>
						<string>com.apple.preferences.FamilySharingPrefPane</string>
						<string>com.apple.prefpanel.fibrechannel</string>
						<string>com.apple.preference.general</string>
						<string>com.apple.preferences.icloud</string>
						<string>com.apple.preference.ink</string>
						<string>com.apple.preferences.internetaccounts</string>
						<string>com.apple.preference.keyboard</string>
						<string>com.apple.Localization</string>
						<string>com.apple.preference.expose</string>
						<string>com.apple.preference.internet</string>
						<string>com.apple.preference.mouse</string>
						<string>com.apple.preference.network</string>
						<string>com.apple.preference.notifications</string>
						<string>com.apple.preferences.parentalcontrols</string>
						<string>com.apple.preference.printfax</string>
						<string>com.apple.preferences.configurationprofiles</string>
						<string>com.apple.preference.screentime</string>
						<string>com.apple.preference.security</string>
						<string>com.apple.preferences.sharing</string>
						<string>com.apple.preference.sidecar</string>
						<string>com.apple.preference.speech</string>
						<string>com.apple.preferences.softwareupdate</string>
						<string>com.apple.preference.sound</string>
						<string>com.apple.preference.spotlight</string>
						<string>com.apple.preference.startupdisk</string>
						<string>com.apple.prefs.backup</string>
						<string>com.apple.preferences.password</string>
						<string>com.apple.preference.trackpad</string>
						<string>com.apple.preferences.users</string>
						<string>com.apple.preferences.wallet</string>
						<string>com.apple.Xsan</string>
						<string>com.adobe.flashplayerpreferences</string>
						<string>com.euphonix.prefpanel</string>
						<string>com.blackmagic-design.Blackmagic-Desktop-Video</string>
						<string>com.websense.endpoint.preference</string>
						<string>com.kensington.trackballworks2.prefPane</string>
						<string>com.mysql.prefpane</string>
						<string>com.oracle.java.JavaControlPanel</string>
						<string>com.smarttech.SMARTBoardPref</string>
						<string>cl.fail.lordkamina.SwiftDefaultApps</string>
						<string>com.tenablesecurity.NessusAgent.Preferences</string>
						<string>com.tuxera.ntfs.mac.prefpane</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Accessibility</string>
						<string>App Store</string>
						<string>Apple ID</string>
						<string>Battery</string>
						<string>Bluetooth</string>
						<string>CDs &amp; DVDs</string>
						<string>Classroom</string>
						<string>Date &amp; Time</string>
						<string>Desktop &amp; Screen Saver</string>
						<string>Displays</string>
						<string>Dock</string>
						<string>Energy Saver</string>
						<string>Extensions</string>
						<string>Family Sharing</string>
						<string>Fibre Channel</string>
						<string>General</string>
						<string>iCloud</string>
						<string>Ink</string>
						<string>Internet Accounts</string>
						<string>Keyboard</string>
						<string>Language &amp; Region</string>
						<string>Mission Control</string>
						<string>MobileMe</string>
						<string>Mouse</string>
						<string>Network</string>
						<string>Notifications</string>
						<string>Parental Controls</string>
						<string>Printers &amp; Scanners</string>
						<string>Profiles</string>
						<string>Screentime</string>
						<string>Security &amp; Privacy</string>
						<string>Sharing</string>
						<string>Sidecar</string>
						<string>Siri</string>
						<string>Software Update</string>
						<string>Sound</string>
						<string>Spotlight</string>
						<string>Startup Disk</string>
						<string>Time Machine</string>
						<string>Touch ID</string>
						<string>Trackpad</string>
						<string>Users &amp; Groups</string>
						<string>Wallet &amp; Apple Pay</string>
						<string>Xsan</string>
						<string>Adobe Flash</string>
						<string>Avid Euphonix</string>
						<string>Blackmagic Video</string>
						<string>Forcepoint</string>
						<string>KensingtonWorks</string>
						<string>MySQL</string>
						<string>Oracle Java</string>
						<string>SMART Board</string>
						<string>Swift Default Apps</string>
						<string>Tenable Nessus Agent</string>
						<string>Tuxera NTFS</string>
					</array>
					<key>pfm_title</key>
					<string></string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Disabled Preference Panes</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_type_input</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Hidden Preference Panes within the System Preferences application.</string>
			<key>pfm_description_reference</key>
			<string></string>
			<key>pfm_name</key>
			<string>HiddenPreferencePanes</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>PreferencePanes</string>
					<key>pfm_range_list</key>
					<array>
						<string>com.apple.preference.universalaccess</string>
						<string>com.apple.preferences.appstore</string>
						<string>com.apple.preferences.AppleIDPrefPane</string>
						<string>com.apple.preference.battery</string>
						<string>com.apple.preferences.Bluetooth</string>
						<string>com.apple.preference.digihub.discs</string>
						<string>com.apple.ClassroomSettings</string>
						<string>com.apple.preference.datetime</string>
						<string>com.apple.preference.desktopscreeneffect</string>
						<string>com.apple.preference.displays</string>
						<string>com.apple.preference.dock</string>
						<string>com.apple.preference.energysaver</string>
						<string>com.apple.preferences.extensions</string>
						<string>com.apple.preferences.FamilySharingPrefPane</string>
						<string>com.apple.prefpanel.fibrechannel</string>
						<string>com.apple.preference.general</string>
						<string>com.apple.preferences.icloud</string>
						<string>com.apple.preference.ink</string>
						<string>com.apple.preferences.internetaccounts</string>
						<string>com.apple.preference.keyboard</string>
						<string>com.apple.Localization</string>
						<string>com.apple.preference.expose</string>
						<string>com.apple.preference.internet</string>
						<string>com.apple.preference.mouse</string>
						<string>com.apple.preference.network</string>
						<string>com.apple.preference.notifications</string>
						<string>com.apple.preferences.parentalcontrols</string>
						<string>com.apple.preference.printfax</string>
						<string>com.apple.preferences.configurationprofiles</string>
						<string>com.apple.preference.screentime</string>
						<string>com.apple.preference.security</string>
						<string>com.apple.preferences.sharing</string>
						<string>com.apple.preference.sidecar</string>
						<string>com.apple.preference.speech</string>
						<string>com.apple.preferences.softwareupdate</string>
						<string>com.apple.preference.sound</string>
						<string>com.apple.preference.spotlight</string>
						<string>com.apple.preference.startupdisk</string>
						<string>com.apple.prefs.backup</string>
						<string>com.apple.preferences.password</string>
						<string>com.apple.preference.trackpad</string>
						<string>com.apple.preferences.users</string>
						<string>com.apple.preferences.wallet</string>
						<string>com.apple.Xsan</string>
						<string>com.adobe.flashplayerpreferences</string>
						<string>com.euphonix.prefpanel</string>
						<string>com.blackmagic-design.Blackmagic-Desktop-Video</string>
						<string>com.websense.endpoint.preference</string>
						<string>com.kensington.trackballworks2.prefPane</string>
						<string>com.mysql.prefpane</string>
						<string>com.oracle.java.JavaControlPanel</string>
						<string>com.smarttech.SMARTBoardPref</string>
						<string>cl.fail.lordkamina.SwiftDefaultApps</string>
						<string>com.tenablesecurity.NessusAgent.Preferences</string>
						<string>com.tuxera.ntfs.mac.prefpane</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Accessibility</string>
						<string>App Store</string>
						<string>Apple ID</string>
						<string>Battery</string>
						<string>Bluetooth</string>
						<string>CDs &amp; DVDs</string>
						<string>Classroom</string>
						<string>Date &amp; Time</string>
						<string>Desktop &amp; Screen Saver</string>
						<string>Displays</string>
						<string>Dock</string>
						<string>Energy Saver</string>
						<string>Extensions</string>
						<string>Family Sharing</string>
						<string>Fibre Channel</string>
						<string>General</string>
						<string>iCloud</string>
						<string>Ink</string>
						<string>Internet Accounts</string>
						<string>Keyboard</string>
						<string>Language &amp; Region</string>
						<string>Mission Control</string>
						<string>MobileMe</string>
						<string>Mouse</string>
						<string>Network</string>
						<string>Notifications</string>
						<string>Parental Controls</string>
						<string>Printers &amp; Scanners</string>
						<string>Profiles</string>
						<string>Screentime</string>
						<string>Security &amp; Privacy</string>
						<string>Sharing</string>
						<string>Sidecar</string>
						<string>Siri</string>
						<string>Software Update</string>
						<string>Sound</string>
						<string>Spotlight</string>
						<string>Startup Disk</string>
						<string>Time Machine</string>
						<string>Touch ID</string>
						<string>Trackpad</string>
						<string>Users &amp; Groups</string>
						<string>Wallet &amp; Apple Pay</string>
						<string>Xsan</string>
						<string>Adobe Flash</string>
						<string>Avid Euphonix</string>
						<string>Blackmagic Video</string>
						<string>Forcepoint</string>
						<string>KensingtonWorks</string>
						<string>MySQL</string>
						<string>Oracle Java</string>
						<string>SMART Board</string>
						<string>Swift Default Apps</string>
						<string>Tenable Nessus Agent</string>
						<string>Tuxera NTFS</string>
					</array>
					<key>pfm_title</key>
					<string></string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Hidden Preference Panes</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_type_input</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Not documented by Apple, but by entering 0 for individual System Preference pane bundle IDs, or by adding this preference and leaving the dictionary blank, it is possible to suppress the alert icon from appearing on the System Preferences app (ex. when software updates are available).</string>
			<key>pfm_name</key>
			<string>AttentionPrefBundleIDs</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>{{key}}</string>
					<key>pfm_range_list</key>
					<array>
						<string>com.apple.preferences.softwareupdate</string>
					</array>
					<key>pfm_range_list_allow_custom_value</key>
					<true/>
					<key>pfm_title</key>
					<string>BundleIDs</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_unique</key>
					<true/>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>{{value}}</string>
					<key>pfm_title</key>
					<string>Alert #</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Attention Preference Pane Bundle IDs</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>System Preferences</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>9</integer>
</dict>
</plist>
