<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>The payload that configures AirPlay settings.</string>
	<key>pfm_description_reference</key>
	<string>The AirPlay payload is designated by specifying com.apple.airplay as the PayloadType value. This payload is supported on iOS 7.0 and later and on macOS 10.10 and later.</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/airplay</string>
	<key>pfm_domain</key>
	<string>com.apple.airplay</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_ios_min</key>
	<string>7.0</string>
	<key>pfm_last_modified</key>
	<date>2025-09-17T09:38:09Z</date>
	<key>pfm_macos_min</key>
	<string>10.10</string>
	<key>pfm_platforms</key>
	<array>
		<string>iOS</string>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>The payload that configures AirPlay settings.</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>AirPlay</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.airplay</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the 'TopLevel' value, with an additional appended component. This string must be unique within the profile.

During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.airplay</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs.

During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_allowed_file_types</key>
			<array>
				<string>public.plain-text</string>
			</array>
			<key>pfm_description</key>
			<string>If present, only AirPlay destinations in this list are available to the device. This allow list applies to supervised devices.</string>
			<key>pfm_ios_min</key>
			<string>14.5</string>
			<key>pfm_macos_min</key>
			<string>11.3</string>
			<key>pfm_name</key>
			<string>AllowList</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_ios_min</key>
					<string>7.0</string>
					<key>pfm_macos_min</key>
					<string>10.10</string>
					<key>pfm_name</key>
					<string>AllowListItem</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>The device ID of the AirPlay destination in the format 'xx:xx:xx:xx:xx:xx'. This field isn't case-sensitive.

The system limits the list of visible AirPlay destinations to devices that are present in the 'AllowList' field of all installed AirPlay payloads.

Specifying the same MACAddress more than once, whether in the same payload across different payloads, results in undefined behavior.

As of tvOS 18, 'DeviceID' isn't supported.</string>
							<key>pfm_format</key>
							<string>^([0-9A-Fa-f]{2}:){5}([0-9A-Fa-f]{2})$</string>
							<key>pfm_ios_deprecated</key>
							<string>18.0</string>
							<key>pfm_macos_deprecated</key>
							<string>15.0</string>
							<key>pfm_name</key>
							<string>DeviceID</string>
							<key>pfm_title</key>
							<string>Device ID</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>xx:xx:xx:xx:xx:xx</string>
							<key>pfmx_supported_oses</key>
							<dict>
								<key>iOS</key>
								<dict>
									<key>pfmx_deprecated</key>
									<string>18.0</string>
								</dict>
								<key>macOS</key>
								<dict>
									<key>pfmx_deprecated</key>
									<string>15.0</string>
								</dict>
							</dict>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The name of the AirPlay device.

The system limits the list of visible AirPlay destinations to devices that are present in the 'AllowList' field of all installed AirPlay payloads.</string>
							<key>pfm_ios_min</key>
							<string>18.0</string>
							<key>pfm_macos_min</key>
							<string>15.0</string>
							<key>pfm_name</key>
							<string>DeviceName</string>
							<key>pfm_title</key>
							<string>Device Name</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfmx_supported_oses</key>
							<dict>
								<key>iOS</key>
								<dict>
									<key>pfmx_introduced</key>
									<string>18.0</string>
								</dict>
								<key>macOS</key>
								<dict>
									<key>pfmx_introduced</key>
									<string>15.0</string>
								</dict>
							</dict>
						</dict>
					</array>
					<key>pfm_supervised</key>
					<true/>
					<key>pfm_title</key>
					<string>AllowList Content Item</string>
					<key>pfm_type</key>
					<string>dictionary</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>7.0</string>
							<key>pfmx_supervised</key>
							<true/>
							<key>pfmx_user_enrollment</key>
							<dict>
								<key>pfmx_mode</key>
								<string>forbidden</string>
							</dict>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.10</string>
							<key>pfmx_user_enrollment</key>
							<dict>
								<key>pfmx_mode</key>
								<string>ignored</string>
							</dict>
						</dict>
					</dict>
				</dict>
			</array>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>AllowList</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_value_import_processor</key>
			<string>lineValueForFormat</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>14.5</string>
					<key>pfmx_supervised</key>
					<true/>
					<key>pfmx_user_enrollment</key>
					<dict>
						<key>pfmx_mode</key>
						<string>forbidden</string>
					</dict>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_introduced</key>
					<string>11.3</string>
					<key>pfmx_user_enrollment</key>
					<dict>
						<key>pfmx_mode</key>
						<string>ignored</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_allowed_file_types</key>
			<array>
				<string>public.plain-text</string>
			</array>
			<key>pfm_description</key>
			<string>Use 'AllowList' instead. This key is deprecated in iOS 14.5 and macOS 11.3.</string>
			<key>pfm_ios_deprecated</key>
			<string>14.5</string>
			<key>pfm_macos_deprecated</key>
			<string>11.3</string>
			<key>pfm_name</key>
			<string>Whitelist</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_ios_min</key>
					<string>7.0</string>
					<key>pfm_macos_min</key>
					<string>10.10</string>
					<key>pfm_name</key>
					<string>AllowListItem</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>The device ID of the AirPlay destination in the format 'xx:xx:xx:xx:xx:xx'. This field isn't case-sensitive.

The system limits the list of visible AirPlay destinations to devices that are present in the 'AllowList' field of all installed AirPlay payloads.

Specifying the same MACAddress more than once, whether in the same payload across different payloads, results in undefined behavior.

As of tvOS 18, 'DeviceID' isn't supported.</string>
							<key>pfm_format</key>
							<string>^([0-9A-Fa-f]{2}:){5}([0-9A-Fa-f]{2})$</string>
							<key>pfm_ios_deprecated</key>
							<string>18.0</string>
							<key>pfm_macos_deprecated</key>
							<string>15.0</string>
							<key>pfm_name</key>
							<string>DeviceID</string>
							<key>pfm_title</key>
							<string>Device ID</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>xx:xx:xx:xx:xx:xx</string>
							<key>pfmx_supported_oses</key>
							<dict>
								<key>iOS</key>
								<dict>
									<key>pfmx_deprecated</key>
									<string>18.0</string>
								</dict>
								<key>macOS</key>
								<dict>
									<key>pfmx_deprecated</key>
									<string>15.0</string>
								</dict>
							</dict>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The name of the AirPlay device.

The system limits the list of visible AirPlay destinations to devices that are present in the 'AllowList' field of all installed AirPlay payloads.</string>
							<key>pfm_ios_min</key>
							<string>18.0</string>
							<key>pfm_macos_min</key>
							<string>15.0</string>
							<key>pfm_name</key>
							<string>DeviceName</string>
							<key>pfm_title</key>
							<string>Device Name</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfmx_supported_oses</key>
							<dict>
								<key>iOS</key>
								<dict>
									<key>pfmx_introduced</key>
									<string>18.0</string>
								</dict>
								<key>macOS</key>
								<dict>
									<key>pfmx_introduced</key>
									<string>15.0</string>
								</dict>
							</dict>
						</dict>
					</array>
					<key>pfm_supervised</key>
					<true/>
					<key>pfm_title</key>
					<string>AllowList Content Item</string>
					<key>pfm_type</key>
					<string>dictionary</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>iOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>7.0</string>
							<key>pfmx_supervised</key>
							<true/>
							<key>pfmx_user_enrollment</key>
							<dict>
								<key>pfmx_mode</key>
								<string>forbidden</string>
							</dict>
						</dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.10</string>
							<key>pfmx_user_enrollment</key>
							<dict>
								<key>pfmx_mode</key>
								<string>ignored</string>
							</dict>
						</dict>
					</dict>
				</dict>
			</array>
			<key>pfm_supervised</key>
			<true/>
			<key>pfm_title</key>
			<string>Allow List (legacy)</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_value_import_processor</key>
			<string>lineValueForFormat</string>
			<key>pfmx_supported_oses</key>
			<dict>
				<key>iOS</key>
				<dict>
					<key>pfmx_deprecated</key>
					<string>14.5</string>
					<key>pfmx_supervised</key>
					<true/>
					<key>pfmx_user_enrollment</key>
					<dict>
						<key>pfmx_mode</key>
						<string>forbidden</string>
					</dict>
				</dict>
				<key>macOS</key>
				<dict>
					<key>pfmx_deprecated</key>
					<string>11.3</string>
					<key>pfmx_user_enrollment</key>
					<dict>
						<key>pfmx_mode</key>
						<string>ignored</string>
					</dict>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If present, sets passwords for known AirPlay destinations. Using multiple entries for the same destination, whether within the same payload or across multiple installed payloads, is an error and results in undefined behavior.</string>
			<key>pfm_name</key>
			<string>Passwords</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>An item in the passwords</string>
					<key>pfm_name</key>
					<string>PasswordsItem</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>The name of the AirPlay destination; used in iOS, and available in macOS 15 and later.</string>
							<key>pfm_macos_min</key>
							<string>15.0</string>
							<key>pfm_name</key>
							<string>DeviceName</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Device Name</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfmx_supported_oses</key>
							<dict>
								<key>macOS</key>
								<dict>
									<key>pfmx_introduced</key>
									<string>15.0</string>
								</dict>
							</dict>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The device ID of the AirPlay destination; used in macOS.

Deprecated in macOS 15 and later as tvOS 18 AirPlay destinations don't support it; use 'DeviceName' instead.</string>
							<key>pfm_format</key>
							<string>^([0-9A-Fa-f]{2}:){5}([0-9A-Fa-f]{2})$</string>
							<key>pfm_macos_deprecated</key>
							<string>15.0</string>
							<key>pfm_name</key>
							<string>DeviceID</string>
							<key>pfm_platforms</key>
							<array>
								<string>macOS</string>
							</array>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Device ID</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>xx:xx:xx:xx:xx:xx</string>
							<key>pfmx_supported_oses</key>
							<dict>
								<key>iOS</key>
								<dict>
									<key>pfmx_introduced</key>
									<string>n/a</string>
								</dict>
								<key>macOS</key>
								<dict>
									<key>pfmx_deprecated</key>
									<string>15.0</string>
								</dict>
							</dict>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The password for the AirPlay destination.</string>
							<key>pfm_name</key>
							<string>Password</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Password</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Password Content Item</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Passwords</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>AirPlay</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>5</integer>
	<key>pfmx_supported_oses</key>
	<dict>
		<key>iOS</key>
		<dict>
			<key>pfmx_allow_manual_install</key>
			<true/>
			<key>pfmx_introduced</key>
			<string>7.0</string>
			<key>pfmx_multiple</key>
			<true/>
			<key>pfmx_shared_ipad</key>
			<dict>
				<key>pfmx_device_channel</key>
				<true/>
				<key>pfmx_mode</key>
				<string>allowed</string>
				<key>pfmx_user_channel</key>
				<false/>
			</dict>
			<key>pfmx_supervised</key>
			<false/>
			<key>pfmx_user_enrollment</key>
			<dict>
				<key>pfmx_mode</key>
				<string>allowed</string>
			</dict>
		</dict>
		<key>macOS</key>
		<dict>
			<key>pfmx_allow_manual_install</key>
			<true/>
			<key>pfmx_device_channel</key>
			<true/>
			<key>pfmx_introduced</key>
			<string>10.10</string>
			<key>pfmx_multiple</key>
			<true/>
			<key>pfmx_requires_dep</key>
			<false/>
			<key>pfmx_supervised</key>
			<false/>
			<key>pfmx_user_approved_mdm</key>
			<false/>
			<key>pfmx_user_channel</key>
			<true/>
			<key>pfmx_user_enrollment</key>
			<dict>
				<key>pfmx_mode</key>
				<string>allowed</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
