<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>The payload that configures file provider settings.</string>
	<key>pfm_description_reference</key>
	<string>The File Provider payload is designated by specifying com.apple.fileproviderd as the PayloadType.</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/fileprovider</string>
	<key>pfm_domain</key>
	<string>com.apple.fileproviderd</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>exclusive</string>
	<key>pfm_last_modified</key>
	<date>2026-02-19T09:22:13Z</date>
	<key>pfm_macos_min</key>
	<string>11.0</string>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>The payload that configures file provider settings.</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>File Provider</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.fileproviderd</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the 'TopLevel' value, with an additional appended component. This string must be unique within the profile.

During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.fileproviderd</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs.

During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>If 'true', enables file providers access to the path of the requesting process.</string>
			<key>pfm_name</key>
			<string>AllowManagedFileProvidersToRequestAttribution</string>
			<key>pfm_title</key>
			<string>Allow Managed File Providers to Request Attribution</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the device prevents the File Provider extension from using desktop and documents synchronization in any app. This does not impact the ability for apps to utilize the File Provider extension for file and folder syncing with remote storage.</string>
			<key>pfm_macos_min</key>
			<string>15.2</string>
			<key>pfm_name</key>
			<string>ManagementAllowsKnownFolderSyncing</string>
			<key>pfm_targets</key>
			<array>
				<string>system</string>
			</array>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>An array of strings representing the composed identifiers of apps. The device allows the corresponding apps to use File Provider extension desktop and documents synchronization. If present, and 'ManagementAllowsKnownFolderSyncing' is set to 'true', the device allows only the apps in this list to use desktop and documents synchronization. This key is ignored if 'ManagementAllowsKnownFolderSyncing' is set to 'false'. This setting does not impact the ability for apps to use File Provider extension volume access. The format of the app identifiers is "Bundle-ID (Team-ID)", for example 'com.example.app (ABCD1234)'.</string>
			<key>pfm_macos_min</key>
			<string>15.2</string>
			<key>pfm_name</key>
			<string>ManagementKnownFolderSyncingAllowList</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>A composed app identifier. The format is "Bundle.Identifier (TeamIdentifier)".</string>
					<key>pfm_macos_min</key>
					<string>15.2</string>
					<key>pfm_name</key>
					<string>AllowListItem</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_targets</key>
					<array>
						<string>system</string>
					</array>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_targets</key>
			<array>
				<string>system</string>
			</array>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the device prevents the File Provider extension from using synchronization in any app. Also, none of the other options will be evaluated. Synchronization will be totally disabled for any application.</string>
			<key>pfm_macos_min</key>
			<string>26.4</string>
			<key>pfm_name</key>
			<string>ManagementAllowsRemoteSyncing</string>
			<key>pfm_targets</key>
			<array>
				<string>system</string>
			</array>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>An array of strings representing the composed identifiers of apps. The device allows the corresponding apps to use File Provider extension synchronization. If present, and 'ManagementAllowsRemoteSyncing' is set to 'true', the device allows only the apps in this list to use synchronization. This key is ignored if 'ManagementAllowsRemoteSyncing' is set to 'false'. If present, the other options will only be evaluated for the apps in this list. The format of the app identifiers is "Bundle-ID (Team-ID)", for example 'com.example.app (ABCD1234)'.</string>
			<key>pfm_macos_min</key>
			<string>26.4</string>
			<key>pfm_name</key>
			<string>ManagementRemoteSyncingAllowList</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>A composed app identifier. The format is "Bundle.Identifier (TeamIdentifier)".</string>
					<key>pfm_macos_min</key>
					<string>26.4</string>
					<key>pfm_name</key>
					<string>AllowListItem</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_targets</key>
					<array>
						<string>system</string>
					</array>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_targets</key>
			<array>
				<string>system</string>
			</array>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If 'false', the device only allows File Provider extension volume synchronization for the system "home" volume and any data separated volume, and prevents synchronization with any other volumes. If 'true'', the device allows File Provider extension volume synchronization for the system "home" volume, any data separated volume, and any encrypted APFS volumes (on either internal or external media).</string>
			<key>pfm_macos_min</key>
			<string>26.4</string>
			<key>pfm_name</key>
			<string>ManagementAllowsExternalVolumeSyncing</string>
			<key>pfm_targets</key>
			<array>
				<string>system</string>
			</array>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>An array of strings representing the composed identifiers of apps. The device allows the corresponding apps to use File Provider extension volume synchronization. If present, and 'ManagementAllowsExternalVolumeSyncing' is set to 'true', the device allows only the apps in this list to use volume synchronization. This key is ignored if 'ManagementAllowsExternalVolumeSyncing' is set to 'false'. The format of the app identifiers is "Bundle-ID (Team-ID)", for example 'com.example.app (ABCD1234)'.</string>
			<key>pfm_macos_min</key>
			<string>26.4</string>
			<key>pfm_name</key>
			<string>ManagementExternalVolumeSyncingAllowList</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>A composed app identifier. The format is "Bundle.Identifier (TeamIdentifier)".</string>
					<key>pfm_macos_min</key>
					<string>26.4</string>
					<key>pfm_name</key>
					<string>AllowListItem</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_targets</key>
					<array>
						<string>system</string>
					</array>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_targets</key>
			<array>
				<string>system</string>
			</array>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>An array of strings representing the composed identifiers of apps. The device automatically enables the File Provider domains for the corresponding apps. The device doesn't enable existing domains if enrollment happens after they are created. The device doesn't prevent the user from disabling these File Provider domains. Users need to manually enable File Provider domains in the Finder if their corresponding apps aren't listed here. The format of the app identifiers is "Bundle-ID (Team-ID)", for example 'com.example.app (ABCD1234)'.</string>
			<key>pfm_macos_min</key>
			<string>26.4</string>
			<key>pfm_name</key>
			<string>ManagementDomainAutoEnablementList</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>A composed app identifier. The format is "Bundle.Identifier (TeamIdentifier)".</string>
					<key>pfm_macos_min</key>
					<string>26.4</string>
					<key>pfm_name</key>
					<string>AllowListItem</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_targets</key>
					<array>
						<string>system</string>
					</array>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_targets</key>
			<array>
				<string>system</string>
			</array>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>File Provider</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_user_approved</key>
	<true/>
	<key>pfm_version</key>
	<integer>3</integer>
</dict>
</plist>
