<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Configures Privacy Preferences Policy Control settings</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/documentation/devicemanagement/privacypreferencespolicycontrol</string>
	<key>pfm_domain</key>
	<string>com.apple.TCC.configuration-profile-policy</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_last_modified</key>
	<date>2024-08-12T14:52:11Z</date>
	<key>pfm_macos_min</key>
	<string>10.14</string>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Privacy Preferences Policy Control settings</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Privacy Preferences Policy Control</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.TCC.configuration-profile-policy</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile.
During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.TCC.configuration-profile-policy</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs.
During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>A dictionary whose keys are limited to the privacy policy control services.  In the case of conflicting specifications, the most restrictive setting (deny) is used.</string>
			<key>pfm_name</key>
			<string>Services</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>Specifies the policies for the app via the Accessibility subsystem.</string>
					<key>pfm_macos_min</key>
					<string>10.14</string>
					<key>pfm_name</key>
					<string>Accessibility</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>IdentityDict</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of identifier value. Application bundles must be identified by bundle ID. Nonbundled binaries must be identified by installation path. Helper tools embedded within an application bundle automatically inherit the permissions of their enclosing app bundle.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_description_reference</key>
									<string>Obtained via the command ''codesign -display -r -''.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<false/>
									<key>pfm_description</key>
									<string>If 'true', statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The 'Authorization' key is an optional replacement for the 'Allowed' key, which has one of the following possible values:

* 'Allow': Equivalent to a 'true' value for the 'Allowed' key
* 'Deny': Equivalent to a 'false' value for the 'Allowed' key
* 'AllowStandardUserToSetSystemService': Allows a standard (non-admin) user to configure the permissions for the specified app in the Privacy preferences for services that otherwise require admin authorization; only valid for the 'ListenEvent' and 'ScreenCapture' services

Every payload needs to include either 'Authorization' or 'Allowed', but not both.
Available in macOS 11 and later.</string>
									<key>pfm_macos_min</key>
									<string>11.0</string>
									<key>pfm_name</key>
									<string>Authorization</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Deny</string>
									</array>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfmx_supported_oses</key>
									<dict>
										<key>macOS</key>
										<dict>
											<key>pfmx_introduced</key>
											<string>11.0</string>
										</dict>
									</dict>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If 'true', access is granted; otherwise, the process doesn't have access. The user isn't prompted and can't change this value.
Every payload needs to include either 'Authorization' or 'Allowed', but not both.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not used.</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Accessibility</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Specifies the policies for the app sending restricted AppleEvents to another process.</string>
					<key>pfm_macos_min</key>
					<string>10.14</string>
					<key>pfm_name</key>
					<string>AppleEvents</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>IdentityDict</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of identifier value. Application bundles must be identified by bundle ID. Nonbundled binaries must be identified by installation path. Helper tools embedded within an application bundle automatically inherit the permissions of their enclosing app bundle.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_description_reference</key>
									<string>Obtained via the command ''codesign -display -r -''.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<false/>
									<key>pfm_description</key>
									<string>If 'true', statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The 'Authorization' key is an optional replacement for the 'Allowed' key, which has one of the following possible values:

* 'Allow': Equivalent to a 'true' value for the 'Allowed' key
* 'Deny': Equivalent to a 'false' value for the 'Allowed' key
* 'AllowStandardUserToSetSystemService': Allows a standard (non-admin) user to configure the permissions for the specified app in the Privacy preferences for services that otherwise require admin authorization; only valid for the 'ListenEvent' and 'ScreenCapture' services

Every payload needs to include either 'Authorization' or 'Allowed', but not both.
Available in macOS 11 and later.</string>
									<key>pfm_macos_min</key>
									<string>11.0</string>
									<key>pfm_name</key>
									<string>Authorization</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Deny</string>
									</array>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfmx_supported_oses</key>
									<dict>
										<key>macOS</key>
										<dict>
											<key>pfmx_introduced</key>
											<string>11.0</string>
										</dict>
									</dict>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If 'true', access is granted; otherwise, the process doesn't have access. The user isn't prompted and can't change this value.
Every payload needs to include either 'Authorization' or 'Allowed', but not both.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The identifier of the process receiving an AppleEvent sent by the Identifier process. This identifier is required for AppleEvents service; not valid for other services.</string>
									<key>pfm_name</key>
									<string>AEReceiverIdentifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>AEReceiverIdentifier</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of AEReceiverIdentifier value, either 'bundleID' or 'path'. This setting is required for AppleEvents service; not valid for other services.</string>
									<key>pfm_name</key>
									<string>AEReceiverIdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>AEReceiverIdentifierType</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The code requirement for the receiving binary. This code requirement is required for AppleEvents service; not valid for other services.</string>
									<key>pfm_name</key>
									<string>AEReceiverCodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>AEReceiverCodeRequirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not used.</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Automation</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services.AppleEvents</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Specifies the policies for the app to access Bluetooth devices.</string>
					<key>pfm_macos_min</key>
					<string>11.0</string>
					<key>pfm_name</key>
					<string>BluetoothAlways</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>IdentityDict</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of identifier value. Application bundles must be identified by bundle ID. Nonbundled binaries must be identified by installation path. Helper tools embedded within an application bundle automatically inherit the permissions of their enclosing app bundle.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_description_reference</key>
									<string>Obtained via the command ''codesign -display -r -''.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<false/>
									<key>pfm_description</key>
									<string>If 'true', statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The 'Authorization' key is an optional replacement for the 'Allowed' key, which has one of the following possible values:

* 'Allow': Equivalent to a 'true' value for the 'Allowed' key
* 'Deny': Equivalent to a 'false' value for the 'Allowed' key
* 'AllowStandardUserToSetSystemService': Allows a standard (non-admin) user to configure the permissions for the specified app in the Privacy preferences for services that otherwise require admin authorization; only valid for the 'ListenEvent' and 'ScreenCapture' services

Every payload needs to include either 'Authorization' or 'Allowed', but not both.
Available in macOS 11 and later.</string>
									<key>pfm_macos_min</key>
									<string>11.0</string>
									<key>pfm_name</key>
									<string>Authorization</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Deny</string>
									</array>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfmx_supported_oses</key>
									<dict>
										<key>macOS</key>
										<dict>
											<key>pfmx_introduced</key>
											<string>11.0</string>
										</dict>
									</dict>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If 'true', access is granted; otherwise, the process doesn't have access. The user isn't prompted and can't change this value.
Every payload needs to include either 'Authorization' or 'Allowed', but not both.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not used.</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Bluetooth</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>11.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Specifies the policies for calendar information managed by the Calendar.app.</string>
					<key>pfm_macos_min</key>
					<string>10.14</string>
					<key>pfm_name</key>
					<string>Calendar</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>IdentityDict</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of identifier value. Application bundles must be identified by bundle ID. Nonbundled binaries must be identified by installation path. Helper tools embedded within an application bundle automatically inherit the permissions of their enclosing app bundle.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_description_reference</key>
									<string>Obtained via the command ''codesign -display -r -''.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<false/>
									<key>pfm_description</key>
									<string>If 'true', statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The 'Authorization' key is an optional replacement for the 'Allowed' key, which has one of the following possible values:

* 'Allow': Equivalent to a 'true' value for the 'Allowed' key
* 'Deny': Equivalent to a 'false' value for the 'Allowed' key
* 'AllowStandardUserToSetSystemService': Allows a standard (non-admin) user to configure the permissions for the specified app in the Privacy preferences for services that otherwise require admin authorization; only valid for the 'ListenEvent' and 'ScreenCapture' services

Every payload needs to include either 'Authorization' or 'Allowed', but not both.
Available in macOS 11 and later.</string>
									<key>pfm_macos_min</key>
									<string>11.0</string>
									<key>pfm_name</key>
									<string>Authorization</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Deny</string>
									</array>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfmx_supported_oses</key>
									<dict>
										<key>macOS</key>
										<dict>
											<key>pfmx_introduced</key>
											<string>11.0</string>
										</dict>
									</dict>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If 'true', access is granted; otherwise, the process doesn't have access. The user isn't prompted and can't change this value.
Every payload needs to include either 'Authorization' or 'Allowed', but not both.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not used.</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Calendars</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A system camera. Access to the camera can't be given in a profile; it can only be denied.</string>
					<key>pfm_macos_min</key>
					<string>10.14</string>
					<key>pfm_name</key>
					<string>Camera</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>IdentityDict</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of identifier value. Application bundles must be identified by bundle ID. Nonbundled binaries must be identified by installation path. Helper tools embedded within an application bundle automatically inherit the permissions of their enclosing app bundle.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_description_reference</key>
									<string>Obtained via the command ''codesign -display -r -''.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<false/>
									<key>pfm_description</key>
									<string>If 'true', statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The 'Authorization' key is an optional replacement for the 'Allowed' key, which has one of the following possible values:

* 'Allow': Equivalent to a 'true' value for the 'Allowed' key
* 'Deny': Equivalent to a 'false' value for the 'Allowed' key
* 'AllowStandardUserToSetSystemService': Allows a standard (non-admin) user to configure the permissions for the specified app in the Privacy preferences for services that otherwise require admin authorization; only valid for the 'ListenEvent' and 'ScreenCapture' services

Every payload needs to include either 'Authorization' or 'Allowed', but not both.
Available in macOS 11 and later.</string>
									<key>pfm_macos_min</key>
									<string>11.0</string>
									<key>pfm_name</key>
									<string>Authorization</string>
									<key>pfm_range_list</key>
									<array>
										<string>Deny</string>
									</array>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfmx_supported_oses</key>
									<dict>
										<key>macOS</key>
										<dict>
											<key>pfmx_introduced</key>
											<string>11.0</string>
										</dict>
									</dict>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If 'true', access is granted; otherwise, the process doesn't have access. The user isn't prompted and can't change this value.
Every payload needs to include either 'Authorization' or 'Allowed', but not both.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not used.</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Camera</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Specifies the policies for contact information managed by the Contacts.app.</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>AddressBook</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>IdentityDict</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of identifier value. Application bundles must be identified by bundle ID. Nonbundled binaries must be identified by installation path. Helper tools embedded within an application bundle automatically inherit the permissions of their enclosing app bundle.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_description_reference</key>
									<string>Obtained via the command ''codesign -display -r -''.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<false/>
									<key>pfm_description</key>
									<string>If 'true', statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The 'Authorization' key is an optional replacement for the 'Allowed' key, which has one of the following possible values:

* 'Allow': Equivalent to a 'true' value for the 'Allowed' key
* 'Deny': Equivalent to a 'false' value for the 'Allowed' key
* 'AllowStandardUserToSetSystemService': Allows a standard (non-admin) user to configure the permissions for the specified app in the Privacy preferences for services that otherwise require admin authorization; only valid for the 'ListenEvent' and 'ScreenCapture' services

Every payload needs to include either 'Authorization' or 'Allowed', but not both.
Available in macOS 11 and later.</string>
									<key>pfm_macos_min</key>
									<string>11.0</string>
									<key>pfm_name</key>
									<string>Authorization</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Deny</string>
									</array>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfmx_supported_oses</key>
									<dict>
										<key>macOS</key>
										<dict>
											<key>pfmx_introduced</key>
											<string>11.0</string>
										</dict>
									</dict>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If 'true', access is granted; otherwise, the process doesn't have access. The user isn't prompted and can't change this value.
Every payload needs to include either 'Authorization' or 'Allowed', but not both.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not used.</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Contacts</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Allows a File Provider application to know when the user is using files managed by the File Provider.</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>FileProviderPresence</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>IdentityDict</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of identifier value. Application bundles must be identified by bundle ID. Nonbundled binaries must be identified by installation path. Helper tools embedded within an application bundle automatically inherit the permissions of their enclosing app bundle.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_description_reference</key>
									<string>Obtained via the command ''codesign -display -r -''.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<false/>
									<key>pfm_description</key>
									<string>If 'true', statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The 'Authorization' key is an optional replacement for the 'Allowed' key, which has one of the following possible values:

* 'Allow': Equivalent to a 'true' value for the 'Allowed' key
* 'Deny': Equivalent to a 'false' value for the 'Allowed' key
* 'AllowStandardUserToSetSystemService': Allows a standard (non-admin) user to configure the permissions for the specified app in the Privacy preferences for services that otherwise require admin authorization; only valid for the 'ListenEvent' and 'ScreenCapture' services

Every payload needs to include either 'Authorization' or 'Allowed', but not both.
Available in macOS 11 and later.</string>
									<key>pfm_macos_min</key>
									<string>11.0</string>
									<key>pfm_name</key>
									<string>Authorization</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Deny</string>
									</array>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfmx_supported_oses</key>
									<dict>
										<key>macOS</key>
										<dict>
											<key>pfmx_introduced</key>
											<string>11.0</string>
										</dict>
									</dict>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If 'true', access is granted; otherwise, the process doesn't have access. The user isn't prompted and can't change this value.
Every payload needs to include either 'Authorization' or 'Allowed', but not both.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not used.</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.15</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Allows the application to use CoreGraphics and HID APIs to listen to (receive) CGEvents and HID events from all processes. Access to these events can't be given in a profile; it can only be denied.</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>ListenEvent</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>IdentityDict</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of identifier value. Application bundles must be identified by bundle ID. Nonbundled binaries must be identified by installation path. Helper tools embedded within an application bundle automatically inherit the permissions of their enclosing app bundle.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_description_reference</key>
									<string>Obtained via the command ''codesign -display -r -''.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<false/>
									<key>pfm_description</key>
									<string>If 'true', statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The 'Authorization' key is an optional replacement for the 'Allowed' key, which has one of the following possible values:

* 'Allow': Equivalent to a 'true' value for the 'Allowed' key
* 'Deny': Equivalent to a 'false' value for the 'Allowed' key
* 'AllowStandardUserToSetSystemService': Allows a standard (non-admin) user to configure the permissions for the specified app in the Privacy preferences for services that otherwise require admin authorization; only valid for the 'ListenEvent' and 'ScreenCapture' services

Every payload needs to include either 'Authorization' or 'Allowed', but not both.
Available in macOS 11 and later.</string>
									<key>pfm_macos_min</key>
									<string>11.0</string>
									<key>pfm_name</key>
									<string>Authorization</string>
									<key>pfm_range_list</key>
									<array>
										<string>Deny</string>
										<string>AllowStandardUserToSetSystemService</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow Standard User to Set</string>
									</array>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfmx_supported_oses</key>
									<dict>
										<key>macOS</key>
										<dict>
											<key>pfmx_introduced</key>
											<string>11.0</string>
										</dict>
									</dict>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If 'true', access is granted; otherwise, the process doesn't have access. The user isn't prompted and can't change this value.
Every payload needs to include either 'Authorization' or 'Allowed', but not both.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not used.</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Input Monitoring</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.15</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Allows the application to access Apple Music, music and video activity, and the media library.</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>MediaLibrary</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>IdentityDict</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of identifier value. Application bundles must be identified by bundle ID. Nonbundled binaries must be identified by installation path. Helper tools embedded within an application bundle automatically inherit the permissions of their enclosing app bundle.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_description_reference</key>
									<string>Obtained via the command ''codesign -display -r -''.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<false/>
									<key>pfm_description</key>
									<string>If 'true', statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The 'Authorization' key is an optional replacement for the 'Allowed' key, which has one of the following possible values:

* 'Allow': Equivalent to a 'true' value for the 'Allowed' key
* 'Deny': Equivalent to a 'false' value for the 'Allowed' key
* 'AllowStandardUserToSetSystemService': Allows a standard (non-admin) user to configure the permissions for the specified app in the Privacy preferences for services that otherwise require admin authorization; only valid for the 'ListenEvent' and 'ScreenCapture' services

Every payload needs to include either 'Authorization' or 'Allowed', but not both.
Available in macOS 11 and later.</string>
									<key>pfm_macos_min</key>
									<string>11.0</string>
									<key>pfm_name</key>
									<string>Authorization</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Deny</string>
									</array>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfmx_supported_oses</key>
									<dict>
										<key>macOS</key>
										<dict>
											<key>pfmx_introduced</key>
											<string>11.0</string>
										</dict>
									</dict>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If 'true', access is granted; otherwise, the process doesn't have access. The user isn't prompted and can't change this value.
Every payload needs to include either 'Authorization' or 'Allowed', but not both.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not used.</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Media &amp; Apple Music</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.15</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>A system microphone. Access to the microphone can't be given in a profile; it can only be denied.</string>
					<key>pfm_macos_min</key>
					<string>10.14</string>
					<key>pfm_name</key>
					<string>Microphone</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>IdentityDict</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of identifier value. Application bundles must be identified by bundle ID. Nonbundled binaries must be identified by installation path. Helper tools embedded within an application bundle automatically inherit the permissions of their enclosing app bundle.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_description_reference</key>
									<string>Obtained via the command ''codesign -display -r -''.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<false/>
									<key>pfm_description</key>
									<string>If 'true', statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The 'Authorization' key is an optional replacement for the 'Allowed' key, which has one of the following possible values:

* 'Allow': Equivalent to a 'true' value for the 'Allowed' key
* 'Deny': Equivalent to a 'false' value for the 'Allowed' key
* 'AllowStandardUserToSetSystemService': Allows a standard (non-admin) user to configure the permissions for the specified app in the Privacy preferences for services that otherwise require admin authorization; only valid for the 'ListenEvent' and 'ScreenCapture' services

Every payload needs to include either 'Authorization' or 'Allowed', but not both.
Available in macOS 11 and later.</string>
									<key>pfm_macos_min</key>
									<string>11.0</string>
									<key>pfm_name</key>
									<string>Authorization</string>
									<key>pfm_range_list</key>
									<array>
										<string>Deny</string>
									</array>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfmx_supported_oses</key>
									<dict>
										<key>macOS</key>
										<dict>
											<key>pfmx_introduced</key>
											<string>11.0</string>
										</dict>
									</dict>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If 'true', access is granted; otherwise, the process doesn't have access. The user isn't prompted and can't change this value.
Every payload needs to include either 'Authorization' or 'Allowed', but not both.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not used.</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Microphone</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The pictures managed by the Photos app in '~/Pictures/.photoslibrary'.</string>
					<key>pfm_macos_min</key>
					<string>10.14</string>
					<key>pfm_name</key>
					<string>Photos</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>IdentityDict</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of identifier value. Application bundles must be identified by bundle ID. Nonbundled binaries must be identified by installation path. Helper tools embedded within an application bundle automatically inherit the permissions of their enclosing app bundle.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_description_reference</key>
									<string>Obtained via the command ''codesign -display -r -''.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<false/>
									<key>pfm_description</key>
									<string>If 'true', statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The 'Authorization' key is an optional replacement for the 'Allowed' key, which has one of the following possible values:

* 'Allow': Equivalent to a 'true' value for the 'Allowed' key
* 'Deny': Equivalent to a 'false' value for the 'Allowed' key
* 'AllowStandardUserToSetSystemService': Allows a standard (non-admin) user to configure the permissions for the specified app in the Privacy preferences for services that otherwise require admin authorization; only valid for the 'ListenEvent' and 'ScreenCapture' services

Every payload needs to include either 'Authorization' or 'Allowed', but not both.
Available in macOS 11 and later.</string>
									<key>pfm_macos_min</key>
									<string>11.0</string>
									<key>pfm_name</key>
									<string>Authorization</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Deny</string>
									</array>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfmx_supported_oses</key>
									<dict>
										<key>macOS</key>
										<dict>
											<key>pfmx_introduced</key>
											<string>11.0</string>
										</dict>
									</dict>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If 'true', access is granted; otherwise, the process doesn't have access. The user isn't prompted and can't change this value.
Every payload needs to include either 'Authorization' or 'Allowed', but not both.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not used.</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Photos</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Specifies the policies for the application to use CoreGraphics APIs to send CGEvents to the system event stream.</string>
					<key>pfm_macos_min</key>
					<string>10.14</string>
					<key>pfm_name</key>
					<string>PostEvent</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>IdentityDict</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of identifier value. Application bundles must be identified by bundle ID. Nonbundled binaries must be identified by installation path. Helper tools embedded within an application bundle automatically inherit the permissions of their enclosing app bundle.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_description_reference</key>
									<string>Obtained via the command ''codesign -display -r -''.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<false/>
									<key>pfm_description</key>
									<string>If 'true', statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The 'Authorization' key is an optional replacement for the 'Allowed' key, which has one of the following possible values:

* 'Allow': Equivalent to a 'true' value for the 'Allowed' key
* 'Deny': Equivalent to a 'false' value for the 'Allowed' key
* 'AllowStandardUserToSetSystemService': Allows a standard (non-admin) user to configure the permissions for the specified app in the Privacy preferences for services that otherwise require admin authorization; only valid for the 'ListenEvent' and 'ScreenCapture' services

Every payload needs to include either 'Authorization' or 'Allowed', but not both.
Available in macOS 11 and later.</string>
									<key>pfm_macos_min</key>
									<string>11.0</string>
									<key>pfm_name</key>
									<string>Authorization</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Deny</string>
									</array>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfmx_supported_oses</key>
									<dict>
										<key>macOS</key>
										<dict>
											<key>pfmx_introduced</key>
											<string>11.0</string>
										</dict>
									</dict>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If 'true', access is granted; otherwise, the process doesn't have access. The user isn't prompted and can't change this value.
Every payload needs to include either 'Authorization' or 'Allowed', but not both.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not used.</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>PostEvent</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Specifies the policies for reminders information managed by the Reminders app.</string>
					<key>pfm_macos_min</key>
					<string>10.14</string>
					<key>pfm_name</key>
					<string>Reminders</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>IdentityDict</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of identifier value. Application bundles must be identified by bundle ID. Nonbundled binaries must be identified by installation path. Helper tools embedded within an application bundle automatically inherit the permissions of their enclosing app bundle.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_description_reference</key>
									<string>Obtained via the command ''codesign -display -r -''.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<false/>
									<key>pfm_description</key>
									<string>If 'true', statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The 'Authorization' key is an optional replacement for the 'Allowed' key, which has one of the following possible values:

* 'Allow': Equivalent to a 'true' value for the 'Allowed' key
* 'Deny': Equivalent to a 'false' value for the 'Allowed' key
* 'AllowStandardUserToSetSystemService': Allows a standard (non-admin) user to configure the permissions for the specified app in the Privacy preferences for services that otherwise require admin authorization; only valid for the 'ListenEvent' and 'ScreenCapture' services

Every payload needs to include either 'Authorization' or 'Allowed', but not both.
Available in macOS 11 and later.</string>
									<key>pfm_macos_min</key>
									<string>11.0</string>
									<key>pfm_name</key>
									<string>Authorization</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Deny</string>
									</array>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfmx_supported_oses</key>
									<dict>
										<key>macOS</key>
										<dict>
											<key>pfmx_introduced</key>
											<string>11.0</string>
										</dict>
									</dict>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If 'true', access is granted; otherwise, the process doesn't have access. The user isn't prompted and can't change this value.
Every payload needs to include either 'Authorization' or 'Allowed', but not both.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not used.</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Reminders</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Allows the application access to all protected files, including system administration files.</string>
					<key>pfm_macos_min</key>
					<string>10.14</string>
					<key>pfm_name</key>
					<string>SystemPolicyAllFiles</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>IdentityDict</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of identifier value. Application bundles must be identified by bundle ID. Nonbundled binaries must be identified by installation path. Helper tools embedded within an application bundle automatically inherit the permissions of their enclosing app bundle.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_description_reference</key>
									<string>Obtained via the command ''codesign -display -r -''.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<false/>
									<key>pfm_description</key>
									<string>If 'true', statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The 'Authorization' key is an optional replacement for the 'Allowed' key, which has one of the following possible values:

* 'Allow': Equivalent to a 'true' value for the 'Allowed' key
* 'Deny': Equivalent to a 'false' value for the 'Allowed' key
* 'AllowStandardUserToSetSystemService': Allows a standard (non-admin) user to configure the permissions for the specified app in the Privacy preferences for services that otherwise require admin authorization; only valid for the 'ListenEvent' and 'ScreenCapture' services

Every payload needs to include either 'Authorization' or 'Allowed', but not both.
Available in macOS 11 and later.</string>
									<key>pfm_macos_min</key>
									<string>11.0</string>
									<key>pfm_name</key>
									<string>Authorization</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Deny</string>
									</array>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfmx_supported_oses</key>
									<dict>
										<key>macOS</key>
										<dict>
											<key>pfmx_introduced</key>
											<string>11.0</string>
										</dict>
									</dict>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If 'true', access is granted; otherwise, the process doesn't have access. The user isn't prompted and can't change this value.
Every payload needs to include either 'Authorization' or 'Allowed', but not both.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not used.</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Full Disk Access</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Allows the application to capture (read) the contents of the system display. Access to the contents can't be given in a profile; it can only be denied.</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>ScreenCapture</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>IdentityDict</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of identifier value. Application bundles must be identified by bundle ID. Nonbundled binaries must be identified by installation path. Helper tools embedded within an application bundle automatically inherit the permissions of their enclosing app bundle.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_description_reference</key>
									<string>Obtained via the command ''codesign -display -r -''.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<false/>
									<key>pfm_description</key>
									<string>If 'true', statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The 'Authorization' key is an optional replacement for the 'Allowed' key, which has one of the following possible values:

* 'Allow': Equivalent to a 'true' value for the 'Allowed' key
* 'Deny': Equivalent to a 'false' value for the 'Allowed' key
* 'AllowStandardUserToSetSystemService': Allows a standard (non-admin) user to configure the permissions for the specified app in the Privacy preferences for services that otherwise require admin authorization; only valid for the 'ListenEvent' and 'ScreenCapture' services

Every payload needs to include either 'Authorization' or 'Allowed', but not both.
Available in macOS 11 and later.</string>
									<key>pfm_macos_min</key>
									<string>11.0</string>
									<key>pfm_name</key>
									<string>Authorization</string>
									<key>pfm_range_list</key>
									<array>
										<string>Deny</string>
										<string>AllowStandardUserToSetSystemService</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow Standard User to Set</string>
									</array>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfmx_supported_oses</key>
									<dict>
										<key>macOS</key>
										<dict>
											<key>pfmx_introduced</key>
											<string>11.0</string>
										</dict>
									</dict>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If 'true', access is granted; otherwise, the process doesn't have access. The user isn't prompted and can't change this value.
Every payload needs to include either 'Authorization' or 'Allowed', but not both.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not used.</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Screen &amp; System Audio Recording</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.15</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Allows the application to use the system Speech Recognition facility and to send speech data to Apple.</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>SpeechRecognition</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>IdentityDict</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of identifier value. Application bundles must be identified by bundle ID. Nonbundled binaries must be identified by installation path. Helper tools embedded within an application bundle automatically inherit the permissions of their enclosing app bundle.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_description_reference</key>
									<string>Obtained via the command ''codesign -display -r -''.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<false/>
									<key>pfm_description</key>
									<string>If 'true', statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The 'Authorization' key is an optional replacement for the 'Allowed' key, which has one of the following possible values:

* 'Allow': Equivalent to a 'true' value for the 'Allowed' key
* 'Deny': Equivalent to a 'false' value for the 'Allowed' key
* 'AllowStandardUserToSetSystemService': Allows a standard (non-admin) user to configure the permissions for the specified app in the Privacy preferences for services that otherwise require admin authorization; only valid for the 'ListenEvent' and 'ScreenCapture' services

Every payload needs to include either 'Authorization' or 'Allowed', but not both.
Available in macOS 11 and later.</string>
									<key>pfm_macos_min</key>
									<string>11.0</string>
									<key>pfm_name</key>
									<string>Authorization</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Deny</string>
									</array>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfmx_supported_oses</key>
									<dict>
										<key>macOS</key>
										<dict>
											<key>pfmx_introduced</key>
											<string>11.0</string>
										</dict>
									</dict>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If 'true', access is granted; otherwise, the process doesn't have access. The user isn't prompted and can't change this value.
Every payload needs to include either 'Authorization' or 'Allowed', but not both.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not used.</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Speech Recognition</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.15</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Allows the application to access files in the user's Desktop folder.</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>SystemPolicyDesktopFolder</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>IdentityDict</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of identifier value. Application bundles must be identified by bundle ID. Nonbundled binaries must be identified by installation path. Helper tools embedded within an application bundle automatically inherit the permissions of their enclosing app bundle.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_description_reference</key>
									<string>Obtained via the command ''codesign -display -r -''.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<false/>
									<key>pfm_description</key>
									<string>If 'true', statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The 'Authorization' key is an optional replacement for the 'Allowed' key, which has one of the following possible values:

* 'Allow': Equivalent to a 'true' value for the 'Allowed' key
* 'Deny': Equivalent to a 'false' value for the 'Allowed' key
* 'AllowStandardUserToSetSystemService': Allows a standard (non-admin) user to configure the permissions for the specified app in the Privacy preferences for services that otherwise require admin authorization; only valid for the 'ListenEvent' and 'ScreenCapture' services

Every payload needs to include either 'Authorization' or 'Allowed', but not both.
Available in macOS 11 and later.</string>
									<key>pfm_macos_min</key>
									<string>11.0</string>
									<key>pfm_name</key>
									<string>Authorization</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Deny</string>
									</array>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfmx_supported_oses</key>
									<dict>
										<key>macOS</key>
										<dict>
											<key>pfmx_introduced</key>
											<string>11.0</string>
										</dict>
									</dict>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If 'true', access is granted; otherwise, the process doesn't have access. The user isn't prompted and can't change this value.
Every payload needs to include either 'Authorization' or 'Allowed', but not both.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not used.</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Files and Folders: Desktop Folder</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.15</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Allows the application to access files in the user's Documents folder.</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>SystemPolicyDocumentsFolder</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>IdentityDict</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of identifier value. Application bundles must be identified by bundle ID. Nonbundled binaries must be identified by installation path. Helper tools embedded within an application bundle automatically inherit the permissions of their enclosing app bundle.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_description_reference</key>
									<string>Obtained via the command ''codesign -display -r -''.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<false/>
									<key>pfm_description</key>
									<string>If 'true', statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The 'Authorization' key is an optional replacement for the 'Allowed' key, which has one of the following possible values:

* 'Allow': Equivalent to a 'true' value for the 'Allowed' key
* 'Deny': Equivalent to a 'false' value for the 'Allowed' key
* 'AllowStandardUserToSetSystemService': Allows a standard (non-admin) user to configure the permissions for the specified app in the Privacy preferences for services that otherwise require admin authorization; only valid for the 'ListenEvent' and 'ScreenCapture' services

Every payload needs to include either 'Authorization' or 'Allowed', but not both.
Available in macOS 11 and later.</string>
									<key>pfm_macos_min</key>
									<string>11.0</string>
									<key>pfm_name</key>
									<string>Authorization</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Deny</string>
									</array>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfmx_supported_oses</key>
									<dict>
										<key>macOS</key>
										<dict>
											<key>pfmx_introduced</key>
											<string>11.0</string>
										</dict>
									</dict>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If 'true', access is granted; otherwise, the process doesn't have access. The user isn't prompted and can't change this value.
Every payload needs to include either 'Authorization' or 'Allowed', but not both.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not used.</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Files and Folders: Documents Folder</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.15</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Allows the application to access files in the user's Downloads folder.</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>SystemPolicyDownloadsFolder</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>IdentityDict</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of identifier value. Application bundles must be identified by bundle ID. Nonbundled binaries must be identified by installation path. Helper tools embedded within an application bundle automatically inherit the permissions of their enclosing app bundle.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_description_reference</key>
									<string>Obtained via the command ''codesign -display -r -''.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<false/>
									<key>pfm_description</key>
									<string>If 'true', statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The 'Authorization' key is an optional replacement for the 'Allowed' key, which has one of the following possible values:

* 'Allow': Equivalent to a 'true' value for the 'Allowed' key
* 'Deny': Equivalent to a 'false' value for the 'Allowed' key
* 'AllowStandardUserToSetSystemService': Allows a standard (non-admin) user to configure the permissions for the specified app in the Privacy preferences for services that otherwise require admin authorization; only valid for the 'ListenEvent' and 'ScreenCapture' services

Every payload needs to include either 'Authorization' or 'Allowed', but not both.
Available in macOS 11 and later.</string>
									<key>pfm_macos_min</key>
									<string>11.0</string>
									<key>pfm_name</key>
									<string>Authorization</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Deny</string>
									</array>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfmx_supported_oses</key>
									<dict>
										<key>macOS</key>
										<dict>
											<key>pfmx_introduced</key>
											<string>11.0</string>
										</dict>
									</dict>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If 'true', access is granted; otherwise, the process doesn't have access. The user isn't prompted and can't change this value.
Every payload needs to include either 'Authorization' or 'Allowed', but not both.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not used.</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Files and Folders: Downloads Folder</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.15</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Allows the application to access files on network volumes.</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>SystemPolicyNetworkVolumes</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>IdentityDict</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of identifier value. Application bundles must be identified by bundle ID. Nonbundled binaries must be identified by installation path. Helper tools embedded within an application bundle automatically inherit the permissions of their enclosing app bundle.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_description_reference</key>
									<string>Obtained via the command ''codesign -display -r -''.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<false/>
									<key>pfm_description</key>
									<string>If 'true', statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The 'Authorization' key is an optional replacement for the 'Allowed' key, which has one of the following possible values:

* 'Allow': Equivalent to a 'true' value for the 'Allowed' key
* 'Deny': Equivalent to a 'false' value for the 'Allowed' key
* 'AllowStandardUserToSetSystemService': Allows a standard (non-admin) user to configure the permissions for the specified app in the Privacy preferences for services that otherwise require admin authorization; only valid for the 'ListenEvent' and 'ScreenCapture' services

Every payload needs to include either 'Authorization' or 'Allowed', but not both.
Available in macOS 11 and later.</string>
									<key>pfm_macos_min</key>
									<string>11.0</string>
									<key>pfm_name</key>
									<string>Authorization</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Deny</string>
									</array>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfmx_supported_oses</key>
									<dict>
										<key>macOS</key>
										<dict>
											<key>pfmx_introduced</key>
											<string>11.0</string>
										</dict>
									</dict>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If 'true', access is granted; otherwise, the process doesn't have access. The user isn't prompted and can't change this value.
Every payload needs to include either 'Authorization' or 'Allowed', but not both.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not used.</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Files and Folders: Network Volumes</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.15</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Allows the application to access files on removable volumes.</string>
					<key>pfm_macos_min</key>
					<string>10.15</string>
					<key>pfm_name</key>
					<string>SystemPolicyRemovableVolumes</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>IdentityDict</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of identifier value. Application bundles must be identified by bundle ID. Nonbundled binaries must be identified by installation path. Helper tools embedded within an application bundle automatically inherit the permissions of their enclosing app bundle.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_description_reference</key>
									<string>Obtained via the command ''codesign -display -r -''.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<false/>
									<key>pfm_description</key>
									<string>If 'true', statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The 'Authorization' key is an optional replacement for the 'Allowed' key, which has one of the following possible values:

* 'Allow': Equivalent to a 'true' value for the 'Allowed' key
* 'Deny': Equivalent to a 'false' value for the 'Allowed' key
* 'AllowStandardUserToSetSystemService': Allows a standard (non-admin) user to configure the permissions for the specified app in the Privacy preferences for services that otherwise require admin authorization; only valid for the 'ListenEvent' and 'ScreenCapture' services

Every payload needs to include either 'Authorization' or 'Allowed', but not both.
Available in macOS 11 and later.</string>
									<key>pfm_macos_min</key>
									<string>11.0</string>
									<key>pfm_name</key>
									<string>Authorization</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Deny</string>
									</array>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfmx_supported_oses</key>
									<dict>
										<key>macOS</key>
										<dict>
											<key>pfmx_introduced</key>
											<string>11.0</string>
										</dict>
									</dict>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If 'true', access is granted; otherwise, the process doesn't have access. The user isn't prompted and can't change this value.
Every payload needs to include either 'Authorization' or 'Allowed', but not both.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not used.</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Files and Folders: Removable Volumes</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>10.15</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Allows the application access to some files used in system administration.</string>
					<key>pfm_macos_min</key>
					<string>10.14</string>
					<key>pfm_name</key>
					<string>SystemPolicySysAdminFiles</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>IdentityDict</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of identifier value. Application bundles must be identified by bundle ID. Nonbundled binaries must be identified by installation path. Helper tools embedded within an application bundle automatically inherit the permissions of their enclosing app bundle.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_description_reference</key>
									<string>Obtained via the command ''codesign -display -r -''.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<false/>
									<key>pfm_description</key>
									<string>If 'true', statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The 'Authorization' key is an optional replacement for the 'Allowed' key, which has one of the following possible values:

* 'Allow': Equivalent to a 'true' value for the 'Allowed' key
* 'Deny': Equivalent to a 'false' value for the 'Allowed' key
* 'AllowStandardUserToSetSystemService': Allows a standard (non-admin) user to configure the permissions for the specified app in the Privacy preferences for services that otherwise require admin authorization; only valid for the 'ListenEvent' and 'ScreenCapture' services

Every payload needs to include either 'Authorization' or 'Allowed', but not both.
Available in macOS 11 and later.</string>
									<key>pfm_macos_min</key>
									<string>11.0</string>
									<key>pfm_name</key>
									<string>Authorization</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Deny</string>
									</array>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfmx_supported_oses</key>
									<dict>
										<key>macOS</key>
										<dict>
											<key>pfmx_introduced</key>
											<string>11.0</string>
										</dict>
									</dict>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If 'true', access is granted; otherwise, the process doesn't have access. The user isn't prompted and can't change this value.
Every payload needs to include either 'Authorization' or 'Allowed', but not both.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not used.</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>System Administration Files</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Allows the application to access data of other apps.</string>
					<key>pfm_macos_min</key>
					<string>14.0</string>
					<key>pfm_name</key>
					<string>SystemPolicyAppData</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>IdentityDict</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of identifier value. Application bundles must be identified by bundle ID. Nonbundled binaries must be identified by installation path. Helper tools embedded within an application bundle automatically inherit the permissions of their enclosing app bundle.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_description_reference</key>
									<string>Obtained via the command ''codesign -display -r -''.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<false/>
									<key>pfm_description</key>
									<string>If 'true', statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The 'Authorization' key is an optional replacement for the 'Allowed' key, which has one of the following possible values:

* 'Allow': Equivalent to a 'true' value for the 'Allowed' key
* 'Deny': Equivalent to a 'false' value for the 'Allowed' key
* 'AllowStandardUserToSetSystemService': Allows a standard (non-admin) user to configure the permissions for the specified app in the Privacy preferences for services that otherwise require admin authorization; only valid for the 'ListenEvent' and 'ScreenCapture' services

Every payload needs to include either 'Authorization' or 'Allowed', but not both.
Available in macOS 11 and later.</string>
									<key>pfm_macos_min</key>
									<string>11.0</string>
									<key>pfm_name</key>
									<string>Authorization</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Deny</string>
									</array>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfmx_supported_oses</key>
									<dict>
										<key>macOS</key>
										<dict>
											<key>pfmx_introduced</key>
											<string>11.0</string>
										</dict>
									</dict>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If 'true', access is granted; otherwise, the process doesn't have access. The user isn't prompted and can't change this value.
Every payload needs to include either 'Authorization' or 'Allowed', but not both.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not used.</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Files and Folders: Other App Containers</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>14.0</string>
						</dict>
					</dict>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Allows the application to update or delete other apps. Available in macOS 13 and later.</string>
					<key>pfm_macos_min</key>
					<string>13.0</string>
					<key>pfm_name</key>
					<string>SystemPolicyAppBundles</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Keys are limited to the privacy service names listed below. Each key is an array of dictionaries describing the app or process to which access is given. In the case of conflicting specifications, the most restrictive setting (deny) will be used.</string>
							<key>pfm_name</key>
							<string>IdentityDict</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The bundle ID or installation path of the binary.</string>
									<key>pfm_name</key>
									<string>Identifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfm_value_placeholder</key>
									<string>com.github.erikberglund.ProfileCreator</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The type of identifier value. Application bundles must be identified by bundle ID. Nonbundled binaries must be identified by installation path. Helper tools embedded within an application bundle automatically inherit the permissions of their enclosing app bundle.</string>
									<key>pfm_name</key>
									<string>IdentifierType</string>
									<key>pfm_range_list</key>
									<array>
										<string>bundleID</string>
										<string>path</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Bundle ID</string>
										<string>Path</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Identifier Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The designated requirement describing the code signature of this executable.</string>
									<key>pfm_description_reference</key>
									<string>Obtained via the command ''codesign -display -r -''.</string>
									<key>pfm_name</key>
									<string>CodeRequirement</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Code Requirement</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<false/>
									<key>pfm_description</key>
									<string>If 'true', statically validate the code requirement. Used only if the process invalidates its dynamic code signature.</string>
									<key>pfm_name</key>
									<string>StaticCode</string>
									<key>pfm_title</key>
									<string>StaticCode</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The 'Authorization' key is an optional replacement for the 'Allowed' key, which has one of the following possible values:

* 'Allow': Equivalent to a 'true' value for the 'Allowed' key
* 'Deny': Equivalent to a 'false' value for the 'Allowed' key
* 'AllowStandardUserToSetSystemService': Allows a standard (non-admin) user to configure the permissions for the specified app in the Privacy preferences for services that otherwise require admin authorization; only valid for the 'ListenEvent' and 'ScreenCapture' services

Every payload needs to include either 'Authorization' or 'Allowed', but not both.
Available in macOS 11 and later.</string>
									<key>pfm_macos_min</key>
									<string>11.0</string>
									<key>pfm_name</key>
									<string>Authorization</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Deny</string>
									</array>
									<key>pfm_type</key>
									<string>string</string>
									<key>pfmx_supported_oses</key>
									<dict>
										<key>macOS</key>
										<dict>
											<key>pfmx_introduced</key>
											<string>11.0</string>
										</dict>
									</dict>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>If 'true', access is granted; otherwise, the process doesn't have access. The user isn't prompted and can't change this value.
Every payload needs to include either 'Authorization' or 'Allowed', but not both.</string>
									<key>pfm_name</key>
									<string>Allowed</string>
									<key>pfm_range_list</key>
									<array>
										<false/>
										<true/>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Deny</string>
										<string>Allow</string>
									</array>
									<key>pfm_title</key>
									<string>Allowed</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Not used.</string>
									<key>pfm_hidden</key>
									<string>all</string>
									<key>pfm_name</key>
									<string>Comment</string>
									<key>pfm_title</key>
									<string>Comment</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Services</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>App Management</string>
					<key>pfm_type</key>
					<string>array</string>
					<key>pfm_value_import_processor</key>
					<string>com.apple.TCC.configuration-profile-policy.services</string>
					<key>pfmx_supported_oses</key>
					<dict>
						<key>macOS</key>
						<dict>
							<key>pfmx_introduced</key>
							<string>13.0</string>
						</dict>
					</dict>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Services</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Privacy Preferences Policy Control</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_user_approved</key>
	<true/>
	<key>pfm_version</key>
	<integer>9</integer>
	<key>pfmx_supported_oses</key>
	<dict>
		<key>macOS</key>
		<dict>
			<key>pfmx_allow_manual_install</key>
			<false/>
			<key>pfmx_device_channel</key>
			<true/>
			<key>pfmx_introduced</key>
			<string>10.14</string>
			<key>pfmx_multiple</key>
			<true/>
			<key>pfmx_requires_dep</key>
			<false/>
			<key>pfmx_user_approved_mdm</key>
			<true/>
			<key>pfmx_user_channel</key>
			<false/>
			<key>pfmx_user_enrollment</key>
			<dict>
				<key>pfmx_mode</key>
				<string>forbidden</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
