<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Custom preferences for the AppBar menu bar application.</string>
	<key>pfm_documentation_url</key>
	<string>https://docs.zappl.co/appbar/appbar-preferences</string>
	<key>pfm_domain</key>
	<string>com.zappl.AppBar</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2026-04-14T00:00:00Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures AppBar preferences</string>
			<key>pfm_description</key>
			<string>AppBar is a menu bar application developed by DARE Technology for use with Zappl.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>AppBar</string>
			<key>pfm_description</key>
			<string>AppBar is a menu bar application developed by DARE Technology for use with Zappl.</string>
			<key>pfm_description_reference</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.zappl.AppBar</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_description_reference</key>
			<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.zappl.AppBar</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string.</string>
			<key>pfm_description_reference</key>
			<string>The payload type.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_description_reference</key>
			<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>AppBar</string>
			<key>pfm_description</key>
			<string>The title text shown in the top left of the AppBar window</string>
			<key>pfm_name</key>
			<string>Title</string>
			<key>pfm_title</key>
			<string>Title</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>AppBar</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>22</integer>
			<key>pfm_description</key>
			<string>The font size of the title text shown in the top left of the AppBar window. Accepts numerical values between 16 and 32. Values outside this range will default to 22</string>
			<key>pfm_name</key>
			<string>TitleFontSize</string>
			<key>pfm_range_max</key>
			<integer>32</integer>
			<key>pfm_range_min</key>
			<integer>16</integer>
			<key>pfm_title</key>
			<string>Title Font Size</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_placeholder</key>
			<string>22</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>app.badge.fill</string>
			<key>pfm_description</key>
			<string>The logo shown to the left of the title text. Can be a file path, URL to an image, or an SFSymbol name. Defaults to the 'Custom Logo (Dark Mode)' option if specified, or the 'app.badge.fill' SFSymbol if neither Custom Logo options are specified</string>
			<key>pfm_name</key>
			<string>CustomLogo</string>
			<key>pfm_title</key>
			<string>Custom Logo</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>app.badge.fill</string>
			<key>pfm_description</key>
			<string>The logo shown to the left of the title text in dark mode. Can be a file path, URL to an image, or an SFSymbol name. Defaults to the 'Custom Logo' option if specified, or the 'app.badge.fill' SFSymbol if neither Custom Logo options are specified</string>
			<key>pfm_name</key>
			<string>CustomLogoDark</string>
			<key>pfm_title</key>
			<string>Custom Logo (Dark Mode)</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>A path or URL to a custom branding logo shown to the right hand side of macOS notifications</string>
			<key>pfm_name</key>
			<string>NotificationIcon</string>
			<key>pfm_title</key>
			<string>Notification Logo</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>square.and.arrow.down.on.square</string>
			<key>pfm_description</key>
			<string>Either a path to an icon (must be 16x16 points) or an SFSymbol name to be used as the menu bar icon. Defaults to the 'square.and.arrow.down.on.square' SFSymbol if not specified</string>
			<key>pfm_name</key>
			<string>MenuBarIcon</string>
			<key>pfm_title</key>
			<string>Menu Bar Icon</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Custom colour to be used for buttons and highlighting. Accepts hex colour codes (e.g., #0000FF). Defaults to macOS system accent colour if not specified</string>
			<key>pfm_name</key>
			<string>AccentColor</string>
			<key>pfm_title</key>
			<string>Accent Colour</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>#0000FF</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Determines whether the installs tab is enabled. Disabled by default. When disabled, users will see a message indicating installs are not allowed. When enabled, users can use the installs tab to install approved apps. To customise approved apps, use the 'Allowed Installs' or 'Excluded Installs' options in the com.dare.zappl.preferences configuration profile</string>
			<key>pfm_name</key>
			<string>InstallsTabEnabled</string>
			<key>pfm_title</key>
			<string>Installs Tab Enabled</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Determines whether the history tab is enabled. Uncheck to hide the history tab which shows recent updates, installs and failures</string>
			<key>pfm_name</key>
			<string>HistoryTabEnabled</string>
			<key>pfm_title</key>
			<string>History Tab Enabled</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Enables the liquid glass effect on macOS 26 (Tahoe) and later. This option has no effect on macOS versions prior to macOS 26</string>
			<key>pfm_name</key>
			<string>LiquidGlassEnabled</string>
			<key>pfm_title</key>
			<string>Liquid Glass Enabled</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Shows a macOS notification when new updates are cached by Zappl and are available to be updated via AppBar. Requires a notifications configuration profile which approves com.zappl.AppBar notifications</string>
			<key>pfm_name</key>
			<string>AllowUpdateNotifications</string>
			<key>pfm_title</key>
			<string>Allow Update Notifications</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Shows a macOS notification when installs complete. Requires a notifications configuration profile which approves com.zappl.AppBar notifications</string>
			<key>pfm_name</key>
			<string>AllowInstallNotifications</string>
			<key>pfm_title</key>
			<string>Allow Install Notifications</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Shows a macOS notification when installs or updates fail. Requires a notifications configuration profile which approves com.zappl.AppBar notifications</string>
			<key>pfm_name</key>
			<string>AllowFailureNotifications</string>
			<key>pfm_title</key>
			<string>Allow Failure Notifications</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Enables the quit button when right-clicking the menu bar icon. Uncheck to disable</string>
			<key>pfm_name</key>
			<string>EnableQuitButton</string>
			<key>pfm_title</key>
			<string>Enable Quit Button</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Enables the about button which shows AppBar information such as installed version when right-clicking the menu bar icon</string>
			<key>pfm_name</key>
			<string>EnableAboutButton</string>
			<key>pfm_title</key>
			<string>Enable About Button</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Customise the default categories apps are assigned to in the installs tab by specifying app identifiers and their desired custom category labels</string>
			<key>pfm_name</key>
			<string>CustomCategories</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>CategoryMappingItem</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>The identifier of the application (e.g., com.example.app)</string>
							<key>pfm_name</key>
							<string>identifier</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>App Identifier</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>com.example.app</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The custom category label to assign to this app</string>
							<key>pfm_name</key>
							<string>category</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Category Label</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Category Mapping</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Custom Categories</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Customise the descriptions shown for apps in the installs tab by specifying app identifiers and their desired custom descriptions</string>
			<key>pfm_name</key>
			<string>CustomDescriptions</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>DescriptionMappingItem</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>The identifier of the application (e.g., com.example.app)</string>
							<key>pfm_name</key>
							<string>identifier</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>App Identifier</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>com.example.app</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>The custom description to display for this app</string>
							<key>pfm_name</key>
							<string>description</string>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_title</key>
							<string>Description Text</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Description Mapping</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Custom Descriptions</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
	</array>
	<key>pfm_title</key>
	<string>AppBar</string>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
