<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://cursor.com/download</string>
	<key>pfm_documentation_url</key>
	<string>https://cursor.com/docs/enterprise/deployment-patterns#mdm-configuration</string>
	<key>pfm_description</key>
	<string>Cursor settings</string>
	<key>pfm_domain</key>
	<string>com.todesktop.230313mzl4w4u92</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2026-03-23T11:30:00Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configure Cursor settings</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Cursor</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.todesktop.230313mzl4w4u92</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile.
During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.todesktop.230313mzl4w4u92</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs.
During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>AllowedExtensions</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Allowed Extensions</string>
			<key>pfm_description</key>
			<string>Controls which extensions can be installed.</string>
			<key>pfm_description_reference</key>
			<string>Controls which extensions can be installed.</string>
			<key>pfm_documentation_url</key>
			<string>https://cursor.com/docs/enterprise/deployment-patterns#string-policies</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>AllowedTeamId</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Allowed Team IDs</string>
			<key>pfm_description</key>
			<string>Controls which team IDs are allowed to log in. Users with unauthorized team IDs are forcefully logged out.</string>
			<key>pfm_description_reference</key>
			<string>Controls which team IDs are allowed to log in. Users with unauthorized team IDs are forcefully logged out.</string>
			<key>pfm_documentation_url</key>
			<string>https://cursor.com/docs/enterprise/deployment-patterns#string-policies</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>ExtensionGalleryServiceUrl</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Extension Gallery Service Url</string>
			<key>pfm_description</key>
			<string>Configures a custom extension marketplace URL.</string>
			<key>pfm_description_reference</key>
			<string>Configures a custom extension marketplace URL.</string>
			<key>pfm_documentation_url</key>
			<string>https://cursor.com/docs/enterprise/deployment-patterns#extensiongalleryserviceurl-policy</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>NetworkDisableHttp2</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_title</key>
			<string>Network Disable Http2</string>
			<key>pfm_description</key>
			<string>Disables HTTP/2 for all requests, using HTTP/1.1 instead.</string>
			<key>pfm_description_reference</key>
			<string>Disables HTTP/2 for all requests, using HTTP/1.1 instead.</string>
			<key>pfm_documentation_url</key>
			<string>https://cursor.com/docs/enterprise/deployment-patterns#boolean-policies</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>UpdateMode</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Update Mode</string>
			<key>pfm_description</key>
			<string>Controls automatic update behavior. Set to 'none' to disable updates.</string>
			<key>pfm_description_reference</key>
			<string>Controls automatic update behavior. Set to 'none' to disable updates.</string>
			<key>pfm_documentation_url</key>
			<string>https://cursor.com/docs/enterprise/deployment-patterns#updatemode-policy</string>
			<key>pfm_range_list</key>
			<array>
				<string>none</string>
				<string>manual</string>
				<string>start</string>
				<string>default</string>
				<string>silentlyApplyOnQuit</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>none - Disables all automatic updates</string>
				<string>manual - Users can manually check for updates</string>
				<string>start - Check for updates when Cursor starts</string>
				<string>default - Default behavior (same as start)</string>
				<string>silentlyApplyOnQuit - Download updates in the background and apply when Cursor quits</string>
			</array>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>WorkspaceTrustEnabled</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_title</key>
			<string>Workspace Trust Enabled</string>
			<key>pfm_description</key>
			<string>Controls whether Workspace Trust is enabled.</string>
			<key>pfm_description_reference</key>
			<string>Controls whether Workspace Trust is enabled.</string>
			<key>pfm_documentation_url</key>
			<string>https://cursor.com/docs/enterprise/deployment-patterns#workspacetrustenabled-policy</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Cursor</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
