<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_min</key>
	<string>1.99</string>
	<key>pfm_app_url</key>
	<string>https://code.visualstudio.com/</string>
	<key>pfm_description</key>
	<string>Preferences for bundle ID com.microsoft.VSCode were automatically generated from a sampled configuration profile.</string>
	<key>pfm_documentation_url</key>
	<string>https://code.visualstudio.com/docs/setup/enterprise</string>
	<key>pfm_domain</key>
	<string>com.microsoft.VSCode</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2025-07-11T12:05:49Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Preferences for bundle ID com.microsoft.VSCode were automatically generated from a sampled configuration profile.</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Visual Studio Code</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.microsoft.VSCode</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile.
During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.microsoft.VSCode</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs.
During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Enable using tools contributed by third-party extensions.</string>
			<key>pfm_name</key>
			<string>ChatAgentExtensionTools</string>
			<key>pfm_title</key>
			<string>Chat Agent Extension Tools</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Controls if agent mode is enabled in chat.</string>
			<key>pfm_name</key>
			<string>ChatAgentMode</string>
			<key>pfm_title</key>
			<string>Chat Agent Mode</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Enable integration with Model Context Protocol (MCP) servers.</string>
			<key>pfm_name</key>
			<string>ChatMCP</string>
			<key>pfm_title</key>
			<string>Chat MCP</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Enable reusable prompt and instruction files in chat.</string>
			<key>pfm_name</key>
			<string>ChatPromptFiles</string>
			<key>pfm_title</key>
			<string>Chat Prompt Files</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Enable auto-approval for agent mode tools.</string>
			<key>pfm_name</key>
			<string>ChatToolsAutoApprove</string>
			<key>pfm_title</key>
			<string>Chat Tools Auto Approve</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>default</string>
			<key>pfm_description</key>
			<string>Controls whether VS Code automatically updates when a new version is released.</string>
			<key>pfm_documentation_url</key>
			<string>https://code.visualstudio.com/docs/setup/enterprise#_configure-automatic-updates</string>
			<key>pfm_name</key>
			<string>UpdateMode</string>
			<key>pfm_range_list</key>
			<array>
				<string>none</string>
				<string>manual</string>
				<string>start</string>
				<string>default</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>None</string>
				<string>Manual</string>
				<string>Start</string>
				<string>Default</string>
			</array>
			<key>pfm_title</key>
			<string>Update Mode</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Controls which extensions can be installed. The value of this policy is a JSON string that contains the allowed extensions.</string>
			<key>pfm_documentation_url</key>
			<string>https://code.visualstudio.com/docs/setup/enterprise#_configure-allowed-extensions</string>
			<key>pfm_name</key>
			<string>AllowedExtensions</string>
			<key>pfm_title</key>
			<string>Allowed Extensions</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>{"microsoft": true, "github": true}</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configure the Marketplace service URL to connect to.</string>
			<key>pfm_name</key>
			<string>ExtensionGalleryServiceUrl</string>
			<key>pfm_note</key>
			<string>This undocumented property is not widely available and may be removed in the near future according to discussion on Visual Studio Code issue https://github.com/microsoft/vscode/issues/246420.</string>
			<key>pfm_title</key>
			<string>Extension Gallery Service URL</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Controls the level of telemetry data.</string>
			<key>pfm_documentation_url</key>
			<string>https://code.visualstudio.com/docs/setup/enterprise#_configure-telemetry-level</string>
			<key>pfm_name</key>
			<string>TelemetryLevel</string>
			<key>pfm_range_list</key>
			<array>
				<string>all</string>
				<string>error</string>
				<string>crash</string>
				<string>off</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>All</string>
				<string>Error</string>
				<string>Crash</string>
				<string>Off</string>
			</array>
			<key>pfm_title</key>
			<string>Telemetry Level</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Controls feedback mechanisms, such as the issue reporter and surveys.</string>
			<key>pfm_name</key>
			<string>EnableFeedback</string>
			<key>pfm_title</key>
			<string>Enable Feedback</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>user</string>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Visual Studio Code</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
