<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://sqwarq.com/detectx/</string>
	<key>pfm_description</key>
	<string>DetectX Swift settings</string>
	<key>pfm_documentation_url</key>
	<string>https://s3.amazonaws.com/sqwarq.com/AppCasts/DetectX_Swift_User_Guide.pdf</string>
	<key>pfm_domain</key>
	<string>com.sqwarq.DetectX-Swift</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2025-08-04T08:25:08Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures DetectX Swift settings</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>DetectX Swift</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_description_reference</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.sqwarq.DetectX-Swift</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the `TopLevel` value, with an additional appended component. This string must be unique within the profile.

During a profile replacement, the system updates payloads with the same `PayloadIdentifier` and `PayloadUUID` in the old and new profiles.</string>
			<key>pfm_description_reference</key>
			<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.sqwarq.DetectX-Swift</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_description_reference</key>
			<string>The payload type.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use `uuidgen` to generate UUIDs.

During a profile replacement, the system updates payloads with the same `PayloadIdentifier` and `PayloadUUID` in the old and new profiles.</string>
			<key>pfm_description_reference</key>
			<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>General</string>
				<string>Updates</string>
				<string>Search</string>
				<string>Folder Observer</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Folder Observer</key>
				<array>
					<string>folderObserver</string>
					<string>ignoreKeywords</string>
					<string>FobWhitelist</string>
					<string>ObserverTitle</string>
					<string>ObserverMessage</string>
					<string>ObserverButton</string>
					<string>ObserverIcon</string>
				</array>
				<key>General</key>
				<array>
					<string>BrandedText</string>
				</array>
				<key>Search</key>
				<array>
					<string>whitelist</string>
				</array>
				<key>Updates</key>
				<array>
					<string>SUAllowsAutomaticUpdates</string>
					<string>SUAutomaticallyUpdate</string>
					<string>SUEnableAutomaticChecks</string>
					<string>SUScheduledCheckInterval</string>
					<string>SUFeedURL</string>
					<string>VisualUpdates</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.04</string>
			<key>pfm_description</key>
			<string>Display organizational branding. Maximum of 25 characters in length - including spaces and punctuation. Requires DetectX Swift to be registered.</string>
			<key>pfm_description_reference</key>
			<string>When set to false, DetectX Swift will not automatically check for software updates.</string>
			<key>pfm_name</key>
			<string>BrandedText</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>YOUR ORG NAME HERE</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.04</string>
			<key>pfm_description</key>
			<string>Registered users can specify key words to be ignored by the Folder Observer action when changes are made to the LaunchDaemons and LaunchAgents folders. This allows you to stop the alert from being thrown when items whose file name contains the key word is added or removed from one of the Launch folders.</string>
			<key>pfm_description_reference</key>
			<string>If set to true, enables the ability to add an array of strings of desired key words to be ignored by Folder Observer.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<integer>1</integer>
							</array>
							<key>pfm_target</key>
							<string>folderObserver</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>folderObserver</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ignoreKeywords</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.04</string>
			<key>pfm_description</key>
			<string>Array of strings of key words to be ignored by Folder Observer.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<integer>1</integer>
							</array>
							<key>pfm_target</key>
							<string>folderObserver</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>folderObserver</string>
						</dict>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>ignoreKeywords</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>ignoreKeywords</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>FobWhitelist</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>Array of strings</string>
					<key>pfm_name</key>
					<string>FobWhitelistItem</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Fob Allowlist</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Folder Observer notifies users when changes are made to the LaunchDaemons and LaunchAgents folders.</string>
			<key>pfm_description_reference</key>
			<string>If set to an integer of 1, enables Folder Observer.</string>
			<key>pfm_name</key>
			<string>folderObserver</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Disable Folder Observer</string>
				<string>Enable Folder Observer</string>
			</array>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.03</string>
			<key>pfm_description</key>
			<string>Custom button text for the Folder Observer alert. Requires DetectX Swift to be registered.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<integer>1</integer>
							</array>
							<key>pfm_target</key>
							<string>folderObserver</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>folderObserver</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ObserverButton</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Folder Observer Button Text</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.03</string>
			<key>pfm_description</key>
			<string>Path to custom image for the Folder Observer alert. By default, shows the DetectX Swift icon. Requires DetectX Swift to be registered.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<integer>1</integer>
							</array>
							<key>pfm_target</key>
							<string>folderObserver</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>folderObserver</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ObserverIcon</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>/Applications/Utilities/DetectX Swift.app/Contents/Resources/AppIcon.icns</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.03</string>
			<key>pfm_description</key>
			<string>Custom message for the Folder Observer alert. Requires DetectX Swift to be registered.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<integer>1</integer>
							</array>
							<key>pfm_target</key>
							<string>folderObserver</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>folderObserver</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ObserverMessage</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Folder Observer Alert Message</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.03</string>
			<key>pfm_description</key>
			<string>Custom title for the Folder Observer alert. Requires DetectX Swift to be registered.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<integer>1</integer>
							</array>
							<key>pfm_target</key>
							<string>folderObserver</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>folderObserver</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>ObserverTitle</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>Folder Observer Alert Title</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.04</string>
			<key>pfm_description</key>
			<string>In the DetectX Swift GUI, display a visual button to indicate software updates are available.</string>
			<key>pfm_description_reference</key>
			<string>When set to an integer value of 0, DetectX Swift will not show the visual update button.</string>
			<key>pfm_name</key>
			<string>VisualUpdates</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Disable Visual Updates</string>
				<string>Enable Visual Updates</string>
			</array>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Allowlist of file paths that produce false positives in DetectX Swift. Can be full path or in users' home folders.</string>
			<key>pfm_name</key>
			<string>whitelist</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>Array of dictionaries.</string>
					<key>pfm_name</key>
					<string>WhitelistDictionary</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Paths of files to whitelist:
ex. /Library/Scripts/script.sh
ex. ~/Library/Preferences/preference.plist</string>
							<key>pfm_name</key>
							<string>path</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Allowlist</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Setting this to a non-existent URL will disable the ability for users to manually check for updates. Useful when you intend to use your own software distribution mechanism to deploy updates.</string>
			<key>pfm_documentation_url</key>
			<string>https://sparkle-project.org/documentation/customization/</string>
			<key>pfm_format</key>
			<string>^https://.*$</string>
			<key>pfm_name</key>
			<string>SUFeedURL</string>
			<key>pfm_title</key>
			<string>Sparkle Feed URL</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>https://127.0.0.1</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Controls automatic update checks.</string>
			<key>pfm_documentation_url</key>
			<string>https://sparkle-project.org/documentation/customization/</string>
			<key>pfm_name</key>
			<string>SUEnableAutomaticChecks</string>
			<key>pfm_title</key>
			<string>Enable Automatic Update Checks</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>86400</integer>
			<key>pfm_description</key>
			<string>Controls the automatic update check interval. The default is 1 day (86400 seconds). Setting to 0 disables updates.</string>
			<key>pfm_documentation_url</key>
			<string>https://sparkle-project.org/documentation/customization/</string>
			<key>pfm_name</key>
			<string>SUScheduledCheckInterval</string>
			<key>pfm_title</key>
			<string>Automatic Update Check Interval</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Controls the automatic update install prompt. When enabled, presents users with the option to allow automatic download and install of available updates. If disabled, disallows automatic updates and requires manual installation every time.</string>
			<key>pfm_documentation_url</key>
			<string>https://sparkle-project.org/documentation/customization/</string>
			<key>pfm_name</key>
			<string>SUAllowsAutomaticUpdates</string>
			<key>pfm_title</key>
			<string>Automatic Update Install Prompt</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Controls automatic silent updates. If enabled, users will not be informed about updates and updates will be silently installed when the app quits.</string>
			<key>pfm_documentation_url</key>
			<string>https://sparkle-project.org/documentation/customization/</string>
			<key>pfm_name</key>
			<string>SUAutomaticallyUpdate</string>
			<key>pfm_title</key>
			<string>Enable Automatic Silent Updates</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>DetectX Swift</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>2</integer>
</dict>
</plist>
