<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://github.com/Jigsaw24/Elevate24/tree/main</string>
	<key>pfm_description</key>
	<string>Monitoring Extension for Elevate24 by Jigsaw24</string>
	<key>pfm_documentation_url</key>
	<string>https://docs.jigsaw24.com/Elevate24/</string>
	<key>pfm_domain</key>
	<string>com.jigsaw24.Elevate24SecurityExtension</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_icon</key>
	<data>
	iVBORw0KGgoAAAANSUhEUgAAAEAAAABACAYAAACqaXHeAAAAAXNSR0IArs4c6QAAAJBl
	WElmTU0AKgAAAAgABgEGAAMAAAABAAIAAAESAAMAAAABAAEAAAEaAAUAAAABAAAAVgEb
	AAUAAAABAAAAXgEoAAMAAAABAAIAAIdpAAQAAAABAAAAZgAAAAAAAACQAAAAAQAAAJAA
	AAABAAOgAQADAAAAAQABAACgAgAEAAAAAQAAAECgAwAEAAAAAQAAAEAAAAAAHAkeAQAA
	AAlwSFlzAAAWJQAAFiUBSVIk8AAAA0ppVFh0WE1MOmNvbS5hZG9iZS54bXAAAAAAADx4
	OnhtcG1ldGEgeG1sbnM6eD0iYWRvYmU6bnM6bWV0YS8iIHg6eG1wdGs9IlhNUCBDb3Jl
	IDYuMC4wIj4KICAgPHJkZjpSREYgeG1sbnM6cmRmPSJodHRwOi8vd3d3LnczLm9yZy8x
	OTk5LzAyLzIyLXJkZi1zeW50YXgtbnMjIj4KICAgICAgPHJkZjpEZXNjcmlwdGlvbiBy
	ZGY6YWJvdXQ9IiIKICAgICAgICAgICAgeG1sbnM6dGlmZj0iaHR0cDovL25zLmFkb2Jl
	LmNvbS90aWZmLzEuMC8iCiAgICAgICAgICAgIHhtbG5zOmV4aWY9Imh0dHA6Ly9ucy5h
	ZG9iZS5jb20vZXhpZi8xLjAvIj4KICAgICAgICAgPHRpZmY6Q29tcHJlc3Npb24+MTwv
	dGlmZjpDb21wcmVzc2lvbj4KICAgICAgICAgPHRpZmY6UmVzb2x1dGlvblVuaXQ+Mjwv
	dGlmZjpSZXNvbHV0aW9uVW5pdD4KICAgICAgICAgPHRpZmY6WFJlc29sdXRpb24+MTQ0
	PC90aWZmOlhSZXNvbHV0aW9uPgogICAgICAgICA8dGlmZjpZUmVzb2x1dGlvbj4xNDQ8
	L3RpZmY6WVJlc29sdXRpb24+CiAgICAgICAgIDx0aWZmOk9yaWVudGF0aW9uPjE8L3Rp
	ZmY6T3JpZW50YXRpb24+CiAgICAgICAgIDx0aWZmOlBob3RvbWV0cmljSW50ZXJwcmV0
	YXRpb24+MjwvdGlmZjpQaG90b21ldHJpY0ludGVycHJldGF0aW9uPgogICAgICAgICA8
	ZXhpZjpQaXhlbFhEaW1lbnNpb24+MTAyNDwvZXhpZjpQaXhlbFhEaW1lbnNpb24+CiAg
	ICAgICAgIDxleGlmOkNvbG9yU3BhY2U+MTwvZXhpZjpDb2xvclNwYWNlPgogICAgICAg
	ICA8ZXhpZjpQaXhlbFlEaW1lbnNpb24+MTAyNDwvZXhpZjpQaXhlbFlEaW1lbnNpb24+
	CiAgICAgIDwvcmRmOkRlc2NyaXB0aW9uPgogICA8L3JkZjpSREY+CjwveDp4bXBtZXRh
	PgpQr8ccAAAO2ElEQVR4AeVcCXSU1RX+ZslkIWxhSVhFQJawGAwECYTEEEDbgqhwaA9g
	tYpQUWsVtW5dsMeqKK24HItoj6eiVGi1SGUJIQQIAWWTrRrIgiSUQAKEGJLM2vu9ycNJ
	mMnMJBN6pBf//PP/89599373vvveu++NhhkzZphWrVrlSEtL62B1OJ50wTAFQF+XC2GA
	Sz5qMugP35M7ZafM7rvBAIc8HJfHDUaX4/nc3NyTorNZaTVm/Phh8sWmsLCwrg6HA06n
	83uiZHBiGo1GGE0m2G22GgHmlrxt23IMiRkZ7S111nyTyUTl61wuV5jBYDAGx/p7U5qW
	tQkQ4WJkq8FhHmC01NmeqLd8nXwZfhUrTyvRsOEup7PObA6zuEz23xnhck2h29PyLPH/
	QBIVLA6HnapOMcPg6i3KQyx/RaKcUZoxmozSHq/6JqV9p8spsUfuVyb+GERnRscYs0RK
	s/tz69k+PDwcZrMEH7sD1RcvovJsFc5dqEJF1UWldKe2UejYri06yNWmTRTCzGYFhNVm
	A72zlUgNEQIAgWDX4D00RMvyovAmibxbsrYLewm8QuPT0hE/aiA6d+qEqKhIGagMuFhz
	ERUVZ1FUfFzKbrokxNCERHTt0ll5R10dQ1TIyUAPCCnXyIgI0HIXqr5Fu7bR6r548e9x
	4+gk9OjRAx1jYhAVGQkJvJe6AD3QJnVqampw/vx5lJSU4ODBQ9iYmYmP//F3Jd+41HSp
	Y0ZtXW1I5TWMSRlfLSBEiYnoAs1CgwpYRCGzuO7mzI3oO3AIRiYMR2FxMSrF1XflbkXH
	jh2DFpyAHD12DJkCxMJHfyX1bUhNz2DAFpCtlwAMmrFHhRaP9xQmuk0bnCw7o5R/4cWX
	sHNbNu6cMwu7d+WhbXQUamvdVqsfbTyab/iRvHgxEPIeKZ4yfNgwPPrII+IVRVj62mvI
	2bwJ/84vQJuoKFWmIYfgn1oEAPs5ld+0YT2Sk0bi8OEjeOLxx9ClS5dL0dzpkLlHfbTn
	TOxS5Pciq44dupwnGOw+Dz7wAPLz8zHth5OQtXEDIsMjVAxhueaSxIDgiQ3S3RngqPzy
	5e9g9pzZCLdY3IFPpptaKDWsNVNADQgl1MPjddddhzffeAMpKSniZXMwMmkMwsItEsJl
	KA9eFRX+g6pGxRjAHGLZnM1ZyM7Oxj33/EwpTyEvt3DzreMpmJrHC+Bsg+DPmT0bsqDB
	idISOCSANncQC7oLsHGO53nbdmDv3n1IS0tT1iYwFLK1iW2wLQKRnJyM99/7Cz7fuQMR
	4n3NcbSgJKZ16fZ523Kwd9/nGDEiQQni6aqtDQD5e3pZTP3oQlBMMsMMlgKuwQY4frvd
	fgtGJLiVvxJWb0opu13N6ZUhKirOCQjfxZ+m6unvAgKAyutoz4CXlpaq3PB/rTyV0N7A
	qfb4sckoLz8rXmoSQAKLPQEBYLGEofhEKX56192YI9G+NYlg8wqWsrfmYcH98zFz+u3I
	3boFFnNYQHExIADMJjOOHTmIx2WMt0iw8R7tgxXZS3lRXMeToEGwVaNdu3a4b+69irHT
	KUv8ALzALwAREeFqhvfKkiWIHzy41VxfKSxBdq3M/ffv2a2AINDBUHV1Nbp3747XXn8d
	uRKoI2QV6s+Z/ALg7kvhmH7HHUqWoC0TgAbaow4f+BIL75iOD+4eJUvmCjWsSvYmAA4N
	i9x+223qRY0svf0h0CQAXMfnZG3FCy8+h969e7eK9Qkog+n5c+fwyt3TMC+lB0ZIYN+x
	9HnVhw3ynT8ltPo6KNMLXn31VTU/4Oy0KS9oEgAOKYAVkydNVG20hvV1FH/3Ty8jZm8x
	4mPCcX1iPCKkyx34dHWz283IyKiv615YqQcvf3wCQDQrzp7F1FtvA+ffJC2sFz7NeqX7
	eObaNfhi0fNInhqPHuYTaO/8Bn2n9cWpX87AyfyvQC8Itiv069cPsueBowVFavLmS0Cf
	ADDa7//ic0yamCFpqjbK/UMJAJUnyEUFx/DmlFsxMaM3ehmPo4MsbMKMDkQYanHNEODA
	ormoqf7WDUJTvuyhIZfd7L6TJ0/Gf04UqxSbr6o+AeCUlzR8+DB1D6X7635fKwmPpY89
	hKT+QP9oB7pEOGExSkyQ0cDoPIMOnSR1dmQ79r77upIh0NWelnWY5BI06Xf6Wd99AmCv
	T0b26tVLlw35fcXbb8H68TpcP3QgYsNOI0I2qupTB3K3wGgrRLeEeFifeBJf50iuUL4M
	pCtoT2UOgcTMki/yCgAtwOwtE5g6laWZ+mIU6Hs95O3K3Y71v3gEqdNGoKelCu0i42Ay
	x8BgigHU1RFGcxzCXNXoM70/ip6eiLMnSwKKB1rWDh06ICNjIsorZEjVyDYS1DsAsqpi
	Lq/vtX1UWop1NNNG9YN61K7/jeQKnx6XghvjgLgz+xBdeRLOihOwlZfA2uA6AfuZ4zBf
	OIbYSiDvmbmovVitQGhybKuXKkIStP369UXh0a99LtXN3jTgpgXz9p0kdc3kR6hI98NT
	J0uRetdMxF/bG+0MVtiNBjilg/vq46wXeWMYIk6fxrcyQYqIkqAcgFAcxjt37qxK0oCy
	93Kpi+nqPgAwqE0Llbf34TqaQTB3PVFJSh4LXqRAFNFtDNIf5O7PIwkay0QJWCRf4HoF
	gBWcatzwVY0lmk96/A+WA8GiUv6U9+Trz35eASB6nSSdfVECoUbSk2lLPpOf9oTm8iEP
	f6RBYjAn+arjAwCn2qvjTJA7NpwUhYK08kxt7969WwXYQL2BoFmtVkyYMEH160DqsUxF
	ebkS3e3Rl2vhFQBW5EZlUVGxGkMJAIXXqF7OJrA32grc/po1a1ZglRqVOnXqVKM3vh+5
	IVNQUIie1/RROQxR4LLCPgBwqV3aHNmopLDt27d3R6vL61/GsKkXtCJBSEpKwl/ff1+l
	tm++5Qcy56iRbiHMG3s2X0l5TsXX/WuteM0exMbG+k3IaKArKytlW20jbhg5SqXITO4T
	QQ1E9DoPYAluUZO4UUnixkMo6cczZ2Lu3Puwft065Vm1dTbUSXfzvGrrrLDInJ7KL3/n
	HSQm3qAA8RdDNAClpaVK5KhI2fr0QT4B0H3swMGDqmpL3V+3Tz7kzf2F3/zm1/LahZpa
	twcYxAs8r8jICHwlq7l7BShuhARKWtZDhw6pKnwmX2/kEwBucQ8dkShb1JvUaEAmGllv
	jIJ5RwsSBM7Vt2zZgi925oHb6txt0sT2HFKmpLQczz77TFC5SE6AGDDXb9gAmMNhk9S5
	sPNKPgHgkpKHEz6RHN0x2aImhQoA8tLxIDU1FUuW/BGbN21EtOz4MgXHdpiG35a9GVlr
	P0JvWZARMH+uT76aioqK8LeVKzF6VKIC0tdUyCcAZKS7QaZ4AUm7lnoI4Z958+6TxMut
	yBegzWI9bn1vXPcZFr/8CtLT0wPq943FycrKUq+Y0SZwQXsAa/NYSkpaOhYufExcsVQB
	EEovIKAEOUoUXvzSSygpLlQHLcpOl+NHU6dhvgATDOnNkLKyU1iwYAGGDBuuTqv46v/k
	3aQHsACDlfiCHFX5mI8h7Qbkp+PBgAEDsGbNGmRnZeLQ/j1Y/OIfEB0drQAK1PP0SPXJ
	J/8kazV8M53WVH2/APBMDo+lPPTQg8g/evSSwKqFEP3RfXvKlCl48qmn8NGqVRg0aFDQ
	/Z5dp6ysDPPnz0fCDYmos9r8xg2/AFBHun3Xnn2wePHLsjVuV0xD2RV0G7w/t2gRZkyf
	zo9+hVeFPP5w7bJ8+XL1JkJOj6istq/OX18vIAB4IGlY/EAsf3sZPvxwpaoaagDopuTp
	TsV7aBXgx7Sb0vHWn5fhjbeWIXHUaNhkFGsq+Gm2AQFA4biqumnCRNx55xzs2LFDMedQ
	GUpqqq/6akcbgjnMNZ+tV0MmEzpyFtjn5MeTV0AAsAKFq5PJxZixKRg7dqwciDqsrBVq
	EDyFC+Sz9hijKN2zezf2G5jkPKHR5GPm04hpwACwHs/zmmRUGJGYhKFDh+LwkSMKBA5l
	2hKN+LfKI9vS7VVVVbnbEH05c+SiSi2sAmw5KADoBXY5Zd1GhqeExFEYOmQI8vLyVHfg
	d3riFGDbzSrGNtgWLb9nzx78ZNZsDIwfIuuJOnkfPMugACB7Nwg2WaJGY/SYseqg0ooV
	K9TxOD2mBy+G/xq0OJVnG/y8evVqjBw5Unkkp82y3KF0/hk1KhE0AKxPEBxOGQ5lmpl6
	0wTMlpXa/TLzKigoqJ84hW7CRKW11an88ePH8fDDD6t9v0RZ58fFxkmwM8kegu/pbiOd
	Gzw2CwANgvzWALUSGNMzJmHZex+if//+WLp0KZiIMAk4upzur7zrzw2kqH/Q32ul+ZpK
	8zotKXGO8X369FFtJI8bJwtpdgUzzBL0aJTmUEgOS3MObpHgyG2r7XIyY+DgeCRcPxz7
	vjwgfdOK/bt3IUZOiTcmDYYv4ZmPLCwsBBc2nNuTOMPjxifPKpp54lzAaabuil9IACAn
	Ma6ybqQIx8hcIQce4mK74tz5Sjzw83lyXH40unXrBm5XccdGD19KCvlDqzOHR+9hJofJ
	jA2ynl8pS1oSFzZMzXF6y7r0iqYWOapSAH8EgBQ5Lm9s0XF5z3ZoVVqU/zg54fi8U47L
	a5ogBxe4d88dG87dWZaTLGZvC8TamRs36qKyR2jBaDmEzQWZVRSntak4Td4Sq3/XgLBy
	/14ATJox6de8juTJsdFnAhIeZlGK1sgvQ7hRWSBpcXdzDQv3kOxtrJw0Zw6PwDCT4x7b
	3Su6UFi8YYtwMVI52Jjuj40KtPiRvK12m8QHwVeiddeusYiL66YU1GizbebtdfCzSv+m
	srxMRga4FovhjYEyOAEoESEHS+MuubdOU9KIUqheDM4o5b/LSZo3yYnPK0BKVwG+kh1q
	PX9OKrrLmfMrR4Ta23WFJLAxkEq0Wmc0OGwvyG9pL0hwCZfG+dMsusbVSqKbyyrGtjCv
	YXIaf2uUpe1pcc+bpQtUy7jKn86yG1yNICi3Vz+ZlXjjchmm5uZmf21Mk5+Q78jJyTM6
	HQPsdtsyCVZlAsDVBoIKeNLnz9pt9g9MLufAndtzPuX/OuC/Xw9oVWntE6UAAAAASUVO
	RK5CYII=
	</data>
	<key>pfm_interaction</key>
	<string>exclusive</string>
	<key>pfm_last_modified</key>
	<date>2025-11-25T09:52:16Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Elevate24 Security Logging</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Jigsaw24 Elevate Security Logs</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_description_reference</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.jigsaw24.Elevate24SecurityExtension</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the `TopLevel` value, with an additional appended component. This string must be unique within the profile.

During a profile replacement, the system updates payloads with the same `PayloadIdentifier` and `PayloadUUID` in the old and new profiles.</string>
			<key>pfm_description_reference</key>
			<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.jigsaw24.Elevate24SecurityExtension</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_description_reference</key>
			<string>The payload type.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use `uuidgen` to generate UUIDs.

During a profile replacement, the system updates payloads with the same `PayloadIdentifier` and `PayloadUUID` in the old and new profiles.</string>
			<key>pfm_description_reference</key>
			<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>General</string>
				<string>Event Types</string>
				<string>Filter Rules</string>
				<string>Authorisation Rules</string>
				<string>Upload to Sentinel</string>
				<string>Upload to Other</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Authorisation Rules</key>
				<array>
					<string>FileOperationRules</string>
					<string>ExecuteProcessRules</string>
				</array>
				<key>Event Types</key>
				<array>
					<string>logAllEventTypes</string>
					<string>EventsToLog</string>
				</array>
				<key>Filter Rules</key>
				<array>
					<string>filterRules</string>
				</array>
				<key>General</key>
				<array>
					<string>DefaultFilterRules</string>
					<string>SelfProtectionRules</string>
					<string>DisableAll</string>
					<string>EnableArchive</string>
					<string>MaxArchiveAge</string>
					<string>UploadOnHotspot</string>
				</array>
				<key>Upload to Other</key>
				<array>
					<string>siemUploadURL</string>
					<string>siemUploadHeaders</string>
					<string>siemNewLineSeperated</string>
					<string>MaxDataUploadSize</string>
				</array>
				<key>Upload to Sentinel</key>
				<array>
					<string>SentinelUploadURL</string>
					<string>SentinelTennantId</string>
					<string>SentinelClientId</string>
					<string>SentinelClientSecret</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Events will be uploaded to the supplied url via HTTP POST. Note that events can be uploaded to the supplied URL or to sentinel not both.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_target</key>
							<string>SentinelUploadURL</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>siemUploadURL</string>
			<key>pfm_title</key>
			<string>Upload URL</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Headers to be included in the HTTP request.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.jigsaw24.com/Elevate24/Documentation/Elevate24%20Monitoring/2%20Elevate24%20Session%20Monitoring%20-%20General.html#monitoring-general-settings</string>
			<key>pfm_name</key>
			<string>siemUploadHeaders</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>Headers to be included in the HTTP request.</string>
					<key>pfm_name</key>
					<string>headers</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>Header</string>
							<key>pfm_title</key>
							<string>Header</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>Value</string>
							<key>pfm_title</key>
							<string>Value</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Request Headers</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Request Headers</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>By default events are uploaded in JSON format as an array of events. Some systems require events to be seperated with a new line.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.jigsaw24.com/Elevate24/Documentation/Elevate24%20Reporting/3%20Elevate24%20-%20Security%20Monitoring%20Reporting.html#elevate24-security-monitoring-reporting-configuration-keys</string>
			<key>pfm_name</key>
			<string>siemNewLineSeperated</string>
			<key>pfm_title</key>
			<string>Seperate Events with New Line</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Tennant ID</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.jigsaw24.com/Elevate24/Documentation/Elevate24%20Reporting/3%20Elevate24%20-%20Security%20Monitoring%20Reporting.html#elevate24-security-monitoring-reporting-configuration-keys</string>
			<key>pfm_name</key>
			<string>SentinelTennantId</string>
			<key>pfm_title</key>
			<string>Sentinel Tennant ID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Client ID</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.jigsaw24.com/Elevate24/Documentation/Elevate24%20Reporting/3%20Elevate24%20-%20Security%20Monitoring%20Reporting.html#elevate24-security-monitoring-reporting-configuration-keys</string>
			<key>pfm_name</key>
			<string>SentinelClientId</string>
			<key>pfm_title</key>
			<string>Sentinel Client ID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Client Secret</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.jigsaw24.com/Elevate24/Documentation/Elevate24%20Reporting/3%20Elevate24%20-%20Security%20Monitoring%20Reporting.html#elevate24-security-monitoring-reporting-configuration-keys</string>
			<key>pfm_name</key>
			<string>SentinelClientSecret</string>
			<key>pfm_title</key>
			<string>Sentinel Client Secret</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>URL to upload events to Microsoft Sentinel</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.jigsaw24.com/Elevate24/Documentation/Elevate24%20Reporting/3%20Elevate24%20-%20Security%20Monitoring%20Reporting.html#elevate24-security-monitoring-reporting-configuration-keys</string>
			<key>pfm_name</key>
			<string>SentinelUploadURL</string>
			<key>pfm_title</key>
			<string>Sentinel Upload URL</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1000000</integer>
			<key>pfm_description</key>
			<string>Max size of single HTTP request uploading data. (Uncompressed size in bytes default size is 1,000,000 bytes)</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.jigsaw24.com/Elevate24/Documentation/Elevate24%20Reporting/3%20Elevate24%20-%20Security%20Monitoring%20Reporting.html#elevate24-security-monitoring-reporting-configuration-keys</string>
			<key>pfm_name</key>
			<string>MaxDataUploadSize</string>
			<key>pfm_title</key>
			<string>Max HTTP Request Size</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_placeholder</key>
			<string>1000000</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Deploys default rules to discard some events which can be considered noise.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.jigsaw24.com/Elevate24/Documentation/Elevate24%20Monitoring/4%20Elevate24%20Session%20Monitoring%20-%20Filter%20Rules.html#monitoring-filter-rules</string>
			<key>pfm_name</key>
			<string>DefaultFilterRules</string>
			<key>pfm_title</key>
			<string>Add Default Filter Rules</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Deploys authorisation rules to attempt to stop the user making changes to Elevate24 database.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.jigsaw24.com/Elevate24/Documentation/Elevate24%20Monitoring/2%20Elevate24%20Session%20Monitoring%20-%20General.html#monitoring-general-settings</string>
			<key>pfm_name</key>
			<string>SelfProtectionRules</string>
			<key>pfm_title</key>
			<string>Add Self Protection Auth Rules</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Stops all blocking/logging operations. Effectively a switch to disable this tool.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.jigsaw24.com/Elevate24/Documentation/Elevate24%20Monitoring/2%20Elevate24%20Session%20Monitoring%20-%20General.html#monitoring-general-settings</string>
			<key>pfm_name</key>
			<string>DisableAll</string>
			<key>pfm_title</key>
			<string>Disable all operations performed by the daemon</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Enables the local retention of Events after they have been uploaded to Jigsaw24/SIEM.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.jigsaw24.com/Elevate24/Documentation/Elevate24%20Monitoring/2%20Elevate24%20Session%20Monitoring%20-%20General.html#monitoring-general-settings</string>
			<key>pfm_name</key>
			<string>EnableArchive</string>
			<key>pfm_title</key>
			<string>Enable Local Retention of Events</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>7</integer>
			<key>pfm_description</key>
			<string>Sets maximum age of events retained locally.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.jigsaw24.com/Elevate24/Documentation/Elevate24%20Monitoring/2%20Elevate24%20Session%20Monitoring%20-%20General.html#monitoring-general-settings</string>
			<key>pfm_name</key>
			<string>MaxArchiveAge</string>
			<key>pfm_title</key>
			<string>Maximum Age of Retained Events (Days)</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_placeholder</key>
			<string>7</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Upload Events when connected to iPhone personal hotspot.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.jigsaw24.com/Elevate24/Documentation/Elevate24%20Monitoring/2%20Elevate24%20Session%20Monitoring%20-%20General.html#monitoring-general-settings</string>
			<key>pfm_name</key>
			<string>UploadOnHotspot</string>
			<key>pfm_title</key>
			<string>Allow Upload Data on Hotspot connection</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Rules to restrict file operations. Allow rules can be used in conjunction with block rules to allow a process to execute under the specified conditions.
			
File open operations can be restricted to read only access where required.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.jigsaw24.com/Elevate24/Documentation/Elevate24%20Monitoring/5%20Elevate24%20Session%20Monitoring%20-%20Authorisation%20Rules.html#monitoring-authorisation-rules</string>
			<key>pfm_name</key>
			<string>FileOperationRules</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>FileOperationRules</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>fileOperation</string>
							<key>pfm_range_list</key>
							<array>
								<string>file:open</string>
								<string>file:unlink</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>File Open</string>
								<string>File Delete</string>
							</array>
							<key>pfm_title</key>
							<string>File Operation</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<string>block</string>
							<key>pfm_name</key>
							<string>action</string>
							<key>pfm_range_list</key>
							<array>
								<string>allow</string>
								<string>block</string>
								<string>readOnly</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Allow</string>
								<string>Block</string>
								<string>Read Only (File Open Only)</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>fileTargetPath</string>
							<key>pfm_title</key>
							<string>File Target Path</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>signingID</string>
							<key>pfm_title</key>
							<string>Signing ID</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>username</string>
							<key>pfm_title</key>
							<string>Username</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>alwaysActive</string>
							<key>pfm_title</key>
							<string>Always Active</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>File Operation Rules</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>File Operation Rules</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<array>
				<dict/>
			</array>
			<key>pfm_description</key>
			<string>Rules to restrict execution of processes. Allow rules can be used in conjunction with block rules to allow a process to execute under the specified conditions.
			
Multiple arguments can be specified by seperating them with a comma.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.jigsaw24.com/Elevate24/Documentation/Elevate24%20Monitoring/5%20Elevate24%20Session%20Monitoring%20-%20Authorisation%20Rules.html#monitoring-authorisation-rules</string>
			<key>pfm_name</key>
			<string>ExecuteProcessRules</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>ExecuteProcessRules</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<string>block</string>
							<key>pfm_name</key>
							<string>action</string>
							<key>pfm_range_list</key>
							<array>
								<string>allow</string>
								<string>block</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Allow</string>
								<string>Block</string>
							</array>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>processPath</string>
							<key>pfm_title</key>
							<string>Process Path</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>signingID</string>
							<key>pfm_title</key>
							<string>Signing ID</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>matchingArgumentsContaining</string>
							<key>pfm_title</key>
							<string>Match Arguments Containing</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>alwaysActive</string>
							<key>pfm_title</key>
							<string>Always Active</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Execute Process Rules</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Execute Process Rules</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Set all event types to be logged. Use with caution, as this could produce a lot of data entries.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.jigsaw24.com/Elevate24/Documentation/Elevate24%20Monitoring/4%20Elevate24%20Session%20Monitoring%20-%20Filter%20Rules.html#monitoring-filter-rules</string>
			<key>pfm_name</key>
			<string>logAllEventTypes</string>
			<key>pfm_title</key>
			<string>Log All Event Types</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>logAllEvents</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_default</key>
			<array>
				<dict/>
			</array>
			<key>pfm_description</key>
			<string>Define which event types to log.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.jigsaw24.com/Elevate24/Documentation/Elevate24%20Monitoring/4%20Elevate24%20Session%20Monitoring%20-%20Filter%20Rules.html#monitoring-filter-rules</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>logAllEvents</string>
						</dict>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>logAllEvents</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>EventsToLog</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>EventType</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<string>All</string>
							<key>pfm_name</key>
							<string>eventType</string>
							<key>pfm_range_list</key>
							<array>
								<string>File:Write</string>
								<string>File:Unlink</string>
								<string>File:Clone</string>
								<string>File:CopyFile</string>
								<string>File:Create</string>
								<string>File:Rename</string>
								<string>User:Create</string>
								<string>User:Delete</string>
								<string>Profile:Add</string>
								<string>Profile:Remove</string>
								<string>LaunchItem:Add</string>
								<string>LaunchItem:Remove</string>
								<string>Sudo</string>
								<string>Process:Exec</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>File Write</string>
								<string>File Delete</string>
								<string>File Clone</string>
								<string>File Copy</string>
								<string>File Create</string>
								<string>File Rename</string>
								<string>User Create</string>
								<string>User Delete</string>
								<string>Profile Add</string>
								<string>Profile Remove</string>
								<string>Launch Item Add</string>
								<string>Launch Item Remove</string>
								<string>Sudo Command</string>
								<string>Execute Process</string>
							</array>
							<key>pfm_title</key>
							<string>Event Type</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Event Type</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Event Types to Log</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<array>
				<dict/>
			</array>
			<key>pfm_description</key>
			<string>Define rules to not store events matching the following rules.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.jigsaw24.com/Elevate24/Documentation/Elevate24%20Monitoring/4%20Elevate24%20Session%20Monitoring%20-%20Filter%20Rules.html#monitoring-filter-rules</string>
			<key>pfm_name</key>
			<string>filterRules</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>filterRules</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>eventType</string>
							<key>pfm_range_list</key>
							<array>
								<string>All</string>
								<string>File:Write</string>
								<string>File:Unlink</string>
								<string>File:Clone</string>
								<string>File:CopyFile</string>
								<string>File:Create</string>
								<string>File:Rename</string>
								<string>User:Create</string>
								<string>User:Delete</string>
								<string>Profile:Add</string>
								<string>Profile:Remove</string>
								<string>LaunchItem:Add</string>
								<string>LaunchItem:Remove</string>
								<string>Sudo</string>
								<string>Process:Exec</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>All</string>
								<string>File Write</string>
								<string>File Delete</string>
								<string>File Clone</string>
								<string>File Copy</string>
								<string>File Create</string>
								<string>File Rename</string>
								<string>User Create</string>
								<string>User Delete</string>
								<string>Profile Add</string>
								<string>Profile Remove</string>
								<string>Launch Item Add</string>
								<string>Launch Item Remove</string>
								<string>Sudo Command</string>
								<string>Execute Process</string>
							</array>
							<key>pfm_title</key>
							<string>Event Type</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>path</string>
							<key>pfm_title</key>
							<string>File Path</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>signingId</string>
							<key>pfm_title</key>
							<string>Signing ID</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Filter Rules</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Filter Rules</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>Elevate24 Security Logging</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>4</integer>
</dict>
</plist>
