<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://www.parallels.com/</string>
	<key>pfm_description</key>
	<string>Parallels Desktop Settings</string>
	<key>pfm_documentation_url</key>
	<string>https://docs.parallels.com/parallels-desktop-enterprise-administrators-guide/mass-deployment-of-parallels-desktop-and-virtual-machines/deploying-parallels-desktop-via-mdm-app-catalogs-using-configuration-profiles</string>
	<key>pfm_domain</key>
	<string>com.parallels.desktop.managedprefs</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2025-01-08T13:34:39Z</date>
	<key>pfm_interaction</key>
	<string>exclusive</string>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Parallels Desktop Managed Preferences </string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on
				the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Parallels Desktop for Mac</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the
				Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.parallels.desktop.managedprefs</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually
				the same as the TopLevel value, with an additional appended component. This
				string must be unique within the profile. During a profile replacement, the
				system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in
				the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.parallels.desktop.managedprefs</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is
				unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate
				UUIDs. During a profile replacement, the system updates payloads with the same
				'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>
				^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Parallels International GmBH</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>SSO</string>
			<key>pfm_description</key>
			<string>Select a method for activating Parallels Desktop for Mac</string>
			<key>pfm_documentation_url</key>
            <string>https://docs.parallels.com/parallels-desktop-enterprise-administrators-guide/mass-deployment-of-parallels-desktop-and-virtual-machines/deploying-parallels-desktop-via-mdm-app-catalogs-using-configuration-profiles</string>
			<key>pfm_name</key>
			<string>ActivationExperience</string>
			<key>pfm_range_list</key>
			<array>
				<string>License Key</string>
				<string>SSO</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Activation Experience</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>License Key</string>
							</array>
							<key>pfm_target</key>
							<string>ActivationExperience</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>Enter your 30-character license key:</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>License Key</string>
							</array>
							<key>pfm_target</key>
							<string>ActivationExperience</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>LicenseKey</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.parallels.com/parallels-desktop-licensing-guide/managing-subscriptions-licences-and-seats/viewing-subscriptions-and-subscription-details</string>
			<key>pfm_format</key>
            <string>^[0-9A-Za-z]{6}-[0-9A-Za-z]{6}-[0-9A-Za-z]{6}-[0-9A-Za-z]{6}-[0-9A-Za-z]{6}$</string>
			<key>pfm_value_placeholder</key>
			<string>XXXXXX-XXXXXX-XXXXXX-XXXXXX-XXXXXX</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>License Key</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Parallels Desktop for Mac</string>
	<key>pfm_unique</key>
	<true />
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
