<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://apps.apple.com/ca/app/okta-verify/id490179405</string>
	<key>pfm_description</key>
	<string>Use this section to define settings for Okta Verify</string>
	<key>pfm_documentation_url</key>
	<string>https://help.okta.com/oie/en-us/content/topics/identity-engine/devices/managed-app-configs-macos.htm</string>
	<key>pfm_domain</key>
	<string>com.okta.mobile</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_icon</key>
	<data>iVBORw0KGgoAAAANSUhEUgAAAEAAAABACAYAAACqaXHeAAAJhUlEQVR4Ae3BCXBU5QEH8P/3fe/aK9ndQAjEZDfEpIAgCYpArYICBSHQiiDexQMdHavt9NBWZ+w4OvWYIl4dhFIRxxG1lTqOYEuLAQLlUggV0qAS0gSyScix2fO9t+997XSWGcpg3r7NBplpfj8MGTJkyJAhQ/5vEZwHpZXT/X164Ook5GnEMaJKN8ygKLOyREyj+A/ZKSGl6sdlSWpFoqNe4sk9Dt68ta3pkxAGGcEgmTz/SV/LyVM3q4Z8S1hlk01KJdhAOQynoB3yiPp7fp9n/eGtT53AICDIscrxiwo6EXy8V5fv5pR4kAsmV11IrFfiXzzR1fJRG3KIIEeW3r9C2Lbry4e6Nc/jGpgPg0CAmfQriZekZMuvWhveTyAHCHLAP3peMCZWv61SPhXnATPQ6Cdf3dbZ+M5+DBDDAI3+9i9quozCTSpIJc4TTjFMI/m3FQWvbI+c3HkAA8AwAAVjl/+gPenaoHPqwnlmgopRjS4sGFFNte79tZxzZIMhS8PHP3RHD/f93gAYvikESHJpur9wEol37K5FFhiyUFJ9X02H7t1gAAwXgLgpzhh50cTeaGjvHtjEYNPwMUsD3bxos86pCxcKAqimdK3PV7wl0XX4BGygsKGy6rtCmJdvUE1WgAsOVzVdoLBJgA19vOJhjWIqcsXkAAfACAYkZUQl3lsTaXrr77BJQIbyhk3J69Lcj2EAJEqS+VJqMzN7/mqo0Xq/TwnLEkNrqM8pSu5xpuidFUs5FsRTZh4yJFEe8dD2uV2N63YhCwIyxIdNe1QH8yELjBtxJ7Rnq4Pel7d/9HQP0jrxP/YCWHfZgl8qTce0e8MaHjcEaTj6Y5rRfCla03l43S6kecuXlImOwh93fv7qQ8gAQQYmzX/Sf+CLxHHOiAc2Oai2x5NqvrWj8b2vYEPx+CVFfaRkTSSl1OAcJMojXh6a23Hk9V1IGzF+eaA94amFIJcWK5hwov7XR2CBIQPcPeGuqClfD5sUM/lxsvvTubHmTZ2wKdJxJKr1NG9w5F9clKLS5TiDwHnUK0VqOj9fXYc0b/mSshgr2pZicgCEEEVIpuKh3R/DAkUGkoZ8M2xyUHVPMlx/PdprVWTLTCKR4BLOIAuIFCun5nTWv7IdafnlNwV6UbI1ycVSpCUNecnESVcyWKCwUFIx3d+nssthAzON+DAhdAdCf0siW8pUKpXfshpuz51IE8BjoxzxmuaDa3YhzR28oSwplWyHpARxhohOR4XCRRNggcJCNFV6tUmpDBsUM/ZcS/1bR5EtsZJi+OTfaSzvHqTJAiLFctecpr0rtyMtv/ymQJQFtqoQS3E2AiSIbxYsUFhIENdU2CBRkqyuGPYSzjJv8TInMiFfQaWy2a/B7bkTaQJ4bJQSn998cPVOpHmCi8uS0kXbIClBfA0VyjRYEGCBKMOqwU1kKl9Kba7b9HQP0gRBQN6Y+1/d8g/33bTsR1vMjoYbEftzAucijqUonLJWY55lSJMFRIqEruua9q3eibT80UsDYVK8FZAC6AeRvFWwQGFBM8wgbGBG9xacYdFtjxT1aJ4HdEpkU3HWiMUVG1G0wIGzyZdTKTj9Nbg9y5AmgMdGKbH5zQdW70SaO3hDWVIu2QZJCcKCbphlsEBhQZJZGWwwtOghnOEP658JuST9C6TpLG8OlIs/hGuuA6dJ4ykKp63VBP89SFOYGSlxxeY27XtxB06TioQoC2xVIQWQAYNzMmPZywH0g8JCIqZRZMrk8OYrYZzBNA1UDE/VOBlvw2kOx0yhuHIj/HMdwKVULL16FdyeZUiTKY+O9urzm/a/VIczeL0KU1yeIDLFCGrXfU7RD4pc4oAsCTjbgU9eOFrpS8xwS0Yr0lLMPQd5Yz5E6Yx1uuhdjjSHYEbKfep1R+p+swNnoZSCwq4U+kNhQXHKyBgjaOuIOHEOB3esPFrhU2c6GW/DaQ7nTLjctyNNpjxalq/NO1K3og7n4Mof6YprKWTMBCYtqiboB4UFXdWPwwZBcI3F1zhQu/JopT95jQK1AWcRuHqiUArPOFK3og5fg8mlYwGOTBGT8xKpvhn9oLAgS2IrbOCybzb6cXD7C41Gd8N0aOphnKbrId77r5ktB377KfqhiyNngSBjsiS0fbBhjYF+UFggatdB2BDVlYXVMx9R0A+9fVMnek9c60H4gwIxXicmOq4xQu81wkJfynUj7NDCB2FBgAUhFd0LIR+ZiqdMT0uHdh+AF9Gfrg0dkS58HxkaMeHBee2qMQ4EGRPM5B5YoLDg4M1bqQkDNvSo7LG84ll+5MjI0VPkblV6HgSZ44CD926BBQoLoeO1IZeo1sMGg0nD4b/0DbiDBDmQcF7xrM6UcbDBIZjdTrFpPyxQZMAlGn+ETX0ppcZZ/L1V8JUTDIC78oGf9xqeh2GTS9A+aG7cp8MCRQaGF3jegMFV2BSnrnudIxdsuLhqYQFsKhlzjeyd8MOVUeZ9FnZxDmqKq5EBhgx0HNse8RVf9a2kSS6FTTrESyIp/+0ef1Xbvffc2LB35xYTFkou+8l1bYnCd+PEvRBZcJBUbfjwc08jAwQZuqhyYWmIjvtnilAHsuRkpNkr6+/KZvsWorUe6u481ssYgTt/lIvIgbEpccTssO5cElHNcSDICgXhefGGKb3N7+9DBghsGFH18HPtqutnyAUOKJIICiCupQBwgGDA/FJiY3f9C4uQIQobSN+hJ1gKjcgFAiR1HXFdBwgHCAaMmehJdZ98ADZQ2BA69kmiUOm4VYARxwWGght+ofOuvpZ3QrCBwaZox2dtowJV3RFNqQHBBcPPIs+fOrzqFdhEkYXWT19dVSDpTxJcGLzMeLO6Ou8xZIEhS8nO3bW+YZeQJHfMAME3Jp/E38TJt5Y17NlsIgsMWeKcI3Fqf21hybROzSCzTRCG84iCm0VurKiaKD/YsGeziSwR5IC/4oapETbmXZ3wEpwHzESPj7bcfarhzY0YIIYcSHQ3tBYXfmetKEa9GperOUAxCCgAv5TYqMTC87q+fH0/coAgx/yBRZVJpeSpBHEt5gQEucCBPJHvdmrHfxpqfHsncohgkIyY+Oi4FJLLVVNZGtXpSBDYwwGnYHY7mfonBnlNe/0zuzEICAbZxMuuZO3hogkx7p+tcmEqVQqqdMMsMzgnYAT/ZQKEcy6LQhvRug8yU9/r4OG/OMVj+5sb9+kYRATfkKvueDGwY/1hChiYvHgSithnzR++s9bEkCFDhgwZMuR8+TcgDLDRAr0H4wAAAABJRU5ErkJggg==</data>
	<key>pfm_last_modified</key>
	<date>2024-12-26T02:38:09Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configure Okta Verify Client settings</string>
			<key>pfm_description</key>
			<string>Settings to configure Okta Verify Client using your MDM solution</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Okta Verify</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.okta.mobile</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited. Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.okta.mobile</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_documentation_url</key>
			<string>https://help.okta.com/oie/en-us/content/topics/identity-engine/devices/managed-app-configs-macos.htm#OktaVeri</string>
			<key>pfm_name</key>
			<string>OktaVerify.DeviceHealthOptions</string>
			<key>pfm_note</key>
			<string>By default (when no values are set), all device health checks are displayed in Okta Verify on user devices.</string>
			<key>pfm_subkeys</key>
				<array>
					<dict>
						<key>pfm_range_list</key>
				<array>
					<string>Disabled</string>
					<string>HideOSUpdate</string>
					<string>HideDiskEncryption</string>
					<string>HideBiometrics</string>
					<string>HidePassword</string>
				</array>
				<key>pfm_range_list_titles</key>
					<array>
						<string>Disabled</string>
						<string>Hide OS Update</string>
						<string>Hide Disk Encryption</string>
						<string>Hide Biometrics </string>
						<string>Hide Password</string>
					</array>
					<key>pfm_title</key>
					<string>Device Health Options</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_unique</key>
					<true/>
					</dict>
				</array>
			<key>pfm_title</key>
			<string>Device Health Options</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_type_input</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
    		<string>SilentEnrollmentDisabled</string>
			<key>pfm_description</key>
			<string>Configure whether users are prompted to enroll in Okta Verify</string>
			<key>pfm_documentation_url</key>
			<string>https://help.okta.com/oie/en-us/content/topics/identity-engine/devices/managed-app-configs-macos.htm#OktaVeri2</string>
			<key>pfm_name</key>
			<string>OktaVerify.EnrollmentOptions</string>
			<key>pfm_range_list</key>
			<array>
				<string>SilentEnrollmentDisabled</string>
				<string>Enabled</string>
				<string>Disabled</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Silent Enrollment Disabled</string>
				<string>Enabled</string>
				<string>Disabled</string>
			</array>
			<key>pfm_title</key>
			<string>Enrollment Options</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>2.4.1</string>
			<key>pfm_description</key>
			<string>Pre-populate the org URL so that users don't have to enter this value on the first enter your sign-in URL page</string>
			<key>pfm_documentation_url</key>
			<string>https://help.okta.com/oie/en-us/content/topics/identity-engine/devices/managed-app-configs-macos.htm#OktaVeri3</string>
			<key>pfm_name</key>
			<string>OktaVerify.OrgUrl</string>
			<key>pfm_title</key>
			<string>Okta Org Url</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>yourcompany.okta.com</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Configure whether Okta Verify diagnostic and crash information is shared with Okta</string>
			<key>pfm_note</key>
			<string> If not configured, end users can set this value on their app</string>
			<key>pfm_documentation_url</key>
			<string>https://help.okta.com/oie/en-us/content/topics/identity-engine/devices/managed-app-configs-macos.htm#OktaVeri5</string>
			<key>pfm_name</key>
			<string>OktaVerify.ReportDiagnostics</string>
			<key>pfm_title</key>
			<string>Report Diagnostics</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configure whether Okta Verify shows the accounts list upon launch</string>
			<key>pfm_documentation_url</key>
			<string>https://help.okta.com/oie/en-us/content/topics/identity-engine/devices/managed-app-configs-macos.htm#OktaVeri6</string>
			<key>pfm_name</key>
			<string>OktaVerify.LaunchOptions</string>
			<key>pfm_note</key>
			<string>If not configured, Okta Verify shows the account list upon launch</string>
			<key>pfm_range_list</key>
			<array>
				<string>HideMainWindow</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Hide Main Window</string>
			</array>
			<key>pfm_title</key>
			<string>Set Launch Options</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Okta Verify</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
