<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://www.office.com</string>
	<key>pfm_description</key>
	<string>Microsoft OneNote settings</string>
	<key>pfm_domain</key>
	<string>com.microsoft.onenote.mac</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2023-08-21T10:35:00Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Microsoft OneNote settings</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Microsoft OneNote</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.microsoft.onenote.mac</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the TopLevel value, with an additional appended component. This string must be unique within the profile.
During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.microsoft.onenote.mac</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use 'uuidgen' to generate UUIDs.
During a profile replacement, the system updates payloads with the same 'PayloadIdentifier' and 'PayloadUUID' in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_deprecated</key>
			<string>16.17</string>
			<key>pfm_app_max</key>
			<string>16.16.x</string>
			<key>pfm_app_min</key>
			<string>15.x</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Controls the original "What's New" dialog and Office 365 activation prompt on first launch. Replaced by 'OfficeAutoSignIn' in the main Office profile starting in version 16.17 and should not be used for Office 2019.</string>
			<key>pfm_description_reference</key>
			<string>Controls the original "What's New" dialog and Office 365 activation prompt on first launch. Replaced by OfficeAutoSignIn starting in version 16.17.</string>
			<key>pfm_documentation_url</key>
			<string>https://derflounder.wordpress.com/2016/01/17/suppressing-office-2016s-first-run-dialog-windows/</string>
			<key>pfm_name</key>
			<string>kSubUIAppCompletedFirstRunSetup1507</string>
			<key>pfm_title</key>
			<string>First Run Setup Completed</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>This key when set to false will deactivate the ability for users to use the "Smile" feature to send feedback to Microsoft.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.google.com/spreadsheets/d/1ESX5td0y0OP3jdzZ-C2SItm-TUi-iA_bcHCBvaoCumw/</string>
			<key>pfm_name</key>
			<string>SendASmileEnabled</string>
			<key>pfm_title</key>
			<string>Send A Smile Enabled</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_deprecated</key>
			<string>16.28</string>
			<key>pfm_app_max</key>
			<string>16.27</string>
			<key>pfm_app_min</key>
			<string>15.x</string>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Set to FALSE to send minimal heartbeat data, no application usage, and no environment details.</string>
			<key>pfm_description_reference</key>
			<string>Set to false to send minimal heartbeat data, no application usage, and no environment details.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.microsoft.com/en-us/deployoffice/deploy-office-365-proplus-in-gcc-high-dod#turn-off-sending-telemetry-data-to-microsoft-from-office-for-mac</string>
			<key>pfm_name</key>
			<string>SendAllTelemetryEnabled</string>
			<key>pfm_title</key>
			<string>Send Telemetry Data</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_deprecated</key>
			<string>16.28</string>
			<key>pfm_app_max</key>
			<string>16.27</string>
			<key>pfm_app_min</key>
			<string>15.x</string>
			<key>pfm_description</key>
			<string>Sends crash reports even if telemetry is disabled. Will only be evaluated if 'Send Telemetry Data' is FALSE.</string>
			<key>pfm_description_reference</key>
			<string>This will stop your client devices sending us usage telemetry and asking questions to your users, but if the app crashes, we'll still invoke our Error Reporting dialog and get the call-stack back here so we can see if you're running into problems. The issue here is that if you don't enable crash reporting, we are completely blind as to whether folks out there are having problems or not. Relevant for those who disable telemetry through the SendAllTelemetryEnabled key.</string>
			<key>pfm_documentation_url</key>
			<string>https://macadmins.slack.com/archives/C07UZ1X7B/p1536706447000100</string>
			<key>pfm_name</key>
			<string>SendCrashReportsEvenWithTelemetryDisabled</string>
			<key>pfm_title</key>
			<string>Send Crash Reports even with Telemetry Disabled</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.13</string>
			<key>pfm_description</key>
			<string>Prevent users from signing in to any O365 service. This has the added effect of making sure users store no data online via microsoft servers.</string>
			<key>pfm_description_reference</key>
			<string>This will prevent user from signing in to any O365 service. This has the added effect of making sure users store no data online via microsoft servers.

* As of 16.13.0 these options work again.
            0 - all accounts allowed
            1 - prevent institutional accounts - only MSA (personal) accounts
            2 - prevent MSA (personal) accounts - only institution accounts
            4 - no accounts allowed to sign in</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.google.com/spreadsheets/d/1ESX5td0y0OP3jdzZ-C2SItm-TUi-iA_bcHCBvaoCumw/</string>
			<key>pfm_name</key>
			<string>SignInOptions</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
				<integer>2</integer>
				<integer>4</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>All accounts allowed</string>
				<string>Only personal accounts (MSA)</string>
				<string>Only institution accounts</string>
				<string>No accounts allowed</string>
			</array>
			<key>pfm_title</key>
			<string>Sign In Options</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>16.13.1</string>
			<key>pfm_description</key>
			<string>Disable the "Connected Services" dialog for MSA-based (personal) accounts.</string>
			<key>pfm_description_reference</key>
			<string>MSA-based Key to suppress a screen on update from pre-16.13 called "Connected Services" with an Accept button on it. If you wish to suppress this new dialog for MSA-based accounts set this key to TRUE.</string>
			<key>pfm_documentation_url</key>
			<string>https://macadmins.slack.com/archives/C07UZ1X7B/p1527191452000462</string>
			<key>pfm_name</key>
			<string>kFRETelemetryConsentKey</string>
			<key>pfm_title</key>
			<string>Suppress 'Connected Services' dialog</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_deprecated</key>
			<string>16.28</string>
			<key>pfm_app_max</key>
			<string>16.27 ONLY</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Suppresses a temporary Privacy and Services Update dialog in 16.27 ONLY. (Was previously used for a similar purpose in 16.13.1 but the key was recycled.)</string>
			<key>pfm_documentation_url</key>
			<string>https://macadmins.software/docs/16.28-Privacy-Consent.key</string>
			<key>pfm_name</key>
			<string>kFREEnterpriseTelemetryInfoKey</string>
			<key>pfm_title</key>
			<string>Suppress Privacy and Services dialog</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_deprecated</key>
			<string>16.28</string>
			<key>pfm_app_max</key>
			<string>16.27</string>
			<key>pfm_app_min</key>
			<string>16.17</string>
			<key>pfm_description</key>
			<string>Suppress the "Use Intelligent Services?" pop-up dialog and auto-accept the terms in 16.17 through 16.27.</string>
			<key>pfm_description_reference</key>
			<string>Users who are activated with O365 will see a new "Use Intelligent Services?" pop-up dialog in Word, Excel &amp; PowerPoint after updating to 16.17. The net effect of doing this will enable Researcher (Word), Translate (Word, Excel, PowerPoint), Smart Lookup (Word, PowerPoint), and QuickStarter (PowerPoint). Set to TRUE to auto-accept. Requires "PII_And_Intelligent_Services_Preference" as well.</string>
			<key>pfm_documentation_url</key>
			<string>https://macadmins.software/docs/16.28-Privacy-Consent.key</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>PII_And_Intelligent_Services_Preference</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>PII_And_Intelligent_Services_Preference</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>kFREIntelligenceServicesConsentV2Key</string>
			<key>pfm_title</key>
			<string>Suppress 'Use Intelligent Services' dialog (1/2)</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_deprecated</key>
			<string>16.28</string>
			<key>pfm_app_max</key>
			<string>16.27</string>
			<key>pfm_app_min</key>
			<string>16.17</string>
			<key>pfm_description</key>
			<string>Suppress the "Use Intelligent Services?" pop-up dialog and auto-accept the terms in 16.17 through 16.27.</string>
			<key>pfm_description_reference</key>
			<string>Users who are activated with O365 will see a new "Use Intelligent Services?" pop-up dialog in Word, Excel &amp; PowerPoint after updating to 16.17. The net effect of doing this will enable Researcher (Word), Translate (Word, Excel, PowerPoint), Smart Lookup (Word, PowerPoint), and QuickStarter (PowerPoint). Set to TRUE to auto-accept. Requires "kFREIntelligenceServicesConsentV2Key" as well.</string>
			<key>pfm_documentation_url</key>
			<string>https://macadmins.software/docs/16.28-Privacy-Consent.key</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>kFREIntelligenceServicesConsentV2Key</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>kFREIntelligenceServicesConsentV2Key</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>PII_And_Intelligent_Services_Preference</string>
			<key>pfm_title</key>
			<string>Suppress 'Use Intelligent Services' dialog (2/2)</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>Microsoft OneNote</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>4</integer>
</dict>
</plist>
