<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Microsoft Defender for Endpoint settings</string>
	<key>pfm_documentation_url</key>
	<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences</string>
	<key>pfm_domain</key>
	<string>com.microsoft.wdav</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2025-12-13T20:41:02Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Microsoft Defender for Endpoint settings</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Microsoft Defender for Endpoint</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.microsoft.wdav</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the `TopLevel` value, with an additional appended component. This string must be unique within the profile.

During a profile replacement, the system updates payloads with the same `PayloadIdentifier` and `PayloadUUID` in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.microsoft.wdav</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use `uuidgen` to generate UUIDs.

During a profile replacement, the system updates payloads with the same `PayloadIdentifier` and `PayloadUUID` in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Manages the preferences of the antivirus component of Microsoft Defender for Endpoint.</string>
			<key>pfm_description_reference</key>
			<string>The antivirusEngine section of the configuration profile is used to manage the preferences of the antivirus component of Microsoft Defender for Endpoint.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#antivirus-engine-preferences</string>
			<key>pfm_name</key>
			<string>antivirusEngine</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_app_min</key>
					<string>101.24042.0002</string>
					<key>pfm_default</key>
					<string>enabled</string>
					<key>pfm_description</key>
					<string>Determines whether behavior monitoring and blocking capability is enabled on the device or not.</string>
					<key>pfm_documentation_url</key>
					<string>https://learn.microsoft.com/en-us/defender-endpoint/mac-preferences#enabledisable-behavior-monitoring</string>
					<key>pfm_name</key>
					<string>behaviorMonitoring</string>
					<key>pfm_range_list</key>
					<array>
						<string>disabled</string>
						<string>enabled</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disabled</string>
						<string>Enabled</string>
					</array>
					<key>pfm_title</key>
					<string>Behavior Monitoring</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>101.10.72</string>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<string>enabled</string>
									</array>
									<key>pfm_target</key>
									<string>antivirusEngine.behaviorMonitoring</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_default</key>
					<string>realTime</string>
					<key>pfm_description</key>
					<string>Enforcement level of antivirus engine. On-demand: Files are scanned only on demand; Passive: Same as on-demand, but also security intelligence updates are enabled, and the status menu icon is hidden; Real-time: Scan files as they are accessed.</string>
					<key>pfm_description_reference</key>
					<string>Specifies the enforcement preference of antivirus engine. There are three values for setting enforcement level:
- Real-time (real_time): Real-time protection (scan files as they are accessed) is enabled.
- On-demand (on_demand): Files are scanned only on demand. In this:
	- Real-time protection is turned off.
- Passive (passive): Runs the antivirus engine in passive mode. In this:
	- Real-time protection is turned off.
	- On-demand scanning is turned on.
	- Automatic threat remediation is turned off.
	- Security intelligence updates are turned on.
	- Status menu icon is hidden.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#enforcement-level-for-antivirus-engine</string>
					<key>pfm_name</key>
					<string>enforcementLevel</string>
					<key>pfm_range_list</key>
					<array>
						<string>passive</string>
						<string>on_demand</string>
						<string>real_time</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Passive</string>
						<string>On-demand</string>
						<string>Real-time</string>
					</array>
					<key>pfm_title</key>
					<string>Enforcement level for antivirus engine</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>101.73.77</string>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>Enables or disables file hash computation feature. When this feature is enabled Defender will compute hashes for files it scans. This will help in improving the accuracy of Custom Indicator matches. However, enabling EnableFileHashComputation may impact device performance.</string>
					<key>pfm_description_reference</key>
					<string>Enables or disables file hash computation feature. When this feature is enabled, Defender for Endpoint will compute hashes for files it scans. Note that enabling this feature might impact device performance. For more details, please refer to https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/indicator-file.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#configure-file-hash-computation-feature</string>
					<key>pfm_name</key>
					<string>enableFileHashComputation</string>
					<key>pfm_note</key>
					<string>Enabling this feature might impact device performance.</string>
					<key>pfm_title</key>
					<string>Enable file hash computation</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>101.41.10</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>Specifies whether to start a process scan after new security intelligence updates are downloaded on the device. Enabling this setting will trigger an antivirus scan on the running processes of the device.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#run-a-scan-after-definitions-are-updated</string>
					<key>pfm_name</key>
					<string>scanAfterDefinitionUpdate</string>
					<key>pfm_title</key>
					<string>Run a scan after definitions are updated</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>101.41.10</string>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>If true, Defender will unpack archives and scan files inside them. Otherwise archive content will be skipped, that will improve scanning performance.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#scan-archives-on-demand-antivirus-scans-only</string>
					<key>pfm_name</key>
					<string>scanArchives</string>
					<key>pfm_title</key>
					<string>Scanning inside archive files</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>101.41.10</string>
					<key>pfm_default</key>
					<integer>2</integer>
					<key>pfm_description</key>
					<string>Specifies the degree of parallelism for on-demand scans. This corresponds to the number of threads used to perform the scan and impacts the CPU usage, as well as the duration of the on-demand scan.</string>
					<key>pfm_description_reference</key>
					<string>Specifies the degree of parallelism for on-demand scans. This corresponds to the number of threads used to perform the scan and impacts the CPU usage, as well as the duration of the on-demand scan.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#degree-of-parallelism-for-on-demand-scans</string>
					<key>pfm_name</key>
					<string>maximumOnDemandScanThreads</string>
					<key>pfm_range_max</key>
					<integer>64</integer>
					<key>pfm_range_min</key>
					<integer>1</integer>
					<key>pfm_title</key>
					<string>Degree of parallelism for on-demand scans</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>100.83.73</string>
					<key>pfm_default</key>
					<string>merge</string>
					<key>pfm_description</key>
					<string>Specify the merge policy for exclusions. This can be a combination of administrator-defined and user-defined exclusions (merge) or only administrator-defined exclusions (admin_only). This setting can be used to restrict local users from defining their own exclusions.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#exclusion-merge-policy</string>
					<key>pfm_name</key>
					<string>exclusionsMergePolicy</string>
					<key>pfm_range_list</key>
					<array>
						<string>merge</string>
						<string>admin_only</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Merge</string>
						<string>Admin Only</string>
					</array>
					<key>pfm_title</key>
					<string>Exclusions merge</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Entities that have been excluded from the scan. Exclusions can be specified by full paths, extensions, or file names.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#scan-exclusions</string>
					<key>pfm_name</key>
					<string>exclusions</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_hidden</key>
							<string>container</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_default</key>
									<string>excludedPath</string>
									<key>pfm_description</key>
									<string>Specify content excluded from being scanned by type.</string>
									<key>pfm_documentation_reference</key>
									<string>Specify content excluded from being scanned by type.</string>
									<key>pfm_documentation_url</key>
									<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#type-of-exclusion</string>
									<key>pfm_name</key>
									<string>$type</string>
									<key>pfm_range_list</key>
									<array>
										<string>excludedPath</string>
										<string>excludedFileExtension</string>
										<string>excludedFileName</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Path</string>
										<string>File extension</string>
										<string>Process name</string>
									</array>
									<key>pfm_title</key>
									<string>Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Path to exclude, wildcards are supported</string>
									<key>pfm_documentation_url</key>
									<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#path-to-excluded-content</string>
									<key>pfm_exclude</key>
									<array>
										<dict>
											<key>pfm_target_conditions</key>
											<array>
												<dict>
													<key>pfm_range_list</key>
													<array>
														<string>excludedFileExtension</string>
														<string>excludedFileName</string>
													</array>
													<key>pfm_target</key>
													<string>$type</string>
												</dict>
											</array>
										</dict>
									</array>
									<key>pfm_name</key>
									<string>path</string>
									<key>pfm_range_min</key>
									<integer>1</integer>
									<key>pfm_title</key>
									<string>Path</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<false/>
									<key>pfm_description</key>
									<string>Directory if selected, or file if not selected</string>
									<key>pfm_documentation_url</key>
									<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#path-type-file--directory</string>
									<key>pfm_exclude</key>
									<array>
										<dict>
											<key>pfm_target_conditions</key>
											<array>
												<dict>
													<key>pfm_n_range_list</key>
													<array>
														<string>excludedPath</string>
													</array>
													<key>pfm_target</key>
													<string>$type</string>
												</dict>
											</array>
										</dict>
									</array>
									<key>pfm_name</key>
									<string>isDirectory</string>
									<key>pfm_title</key>
									<string>Is directory</string>
									<key>pfm_type</key>
									<string>boolean</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Specify content excluded from being scanned by file extension.</string>
									<key>pfm_description_reference</key>
									<string>Specify content excluded from being scanned by file extension.</string>
									<key>pfm_documentation_url</key>
									<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#file-extension-excluded-from-the-scan</string>
									<key>pfm_exclude</key>
									<array>
										<dict>
											<key>pfm_target_conditions</key>
											<array>
												<dict>
													<key>pfm_n_range_list</key>
													<array>
														<string>excludedFileExtension</string>
													</array>
													<key>pfm_target</key>
													<string>$type</string>
												</dict>
											</array>
										</dict>
									</array>
									<key>pfm_name</key>
									<string>extension</string>
									<key>pfm_range_min</key>
									<integer>1</integer>
									<key>pfm_title</key>
									<string>File extension</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Process name, either or full path or file name, wildcards supported</string>
									<key>pfm_documentation_url</key>
									<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#process-excluded-from-the-scan</string>
									<key>pfm_exclude</key>
									<array>
										<dict>
											<key>pfm_target_conditions</key>
											<array>
												<dict>
													<key>pfm_n_range_list</key>
													<array>
														<string>excludedFileName</string>
													</array>
													<key>pfm_target</key>
													<string>$type</string>
												</dict>
											</array>
										</dict>
									</array>
									<key>pfm_name</key>
									<string>name</string>
									<key>pfm_range_min</key>
									<integer>1</integer>
									<key>pfm_title</key>
									<string>Process name</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Exclusions</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Scan exclusions</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>List of threats (identified by their name) that are not blocked by the product and are instead allowed to run.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#allowed-threats</string>
					<key>pfm_name</key>
					<string>allowedThreats</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_title</key>
							<string>Threat</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Allowed threats</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>100.83.73</string>
					<key>pfm_description</key>
					<string>Restricts the actions that the local user of a device can take when threats are detected. The actions included in this list are not displayed in the user interface. Use unique values.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#disallowed-threat-actions</string>
					<key>pfm_name</key>
					<string>disallowedThreatActions</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>allow</string>
								<string>restore</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Allow Threats (restricts users from allowing threats)</string>
								<string>Restore Threats (restricts users from restoring threats from the quarantine)</string>
							</array>
							<key>pfm_repetition_max</key>
							<integer>2</integer>
							<key>pfm_title</key>
							<string>Action</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Disallowed threat actions</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The threatTypeSettings preference in the antivirus engine is used to control how certain threat types are handled by the product.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#threat-type-settings</string>
					<key>pfm_name</key>
					<string>threatTypeSettings</string>
					<key>pfm_note</key>
					<string>Each threat type should only be listed once</string>
					<key>pfm_repetition_max</key>
					<integer>2</integer>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>Type of the threat for which the behavior is configured.</string>
									<key>pfm_documentation_url</key>
									<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#threat-type</string>
									<key>pfm_name</key>
									<string>key</string>
									<key>pfm_range_list</key>
									<array>
										<string>potentially_unwanted_application</string>
										<string>archive_bomb</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Potentially Unwanted Application</string>
										<string>Archive Bomb</string>
									</array>
									<key>pfm_title</key>
									<string>Threat type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<string>audit</string>
									<key>pfm_description</key>
									<string>Action to take when coming across a threat of the type specified in the preceding section.</string>
									<key>pfm_description_reference</key>
									<string>Specify what action to take when a threat of the type specified in the preceding section is detected. Choose from the following options:
Audit: your device is not protected against this type of threat, but an entry about the threat is logged.
Block: your device is protected against this type of threat and you are notified in the user interface and the security console.
Off: your device is not protected against this type of threat and nothing is logged.</string>
									<key>pfm_documentation_url</key>
									<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#action-to-take</string>
									<key>pfm_name</key>
									<string>value</string>
									<key>pfm_range_list</key>
									<array>
										<string>audit</string>
										<string>block</string>
										<string>off</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Audit</string>
										<string>Block</string>
										<string>Off</string>
									</array>
									<key>pfm_title</key>
									<string>Action to take</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Setting</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Threat type settings</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>100.83.73</string>
					<key>pfm_default</key>
					<string>merge</string>
					<key>pfm_description</key>
					<string>Specify the merge policy for threat type settings. This can be a combination of administrator-defined and user-defined settings (merge) or only administrator-defined settings (admin_only). This setting can be used to restrict local users from defining their own settings for different threat types.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#threat-type-settings-merge-policy</string>
					<key>pfm_name</key>
					<string>threatTypeSettingsMergePolicy</string>
					<key>pfm_range_list</key>
					<array>
						<string>merge</string>
						<string>admin_only</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Merge</string>
						<string>Admin Only</string>
					</array>
					<key>pfm_title</key>
					<string>Threat type settings merge</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>101.07.23</string>
					<key>pfm_default</key>
					<integer>90</integer>
					<key>pfm_description</key>
					<string>Specify the number of days that results are retained in the scan history on the device. Old scan results are removed from the history. Old quarantined files that are also removed from the disk.</string>
					<key>pfm_description_reference</key>
					<string>Specify the number of days that results are retained in the scan history on the device. Old scan results are removed from the history. Old quarantined files that are also removed from the disk.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#antivirus-scan-history-retention-in-days</string>
					<key>pfm_name</key>
					<string>scanResultsRetentionDays</string>
					<key>pfm_range_max</key>
					<integer>180</integer>
					<key>pfm_range_min</key>
					<integer>1</integer>
					<key>pfm_title</key>
					<string>Scan results retention</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfm_value_unit</key>
					<string>days</string>
					<key>pfmx_comment</key>
					<string>While this property is documented as String-typed on the web, it is defined as a Number in the official JSON schema.</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>101.07.23</string>
					<key>pfm_default</key>
					<integer>10000</integer>
					<key>pfm_description</key>
					<string>Specify the maximum number of entries to keep in the scan history. Entries include all on-demand scans performed in the past and all antivirus detections.</string>
					<key>pfm_description_reference</key>
					<string>Specify the maximum number of entries to keep in the scan history. Entries include all on-demand scans performed in the past and all antivirus detections.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#maximum-number-of-items-in-the-antivirus-scan-history</string>
					<key>pfm_name</key>
					<string>scanHistoryMaximumItems</string>
					<key>pfm_range_max</key>
					<integer>15000</integer>
					<key>pfm_range_min</key>
					<integer>5000</integer>
					<key>pfm_title</key>
					<string>Scan history size</string>
					<key>pfm_type</key>
					<string>integer</string>
					<key>pfmx_comment</key>
					<string>While this property is documented as String-typed on the web, it is defined as a Number in the official JSON schema.</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>Locates and stops malware from installing or running on your device. You can turn off this setting for a short time before it turns back on automatically.</string>
					<key>pfm_name</key>
					<string>enableRealTimeProtection</string>
					<key>pfm_title</key>
					<string>Real-time protection</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>Whether the antivirus engine runs in passive mode or not.</string>
					<key>pfm_name</key>
					<string>passiveMode</string>
					<key>pfm_title</key>
					<string>Passive mode</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Antivirus engine</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configure the cloud-driven protection features of Microsoft Defender for Endpoint.</string>
			<key>pfm_description_reference</key>
			<string>Configure the cloud-driven protection features of Microsoft Defender for Endpoint on macOS.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#cloud-delivered-protection-preferences</string>
			<key>pfm_name</key>
			<string>cloudService</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>Provides increased, faster protection with access to the latest protection data in the cloud. Works best with automatic sample submission turned on</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#enable--disable-cloud-delivered-protection</string>
					<key>pfm_name</key>
					<string>enabled</string>
					<key>pfm_title</key>
					<string>Cloud delivered protection</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>optional</string>
					<key>pfm_description</key>
					<string>We encourage you to share your diagnostic and usage data with us to help improve Microsoft products and services.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#diagnostic-collection-level</string>
					<key>pfm_name</key>
					<string>diagnosticLevel</string>
					<key>pfm_range_list</key>
					<array>
						<string>optional</string>
						<string>required</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Optional</string>
						<string>Required</string>
					</array>
					<key>pfm_title</key>
					<string>Diagnostic data collection</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>101.56.62</string>
					<key>pfm_default</key>
					<string>normal</string>
					<key>pfm_description</key>
					<string>Determines how aggressive Defender for Endpoint will be in blocking and scanning suspicious files.</string>
					<key>pfm_description_reference</key>
					<string>This setting determines how aggressive Defender for Endpoint will be in blocking and scanning suspicious files. If this setting is on, Defender for Endpoint will be more aggressive when identifying suspicious files to block and scan; otherwise, it will be less aggressive and therefore block and scan with less frequency. There are five values for setting cloud block level:
Normal (normal): The default blocking level.
Moderate (moderate): Delivers verdict only for high confidence detections.
High (high): Aggressively blocks unknown files while optimizing for performance (greater chance of blocking non-harmful files).
High Plus (high_plus): Aggressively blocks unknown files and applies additional protection measures (might impact client device performance).
Zero Tolerance (zero_tolerance): Blocks all unknown programs.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#configure-cloud-block-level</string>
					<key>pfm_name</key>
					<string>cloudBlockLevel</string>
					<key>pfm_range_list</key>
					<array>
						<string>normal</string>
						<string>moderate</string>
						<string>high</string>
						<string>high_plus</string>
						<string>zero_tolerance</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Normal: The default blocking level</string>
						<string>Moderate: Delivers verdict only for high confidence detections</string>
						<string>High: Aggressively blocks unknown files while optimizing for performance (greater chance of blocking non-harmful files)</string>
						<string>High Plus: Aggressively blocks unknown files and applies additional protection measures (might impact client device performance)</string>
						<string>Zero Tolerance: Blocks all unknown programs</string>
					</array>
					<key>pfm_title</key>
					<string>Cloud Block Level</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>Determines whether suspicious samples are sent to Microsoft.</string>
					<key>pfm_description_reference</key>
					<string>Determines whether suspicious samples (that are likely to contain threats) are sent to Microsoft. You are prompted if the submitted file is likely to contain personal information.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#enable--disable-automatic-sample-submissions</string>
					<key>pfm_name</key>
					<string>automaticSampleSubmission</string>
					<key>pfm_title</key>
					<string>Enable / disable automatic sample submissions</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_description</key>
					<string>Determines whether security intelligence updates are installed automatically:</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#enable--disable-automatic-security-intelligence-updates</string>
					<key>pfm_name</key>
					<string>automaticDefinitionUpdateEnabled</string>
					<key>pfm_title</key>
					<string>Automatic security intelligence updates</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>safe</string>
					<key>pfm_description</key>
					<string>Sends sample files to Microsoft to help protect device users and your organization from potential threats</string>
					<key>pfm_name</key>
					<string>automaticSampleSubmissionConsent</string>
					<key>pfm_range_list</key>
					<array>
						<string>none</string>
						<string>safe</string>
						<string>all</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>None</string>
						<string>Safe</string>
						<string>All</string>
					</array>
					<key>pfm_title</key>
					<string>Automatic sample submission Consent</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Cloud delivered protection preferences</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Manage the preferences for the user interface.</string>
			<key>pfm_description_reference</key>
			<string>Manage the preferences for the user interface of Microsoft Defender for Endpoint on macOS.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#user-interface-preferences</string>
			<key>pfm_name</key>
			<string>userInterface</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>Whether the status menu icon (shown in the top-right corner of the screen) is hidden or not.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-atp/mac-preferences#show--hide-status-menu-icon</string>
					<key>pfm_name</key>
					<string>hideStatusMenuIcon</string>
					<key>pfm_title</key>
					<string>Hide status menu icon</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>101.19.61</string>
					<key>pfm_default</key>
					<string>enabled</string>
					<key>pfm_description</key>
					<string>Specify whether users can submit feedback to Microsoft by going to Help &gt; Send Feedback.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#show--hide-option-to-send-feedback</string>
					<key>pfm_name</key>
					<string>userInitiatedFeedback</string>
					<key>pfm_range_list</key>
					<array>
						<string>enabled</string>
						<string>disabled</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Enabled</string>
						<string>Disabled</string>
					</array>
					<key>pfm_title</key>
					<string>User initiated feedback</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>101.60.18</string>
					<key>pfm_default</key>
					<string>enabled</string>
					<key>pfm_description</key>
					<string>Specify whether users can sign into the consumer version of Microsoft Defender</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#control-sign-in-to-consumer-version-of-microsoft-defender</string>
					<key>pfm_name</key>
					<string>consumerExperience</string>
					<key>pfm_range_list</key>
					<array>
						<string>enabled</string>
						<string>disabled</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Enabled</string>
						<string>Disabled</string>
					</array>
					<key>pfm_title</key>
					<string>Control sign-in to consumer version</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>User interface preferences</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Manage the preferences of the endpoint detection and response (EDR) component.</string>
			<key>pfm_description_reference</key>
			<string>Manage the preferences of the endpoint detection and response (EDR) component of Microsoft Defender for Endpoint on macOS.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#endpoint-detection-and-response-preferences</string>
			<key>pfm_name</key>
			<string>edr</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description_reference</key>
					<string>Specify a tag name and its value.
The GROUP tag, tags the device with the specified value. The tag is reflected in the portal under the device page and can be used for filtering and grouping devices.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#device-tags</string>
					<key>pfm_name</key>
					<string>tags</string>
					<key>pfm_note</key>
					<string>Only one value per tag type can be set. Type of tags are unique, and should not be repeated in the same configuration profile.</string>
					<key>pfm_range_max</key>
					<integer>1</integer>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>Specifies the type of tag</string>
									<key>pfm_description_reference</key>
									<string>Specifies the type of tag</string>
									<key>pfm_documentation_url</key>
									<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#type-of-tag</string>
									<key>pfm_name</key>
									<string>key</string>
									<key>pfm_range_list</key>
									<array>
										<string>GROUP</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Group</string>
									</array>
									<key>pfm_title</key>
									<string>Type of tag</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Specifies the value of tag</string>
									<key>pfm_description_reference</key>
									<string>Specifies the value of tag</string>
									<key>pfm_documentation_url</key>
									<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-preferences#value-of-tag</string>
									<key>pfm_name</key>
									<string>value</string>
									<key>pfm_title</key>
									<string>Value of tag</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Tag</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Device tags</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>groupIds</string>
					<key>pfm_title</key>
					<string>Group identifier</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>EDR preferences</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Tamper protection helps prevent unauthorized removal of Microsoft Defender for Endpoint.</string>
			<key>pfm_description_reference</key>
			<string>Tamper protection in macOS helps prevent unwanted changes to security settings from being made by unauthorized users. Tamper protection helps prevent unauthorized removal of Microsoft Defender for Endpoint on macOS. This capability also helps important security files, processes, and configuration settings from being tampered.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/tamperprotection-macos</string>
			<key>pfm_name</key>
			<string>tamperProtection</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_app_min</key>
					<string>101.70.19</string>
					<key>pfm_default</key>
					<string>block</string>
					<key>pfm_description</key>
					<string>Specifies if tamper protection is disabled, in audit mode, or enforced</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/tamperprotection-macos</string>
					<key>pfm_name</key>
					<string>enforcementLevel</string>
					<key>pfm_range_list</key>
					<array>
						<string>disabled</string>
						<string>audit</string>
						<string>block</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disabled: Tamper protection is completely off</string>
						<string>Audit: Tampering operations are logged, but not blocked</string>
						<string>Block: Tamper protection is on, tampering operations are blocked</string>
					</array>
					<key>pfm_title</key>
					<string>Enforcement level</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Defines process that can interfere with Defender without considering it tampering</string>
					<key>pfm_name</key>
					<string>exclusions</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>Full and exact path to the process binary</string>
									<key>pfm_name</key>
									<string>path</string>
									<key>pfm_title</key>
									<string>Process path</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Code signature TeamIdentifier</string>
									<key>pfm_name</key>
									<string>teamId</string>
									<key>pfm_title</key>
									<string>Process's TeamIdentifier</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Code signature Identifier</string>
									<key>pfm_name</key>
									<string>signingId</string>
									<key>pfm_title</key>
									<string>Process's Signing Identifier</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Command line arguments</string>
									<key>pfm_name</key>
									<string>args</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_title</key>
											<string>Argument</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>Process's arguments</string>
									<key>pfm_type</key>
									<string>array</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Process identity</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Process exclusions</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Tamper protection</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Device control can be used to customize the URL target for notifications raised by device control, and allow or block removable devices.</string>
			<key>pfm_description_reference</key>
			<string>To configure device control for macOS, you must create a policy that describes the restrictions you want to put in place within your organization.</string>
			<key>pfm_documentation_url</key>
			<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-device-control-overview#device-control-policy</string>
			<key>pfm_name</key>
			<string>deviceControl</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_app_min</key>
					<string>101.34.20</string>
					<key>pfm_description</key>
					<string>Configure the URL that is opened when end users click the notification shown when a device control policy is enforced.</string>
					<key>pfm_description_reference</key>
					<string>When the device control policy that you have put in place is enforced on a device (for example, access to a removable media device is restricted), a notification is displayed to the user. When end users click this notification, a web page is opened in the default browser. You can configure the URL that is opened when end users click the notification.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-device-control-overview#customize-url-target-for-notifications-raised-by-device-control</string>
					<key>pfm_name</key>
					<string>navigationTarget</string>
					<key>pfm_title</key>
					<string>Customize URL target for notifications raised by device control</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>101.34.20</string>
					<key>pfm_description</key>
					<string>Restrict access to removable media.</string>
					<key>pfm_description_reference</key>
					<string>The removable media section of the device control policy is used to restrict access to removable media.</string>
					<key>pfm_documentation_url</key>
					<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-device-control-overview#allow-or-block-removable-devices</string>
					<key>pfm_name</key>
					<string>removableMediaPolicy</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_app_min</key>
							<string>101.34.20</string>
							<key>pfm_description</key>
							<string>Set the removable media enforcement level.</string>
							<key>pfm_description_reference</key>
							<string>Under the removable media section, there is an option to set the enforcement level, which can take one of the following values:
audit - Under this enforcement level, if access to a device is restricted, a notification is displayed to the user, however the device can still be used. This enforcement level can be useful to evaluate the effectiveness of a policy.
block - Under this enforcement level, the operations that the user can perform on the device are limited to what is defined in the policy. Furthermore, a notification is raised to the user.</string>
							<key>pfm_documentation_url</key>
							<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-device-control-overview#policy-enforcement-level</string>
							<key>pfm_name</key>
							<string>enforcementLevel</string>
							<key>pfm_range_list</key>
							<array>
								<string>audit</string>
								<string>block</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Audit: A notification is displayed to the user, however the device can still be used.</string>
								<string>Block: A notification is displayed to the user, and the device cannot be used.</string>
							</array>
							<key>pfm_title</key>
							<string>Policy enforcement level</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_app_min</key>
							<string>101.34.20</string>
							<key>pfm_description</key>
							<string>The default permission level for devices that do not match anything else in the policy.</string>
							<key>pfm_description_reference</key>
							<string>At the top level of the removable media section, you can configure the default permission level for devices that do not match anything else in the policy. This setting can be set to:
none - No operations can be performed on the device
A combination of the following values:
read - Read operations are permitted on the device
write - Write operations are permitted on the device
execute - Execute operations are permitted on the device.</string>
							<key>pfm_documentation_url</key>
							<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-device-control-overview#default-permission-level</string>
							<key>pfm_name</key>
							<string>permission</string>
							<key>pfm_note</key>
							<string>If None is present in the permission level, any other permissions (Read, Write, or Execute) will be ignored.
The execute permission only refers to execution of Mach-O binaries. It does not include execution of scripts or other types of payloads.</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<string>none</string>
										<string>read</string>
										<string>write</string>
										<string>execute</string>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>None</string>
										<string>Read</string>
										<string>Write</string>
										<string>Execute</string>
									</array>
									<key>pfm_title</key>
									<string>Permissions</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Default permission level</string>
							<key>pfm_type</key>
							<string>array</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Restrict removable media by vendor.</string>
							<key>pfm_description_reference</key>
							<string>Restrict removable media by vendor.</string>
							<key>pfm_documentation_url</key>
							<string>https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/mac-device-control-overview#restrict-removable-media-by-vendor-product-and-serial-number</string>
							<key>pfm_name</key>
							<string>vendors</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_name</key>
									<string>{{key}}</string>
									<key>pfm_title</key>
									<string>Vendor ID</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_name</key>
									<string>{{value}}</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_name</key>
											<string>permission</string>
											<key>pfm_subkeys</key>
											<array>
												<dict>
													<key>pfm_range_list</key>
													<array>
														<string>none</string>
														<string>read</string>
														<string>write</string>
														<string>execute</string>
													</array>
													<key>pfm_range_list_titles</key>
													<array>
														<string>None</string>
														<string>Read</string>
														<string>Write</string>
														<string>Execute</string>
													</array>
													<key>pfm_title</key>
													<string>Permissions</string>
													<key>pfm_type</key>
													<string>string</string>
												</dict>
											</array>
											<key>pfm_title</key>
											<string>Permission level</string>
											<key>pfm_type</key>
											<string>array</string>
										</dict>
										<dict>
											<key>pfm_name</key>
											<string>products</string>
											<key>pfm_subkeys</key>
											<array>
												<dict>
													<key>pfm_name</key>
													<string>{{key}}</string>
													<key>pfm_title</key>
													<string>Product ID</string>
													<key>pfm_type</key>
													<string>string</string>
												</dict>
												<dict>
													<key>pfm_name</key>
													<string>{{value}}</string>
													<key>pfm_subkeys</key>
													<array>
														<dict>
															<key>pfm_name</key>
															<string>permission</string>
															<key>pfm_subkeys</key>
															<array>
																<dict>
																	<key>pfm_range_list</key>
																	<array>
																		<string>none</string>
																		<string>read</string>
																		<string>write</string>
																		<string>execute</string>
																	</array>
																	<key>pfm_range_list_titles</key>
																	<array>
																		<string>None</string>
																		<string>Read</string>
																		<string>Write</string>
																		<string>Execute</string>
																	</array>
																	<key>pfm_title</key>
																	<string>Permissions</string>
																	<key>pfm_type</key>
																	<string>string</string>
																</dict>
															</array>
															<key>pfm_title</key>
															<string>Permission level</string>
															<key>pfm_type</key>
															<string>array</string>
														</dict>
														<dict>
															<key>pfm_name</key>
															<string>serialNumbers</string>
															<key>pfm_subkeys</key>
															<array>
																<dict>
																	<key>pfm_name</key>
																	<string>{{key}}</string>
																	<key>pfm_title</key>
																	<string>Serial Number</string>
																	<key>pfm_type</key>
																	<string>string</string>
																</dict>
																<dict>
																	<key>pfm_name</key>
																	<string>{{value}}</string>
																	<key>pfm_subkeys</key>
																	<array>
																		<dict>
																			<key>pfm_range_list</key>
																			<array>
																				<string>none</string>
																				<string>read</string>
																				<string>write</string>
																				<string>execute</string>
																			</array>
																			<key>pfm_range_list_titles</key>
																			<array>
																				<string>None</string>
																				<string>Read</string>
																				<string>Write</string>
																				<string>Execute</string>
																			</array>
																			<key>pfm_title</key>
																			<string>Permissions</string>
																			<key>pfm_type</key>
																			<string>string</string>
																		</dict>
																	</array>
																	<key>pfm_title</key>
																	<string>Serial Number Details</string>
																	<key>pfm_type</key>
																	<string>array</string>
																</dict>
															</array>
															<key>pfm_title</key>
															<string>Serial Numbers</string>
															<key>pfm_type</key>
															<string>dictionary</string>
														</dict>
													</array>
													<key>pfm_title</key>
													<string>Product Details</string>
													<key>pfm_type</key>
													<string>dictionary</string>
												</dict>
											</array>
											<key>pfm_title</key>
											<string>Products</string>
											<key>pfm_type</key>
											<string>dictionary</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>Vendor Details</string>
									<key>pfm_type</key>
									<string>dictionary</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Vendors</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Allow or block removable devices</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>JSON string representing the device control policy</string>
					<key>pfm_name</key>
					<string>policy</string>
					<key>pfm_title</key>
					<string>Device Control Policy</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Device Control</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>features</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<string>disabled</string>
					<key>pfm_description</key>
					<string>Whether data loss prevention enforcement is enabled on the machine.</string>
					<key>pfm_name</key>
					<string>dataLossPrevention</string>
					<key>pfm_range_list</key>
					<array>
						<string>enabled</string>
						<string>disabled</string>
					</array>
					<key>pfm_title</key>
					<string>Use Data Loss Prevention</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>enabled</string>
					<key>pfm_description</key>
					<string>Schedule scans with Microsoft Defender for Endpoint.</string>
					<key>pfm_name</key>
					<string>scheduledScan</string>
					<key>pfm_range_list</key>
					<array>
						<string>enabled</string>
						<string>disabled</string>
					</array>
					<key>pfm_title</key>
					<string>Scheduled Scan</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Features</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>networkProtection</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<string>audit</string>
					<key>pfm_description</key>
					<string>Specifies if network protection is disabled, in audit mode, or enforced</string>
					<key>pfm_name</key>
					<string>enforcementLevel</string>
					<key>pfm_range_list</key>
					<array>
						<string>disabled</string>
						<string>audit</string>
						<string>block</string>
					</array>
					<key>pfm_title</key>
					<string>Enforcement level</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Network protection</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>dlp</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>exclusions</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The signing id of the application to exclude from data loss prevention.</string>
									<key>pfm_name</key>
									<string>signingId</string>
									<key>pfm_title</key>
									<string>Signing ID</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Bit flags to control the type of exclusion(s) to apply.  EPS=0x1, AX=0x2.</string>
									<key>pfm_name</key>
									<string>flag</string>
									<key>pfm_title</key>
									<string>Flag</string>
									<key>pfm_type</key>
									<string>integer</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Exclusion</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Exclusions</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>features</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>The name of a DLP feature to enable or disable.</string>
									<key>pfm_name</key>
									<string>name</string>
									<key>pfm_title</key>
									<string>Feature Name</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<string>enabled</string>
									<key>pfm_description</key>
									<string>Enable a feature up to a deployment ring (default production), or force disable a feature for all rings.</string>
									<key>pfm_name</key>
									<string>state</string>
									<key>pfm_range_list</key>
									<array>
										<string>enabled</string>
										<string>disabled</string>
									</array>
									<key>pfm_title</key>
									<string>State</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<string>production</string>
									<key>pfm_description</key>
									<string>Limit enabling the feature to a specific deployment ring.</string>
									<key>pfm_name</key>
									<string>ring</string>
									<key>pfm_range_list</key>
									<array>
										<string>insiderFast</string>
										<string>external</string>
										<string>production</string>
									</array>
									<key>pfm_title</key>
									<string>Release Ring</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>Feature</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Features</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Data Loss Prevention</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>scheduledScan</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>Check for definitions update before initiating a scheduled scan</string>
					<key>pfm_name</key>
					<string>checkForDefinitionsUpdate</string>
					<key>pfm_title</key>
					<string>Check for definitions update</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Check for definitions update before initiating a scheduled scan</string>
					<key>pfm_name</key>
					<string>dailyConfiguration</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<integer>0</integer>
							<key>pfm_description</key>
							<string>Specifies the time of day, as the number of minutes after midnight, to perform a daily quick scan.</string>
							<key>pfm_name</key>
							<string>timeOfDay</string>
							<key>pfm_range_max</key>
							<integer>1440</integer>
							<key>pfm_range_min</key>
							<integer>0</integer>
							<key>pfm_title</key>
							<string>Time of day</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<integer>0</integer>
							<key>pfm_description</key>
							<string>Specify how many hours should elapse before the next hourly quick scan. 0 indicates no hourly quick scan. 1 indicates a scan every hour. 24 indicates a scan once a day.</string>
							<key>pfm_name</key>
							<string>interval</string>
							<key>pfm_range_max</key>
							<integer>24</integer>
							<key>pfm_range_min</key>
							<integer>0</integer>
							<key>pfm_title</key>
							<string>Start time</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Daily and Hourly quick scan configuration</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>Should exclusions be ignored during a scheduled scan</string>
					<key>pfm_name</key>
					<string>ignoreExclusions</string>
					<key>pfm_title</key>
					<string>Ignore exclusions</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>Should scheduled scan be run with low priority. (Scan might take longer to complete).</string>
					<key>pfm_name</key>
					<string>lowPriorityScheduledScan</string>
					<key>pfm_title</key>
					<string>Low priority scheduled scan</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<false/>
					<key>pfm_description</key>
					<string>Run scheduled scan when the device is idle. Only applicable for weekly full scans.</string>
					<key>pfm_name</key>
					<string>runScanWhenIdle</string>
					<key>pfm_title</key>
					<string>Run scheduled scan when idle</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Should scheduled scan be run with low priority. (Scan might take longer to complete).</string>
					<key>pfm_name</key>
					<string>weeklyConfiguration</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<string>quick</string>
							<key>pfm_description</key>
							<string>Specifies the type of scan to perform.</string>
							<key>pfm_name</key>
							<string>scanType</string>
							<key>pfm_range_list</key>
							<array>
								<string>quick</string>
								<string>full</string>
							</array>
							<key>pfm_title</key>
							<string>Scan type</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<integer>0</integer>
							<key>pfm_description</key>
							<string>Specifies the day of the week to perform a weekly scan. 0 indicates never. 1-7 indicates Sunday - Saturday. 8 indicates every day.</string>
							<key>pfm_name</key>
							<string>dayOfWeek</string>
							<key>pfm_range_max</key>
							<integer>8</integer>
							<key>pfm_range_min</key>
							<integer>0</integer>
							<key>pfm_title</key>
							<string>Day of week</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<integer>0</integer>
							<key>pfm_description</key>
							<string>Specifies the time of day, as the number of minutes after midnight, to perform a weekly scan.</string>
							<key>pfm_name</key>
							<string>timeOfDay</string>
							<key>pfm_range_max</key>
							<integer>1440</integer>
							<key>pfm_range_min</key>
							<integer>0</integer>
							<key>pfm_title</key>
							<string>Time of day</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Weekly scheduled scan configuration</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>Randomize the start time of a daily and weekly scheduled scan to any interval from 0 to 23 hours.</string>
					<key>pfm_name</key>
					<string>randomizeScanStartTime</string>
					<key>pfm_range_max</key>
					<integer>23</integer>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Randomize scheduled scan start time</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Scheduled scan configuration</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Microsoft Defender for Endpoint</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>4</integer>
</dict>
</plist>
