<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>macOS LAPS settings</string>
	<key>pfm_documentation_url</key>
	<string>https://github.com/joshua-d-miller/macOSLAPS</string>
	<key>pfm_domain</key>
	<string>edu.psu.macoslaps</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2025-08-04T08:25:08Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures macOS LAPS settings</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>macOS LAPS</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_description_reference</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>edu.psu.macoslaps</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the `TopLevel` value, with an additional appended component. This string must be unique within the profile.

During a profile replacement, the system updates payloads with the same `PayloadIdentifier` and `PayloadUUID` in the old and new profiles.</string>
			<key>pfm_description_reference</key>
			<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>edu.psu.macoslaps</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_description_reference</key>
			<string>The payload type.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use `uuidgen` to generate UUIDs.

During a profile replacement, the system updates payloads with the same `PayloadIdentifier` and `PayloadUUID` in the old and new profiles.</string>
			<key>pfm_description_reference</key>
			<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable string containing the name of the organization that provided the profile. The payload organization for a payload need not match the payload organization in the enclosing profile.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>admin</string>
			<key>pfm_description_reference</key>
			<string>Local Administrator Account.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/joshua-d-miller/macOSLAPS/wiki/Configuration-Keys</string>
			<key>pfm_name</key>
			<string>LocalAdminAccount</string>
			<key>pfm_title</key>
			<string>Local Admin Account Username</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>60</integer>
			<key>pfm_description_reference</key>
			<string>Expiration date of random password.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/joshua-d-miller/macOSLAPS/wiki/Configuration-Keys</string>
			<key>pfm_name</key>
			<string>DaysTillExpiration</string>
			<key>pfm_title</key>
			<string>Days Till Password Expiration</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>days</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>12</integer>
			<key>pfm_description_reference</key>
			<string>Length of randomly generated password.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/joshua-d-miller/macOSLAPS/wiki/Configuration-Keys</string>
			<key>pfm_name</key>
			<string>PasswordLength</string>
			<key>pfm_title</key>
			<string>Password Length</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>characters</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>0</integer>
			<key>pfm_description_reference</key>
			<string>How many characters you want in each group before the separator.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/joshua-d-miller/macOSLAPS/wiki/Configuration-Keys</string>
			<key>pfm_name</key>
			<string>PasswordGrouping</string>
			<key>pfm_title</key>
			<string>Password Grouping</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>characters</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>-</string>
			<key>pfm_description_reference</key>
			<string>What Password separator you would like to use.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/joshua-d-miller/macOSLAPS/wiki/Configuration-Keys</string>
			<key>pfm_name</key>
			<string>PasswordSeparator</string>
			<key>pfm_title</key>
			<string>Password Separator</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description_reference</key>
			<string>Remove the local admin keychains after password change. This is recommended</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/joshua-d-miller/macOSLAPS/wiki/Configuration-Keys</string>
			<key>pfm_name</key>
			<string>RemoveKeyChain</string>
			<key>pfm_title</key>
			<string>Remove Keychain</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Exclude any characters you'd like from the randomly generated password.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/joshua-d-miller/macOSLAPS/wiki/Configuration-Keys</string>
			<key>pfm_name</key>
			<string>RemovePassChars</string>
			<key>pfm_title</key>
			<string>Password Characters to Exclude</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>[]!~_"|&lt;&gt;,/{}^'</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Exclude any character set you'd like from the randomly generated password.</string>
			<key>pfm_description_reference</key>
			<string>Exclude any character set you'd like by specifying a string in an array.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/joshua-d-miller/macOSLAPS/wiki/Configuration-Keys</string>
			<key>pfm_name</key>
			<string>ExclusionSets</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_range_list</key>
					<array>
						<string>letters</string>
						<string>numbers</string>
						<string>symbols</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Letters</string>
						<string>Numbers</string>
						<string>Symbols</string>
					</array>
					<key>pfm_title</key>
					<string>Character Set</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Exclusion Sets</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>AD</string>
			<key>pfm_description_reference</key>
			<string>The method to use with macOSLAPS. Default is AD for Active Directory. The other option is Local which will allow local rotation and no need to talk to Active Directory.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/joshua-d-miller/macOSLAPS/wiki/Configuration-Keys</string>
			<key>pfm_name</key>
			<string>Method</string>
			<key>pfm_range_list</key>
			<array>
				<string>AD</string>
				<string>Local</string>
			</array>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description_reference</key>
			<string>Set your preferred Domain Controller to connect to (Useful when you have RODCs).</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/joshua-d-miller/macOSLAPS/wiki/Configuration-Keys</string>
			<key>pfm_name</key>
			<string>PreferredDC</string>
			<key>pfm_title</key>
			<string>Preferred Domain Controller</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Use this key if your LAPS Admin is a FileVault user. The script will read this key in if there isn't a keyhcain entry in System keychain for macOSLAPS. Once this has been completed, the keychain entry will then be used.</string>
			<key>pfm_description_reference</key>
			<string>Use this key if you are LAPS Admin is a FileVault user. The script will read this key in if there isn't a keyhcain entry in System keychain for macOSLAPS. Once this has been completed, the keychain entry will then be used.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/joshua-d-miller/macOSLAPS/wiki/Configuration-Keys</string>
			<key>pfm_name</key>
			<string>FirstPass</string>
			<key>pfm_note</key>
			<string>macOSLAPS must know at least one password via config profile before we can start the keychain process. Setting this key before running it for the first time when it is your temporary admin password is the best method.</string>
			<key>pfm_title</key>
			<string>First Password</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>3.0.2</string>
			<key>pfm_description</key>
			<string>Specifies the password requirements.</string>
			<key>pfm_description_reference</key>
			<string>A dictionary that allows you to specify the password requirements. There are 4 keys Lowercase, Uppercase, Number and Symbol. For each you specify an integer for the amount of each that you would like in your password.</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/joshua-d-miller/macOSLAPS/wiki/Configuration-Keys</string>
			<key>pfm_name</key>
			<string>PasswordRequirements</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_app_min</key>
					<string>3.0.2</string>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>The minimum number of lowercase letters in a generated password.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/joshua-d-miller/macOSLAPS/wiki/Configuration-Keys</string>
					<key>pfm_name</key>
					<string>Lowercase</string>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Minimum Lowercase Letters</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>3.0.2</string>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>The minimum number of uppercase letters in a generated password.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/joshua-d-miller/macOSLAPS/wiki/Configuration-Keys</string>
					<key>pfm_name</key>
					<string>Uppercase</string>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Minimum Uppercase Letters</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>3.0.2</string>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>The minimum number of numeric characters in a generated password.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/joshua-d-miller/macOSLAPS/wiki/Configuration-Keys</string>
					<key>pfm_name</key>
					<string>Number</string>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Minimum Numeric Characters</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_app_min</key>
					<string>3.0.2</string>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>The minimum number of non-alphanumeric characters in a generated password.</string>
					<key>pfm_documentation_url</key>
					<string>https://github.com/joshua-d-miller/macOSLAPS/wiki/Configuration-Keys</string>
					<key>pfm_name</key>
					<string>Symbol</string>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>Minimum Symbols</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Password Requirements</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>macOS LAPS</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>5</integer>
</dict>
</plist>
