<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://github.com/macadmins/outset/releases</string>
	<key>pfm_description</key>
	<string>Outset settings</string>
	<key>pfm_documentation_url</key>
	<string>https://github.com/macadmins/outset/wiki/Preferences</string>
	<key>pfm_domain</key>
	<string>io.macadmins.Outset</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2025-07-15T13:22:02Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Outset configuration preferences</string>
			<key>pfm_description</key>
			<string>Description of the payload.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Outset</string>
			<key>pfm_description</key>
			<string>Name of the payload.</string>
			<key>pfm_description_reference</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>io.macadmins.Outset</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_description_reference</key>
			<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>io.macadmins.Outset</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string.</string>
			<key>pfm_description_reference</key>
			<string>The payload type.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_description_reference</key>
			<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>An array of usernames to add to the ignored users list</string>
			<key>pfm_name</key>
			<string>ignored_users</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_title</key>
					<string>Username</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Ignored Users</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Enable or disable wait for network</string>
			<key>pfm_name</key>
			<string>wait_for_network</string>
			<key>pfm_title</key>
			<string>Wait for network</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>180</integer>
			<key>pfm_description</key>
			<string>Specify how long Outset waits for network activity</string>
			<key>pfm_name</key>
			<string>network_timeout</string>
			<key>pfm_title</key>
			<string>Network Timeout</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Manage file verification checksums</string>
			<key>pfm_name</key>
			<string>sha256sum</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>{{key}}</string>
					<key>pfm_title</key>
					<string>Script Path</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>/usr/local/outset/login-every/example.sh</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>{{value}}</string>
					<key>pfm_title</key>
					<string>SHA256</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>6591abcec4e0bdcc75c9509cee7f6ddae0313fef00da9d19586431b88eada436</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>SHA256 Sum</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Enable or disable verbose logging</string>
			<key>pfm_name</key>
			<string>verbose_logging</string>
			<key>pfm_title</key>
			<string>Verbose Logging</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>4.2.0</string>
			<key>pfm_documentation_url</key>
			<string>https://github.com/macadmins/outset/wiki/Payloads</string>
			<key>pfm_name</key>
			<string>script_payloads</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/outset/wiki/Payloads</string>
					<key>pfm_name</key>
					<string>boot-every</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>{{key}}</string>
							<key>pfm_title</key>
							<string>Script Name</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>{{value}}</string>
							<key>pfm_title</key>
							<string>Script Data</string>
							<key>pfm_type</key>
							<string>data</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Boot-Every Action Scripts</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/outset/wiki/Payloads</string>
					<key>pfm_name</key>
					<string>boot-once</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>{{key}}</string>
							<key>pfm_title</key>
							<string>Script Name</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>{{value}}</string>
							<key>pfm_title</key>
							<string>Script Data</string>
							<key>pfm_type</key>
							<string>data</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Boot-Once Action Scripts</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/outset/wiki/Payloads</string>
					<key>pfm_name</key>
					<string>login-every</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>{{key}}</string>
							<key>pfm_title</key>
							<string>Script Name</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>{{value}}</string>
							<key>pfm_title</key>
							<string>Script Data</string>
							<key>pfm_type</key>
							<string>data</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Login-Every Action Scripts</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/outset/wiki/Payloads</string>
					<key>pfm_name</key>
					<string>login-once</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>{{key}}</string>
							<key>pfm_title</key>
							<string>Script Name</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>{{value}}</string>
							<key>pfm_title</key>
							<string>Script Data</string>
							<key>pfm_type</key>
							<string>data</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Login-Once Action Scripts</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/outset/wiki/Payloads</string>
					<key>pfm_name</key>
					<string>login-privileged-every</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>{{key}}</string>
							<key>pfm_title</key>
							<string>Script Name</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>{{value}}</string>
							<key>pfm_title</key>
							<string>Script Data</string>
							<key>pfm_type</key>
							<string>data</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Login-Privileged-Every Action Scripts</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/outset/wiki/Payloads</string>
					<key>pfm_name</key>
					<string>login-privileged-once</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>{{key}}</string>
							<key>pfm_title</key>
							<string>Script Name</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>{{value}}</string>
							<key>pfm_title</key>
							<string>Script Data</string>
							<key>pfm_type</key>
							<string>data</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Login-Privileged-Once Action Scripts</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/outset/wiki/Payloads</string>
					<key>pfm_name</key>
					<string>login-window</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>{{key}}</string>
							<key>pfm_title</key>
							<string>Script Name</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>{{value}}</string>
							<key>pfm_title</key>
							<string>Script Data</string>
							<key>pfm_type</key>
							<string>data</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Login-Window Action Scripts</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_documentation_url</key>
					<string>https://github.com/macadmins/outset/wiki/Payloads</string>
					<key>pfm_name</key>
					<string>on-demand</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>{{key}}</string>
							<key>pfm_title</key>
							<string>Script Name</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>{{value}}</string>
							<key>pfm_title</key>
							<string>Script Data</string>
							<key>pfm_type</key>
							<string>data</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>On-Demand Action Scripts</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Script Payloads</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>Outset</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
