<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_app_url</key>
	<string>https://github.com/macadmins/supportcompanion/releases</string>
	<key>pfm_description</key>
	<string>Support Companion settings</string>
	<key>pfm_documentation_url</key>
	<string>https://github.com/macadmins/supportcompanion</string>
	<key>pfm_domain</key>
	<string>SupportCompanion</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_last_modified</key>
	<date>2025-08-04T08:25:08Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Support Companion configuration preferences</string>
			<key>pfm_description</key>
			<string>The human-readable description of this payload. This description appears on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Support Companion</string>
			<key>pfm_description</key>
			<string>The human-readable name for the profile payload. The name appears on the Detail screen and doesn't need to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>SupportCompanion</string>
			<key>pfm_description</key>
			<string>The reverse-DNS-style identifier for the payload. This identifier is usually the same as the `TopLevel` value, with an additional appended component. This string must be unique within the profile.

During a profile replacement, the system updates payloads with the same `PayloadIdentifier` and `PayloadUUID` in the old and new profiles.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>SupportCompanion</string>
			<key>pfm_description</key>
			<string>The payload type, which each payload domain's reference page specifies.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The globally unique identifier for the payload. The actual content is unimportant, but must be globally unique. In macOS, use `uuidgen` to generate UUIDs.

During a profile replacement, the system updates payloads with the same `PayloadIdentifier` and `PayloadUUID` in the old and new profiles.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of this specific payload.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The human-readable string containing the name of the organization that provides the profile. This value doesn't need to match the organization payload value in the enclosing dictionary.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Home</string>
				<string>Notifications</string>
				<string>Branding</string>
				<string>Mode</string>
				<string>Tray menu</string>
				<string>Desktop Info</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Branding</key>
				<array>
					<string>BrandName</string>
					<string>BrandColor</string>
					<string>BrandLogo</string>
					<string>CustomColors</string>
				</array>
				<key>Desktop Info</key>
				<array>
					<string>ShowDesktopInfo</string>
					<string>DesktopPosition</string>
					<string>DesktopInfoLevel</string>
					<string>DesktopInfoCustomItems</string>
					<string>DesktopInfoBackgroundColor</string>
					<string>DesktopInfoBackgroundOpacity</string>
					<string>DesktopInfoColorHighlight</string>
					<string>DesktopInfoFontSize</string>
				</array>
				<key>Home</key>
				<array>
					<string>HiddenWidgets</string>
					<string>HiddenActions</string>
					<string>ShowMenuToggle</string>
					<string>SupportEmail</string>
					<string>SupportPhone</string>
					<string>SupportUrl</string>
					<string>ChangePasswordUrl</string>
					<string>ChangePasswordMode</string>
					<string>LogFolders</string>
					<string>CustomWidgetsPath</string>
				</array>
				<key>Mode</key>
				<array>
					<string>IntuneMode</string>
					<string>SystemProfilerApps</string>
				</array>
				<key>Notifications</key>
				<array>
					<string>NotificationInterval</string>
					<string>NotificationTitle</string>
					<string>NotificationImage</string>
					<string>SoftwareUpdateNotificationMessage</string>
					<string>SoftwareUpdateNotificationButtonText</string>
					<string>AppUpdateNotificationMessage</string>
					<string>AppUpdateNotificationButtonText</string>
				</array>
				<key>Tray menu</key>
				<array>
					<string>Actions</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the name shown in the navigation menu.</string>
			<key>pfm_name</key>
			<string>BrandName</string>
			<key>pfm_title</key>
			<string>Brand Name</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>AwesomeCorp</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the brand color shown in the app, available colors are: Blue, Green, Red, Orange. Defaults to Blue if not configured.</string>
			<key>pfm_name</key>
			<string>BrandColor</string>
			<key>pfm_range_list</key>
			<array>
				<string>Blue</string>
				<string>Green</string>
				<string>Red</string>
				<string>Orange</string>
			</array>
			<key>pfm_title</key>
			<string>Brand Color</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the brand logo shown in the apps side menu. Specify a local path or Base64 string.</string>
			<key>pfm_name</key>
			<string>BrandLogo</string>
			<key>pfm_title</key>
			<string>Brand Logo</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>/path/to/logo</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the URL to open when the user clicks on the Get Support button.</string>
			<key>pfm_name</key>
			<string>SupportUrl</string>
			<key>pfm_title</key>
			<string>Support Page URL</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>https://awesomecorp.support</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the URL to open when the user clicks on the Change Password button.</string>
			<key>pfm_name</key>
			<string>ChangePasswordUrl</string>
			<key>pfm_title</key>
			<string>Change Password URL</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>https://awesomecorp.support/changepassword</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the mode for the Change Password button, available modes are: local, SSOExtension, url. Defaults to local if not configured.</string>
			<key>pfm_name</key>
			<string>ChangePasswordMode</string>
			<key>pfm_range_list</key>
			<array>
				<string>local</string>
				<string>SSOExtension</string>
				<string>url</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Local</string>
				<string>SSO Extension</string>
				<string>URL</string>
			</array>
			<key>pfm_title</key>
			<string>Change Password Mode</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the email address shown when the user clicks on the Support Info button.</string>
			<key>pfm_name</key>
			<string>SupportEmail</string>
			<key>pfm_title</key>
			<string>Support Email</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>support@awesomecorp.io</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the phone number shown when the user clicks on the Support Info button.</string>
			<key>pfm_name</key>
			<string>SupportPhone</string>
			<key>pfm_title</key>
			<string>Support Phone</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>111-222-333-4444</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Configures whether to show the menu toggle button in the apps side menu.</string>
			<key>pfm_name</key>
			<string>ShowMenuToggle</string>
			<key>pfm_title</key>
			<string>Show Menu Toggle</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures which widgets to hide, available widgets are: DeviceInfo, MunkiPendingApps, MunkiUpdates, IntunePendingApps, IntuneUpdates, Storage, MdmStatus, Actions, Battery, EvergreenInfo.</string>
			<key>pfm_name</key>
			<string>HiddenWidgets</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Hidden Widgets</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures which actions to hide, available actions are: Support, ManagedSoftwareCenter, ChangePassword, Reboot, KillAgent, SoftwareUpdates, GatherLogs.</string>
			<key>pfm_name</key>
			<string>HiddenActions</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Hidden Actions</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the interval for notifications in hours for Application Updates and Software Updates notifications.</string>
			<key>pfm_name</key>
			<string>NotificationInterval</string>
			<key>pfm_range_max</key>
			<integer>24</integer>
			<key>pfm_range_min</key>
			<integer>1</integer>
			<key>pfm_title</key>
			<string>Notification Interval</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the title for notifications for notifications. Defaults to Support Companion if not configured.</string>
			<key>pfm_name</key>
			<string>NotificationTitle</string>
			<key>pfm_title</key>
			<string>Notification Title</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>AwesomeCorp</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures an image to add to notifications. Local path should be specified.</string>
			<key>pfm_name</key>
			<string>NotificationImage</string>
			<key>pfm_title</key>
			<string>Notification Image</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string></string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the message for notifications for Software Updates notifications. Defaults to "You have software updates available. Take action now! \ud83c\udf89" if not configured.</string>
			<key>pfm_name</key>
			<string>SoftwareUpdateNotificationMessage</string>
			<key>pfm_title</key>
			<string>Software Update Notification Message</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string></string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the button text for notifications for Software Updates notifications. Defaults to "Details \ud83d\udc40" if not configured.</string>
			<key>pfm_name</key>
			<string>SoftwareUpdateNotificationButtonText</string>
			<key>pfm_title</key>
			<string>Software Update Notification Button Text</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string></string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the message for notifications for App Updates notifications. Defaults to "You have app updates available. Take action now! \ud83c\udf89" if not configured.</string>
			<key>pfm_name</key>
			<string>AppUpdateNotificationMessage</string>
			<key>pfm_title</key>
			<string>App Update Notification Message</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string></string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the button text for notifications for App Updates notifications. Defaults to "Details \ud83d\udc40" if not configured.</string>
			<key>pfm_name</key>
			<string>AppUpdateNotificationButtonText</string>
			<key>pfm_title</key>
			<string>App Update Notification Button Text</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string></string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures custom colors for the app, should be specified in hex format, see example below. Do not use BrandColor in conjunction with this key.</string>
			<key>pfm_name</key>
			<string>CustomColors</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Configures the Primary Color for the app.</string>
							<key>pfm_name</key>
							<string>PrimaryColor</string>
							<key>pfm_title</key>
							<string>Primary Color</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>#00A0D0</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Configures the Accent Color for the app.</string>
							<key>pfm_name</key>
							<string>AccentColor</string>
							<key>pfm_title</key>
							<string>Accent Color</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>#45637A</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Custom Colors</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Configures the app to use Intune for application information. Only supports PKG and DMG type apps, not LOB.</string>
			<key>pfm_name</key>
			<string>IntuneMode</string>
			<key>pfm_title</key>
			<string>Intune Mode</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_app_min</key>
			<string>1.3.0</string>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Configures the app to list all applications installed under /Applications and their versions. Useful if Munki or Intune is not used.</string>
			<key>pfm_name</key>
			<string>SystemProfilerApps</string>
			<key>pfm_title</key>
			<string>System Profiler</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the log folders to gather logs from. Only used when gathering logs. Defaults to "/Library/Logs/Microsoft" if not configured.</string>
			<key>pfm_name</key>
			<string>LogFolders</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>/Library/Managed Installs/Logs</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Log Folders</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures custom actions to add to the tray menu. See example below.</string>
			<key>pfm_name</key>
			<string>Actions</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Name of the action to show in the menu.</string>
							<key>pfm_name</key>
							<string>Name</string>
							<key>pfm_title</key>
							<string>Name</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>Awesome command</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>Command to run when to item is clicked.</string>
							<key>pfm_name</key>
							<string>Command</string>
							<key>pfm_title</key>
							<string>Command</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>killall pboard</string>
						</dict>
						<dict>
							<key>pfm_app_min</key>
							<string>1.3.0</string>
							<key>pfm_description</key>
							<string>Icon to show in the Self Service page in the UI.</string>
							<key>pfm_name</key>
							<string>Icon</string>
							<key>pfm_title</key>
							<string>Icon</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_value_placeholder</key>
							<string>Restart</string>
						</dict>
					</array>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Actions</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<false/>
			<key>pfm_description</key>
			<string>Configures the desktop info widget.</string>
			<key>pfm_name</key>
			<string>ShowDesktopInfo</string>
			<key>pfm_title</key>
			<string>Show Desktop Info</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>TopRight</string>
			<key>pfm_description</key>
			<string>Configures the position of the desktop info. Defaults to TopRight.</string>
			<key>pfm_name</key>
			<string>DesktopPosition</string>
			<key>pfm_range_list</key>
			<array>
				<string>TopLeft</string>
				<string>TopRight</string>
				<string>BottomLeft</string>
				<string>BottomRight</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Top Left</string>
				<string>Top Right</string>
				<string>Bottom Left</string>
				<string>Bottom Right</string>
			</array>
			<key>pfm_title</key>
			<string>Desktop Position</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the level of information to show on the desktop. Defaults to Full.</string>
			<key>pfm_name</key>
			<string>DesktopInfoLevel</string>
			<key>pfm_range_list</key>
			<array>
				<string>Full</string>
				<string>Minimal</string>
				<string>Hardware</string>
				<string>Custom</string>
			</array>
			<key>pfm_title</key>
			<string>Desktop Info Level</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>If DesktopInfoLevel is set to Custom, use this array to determine which information to show. Available info are: HostName, Model, SerialNumber, Processor, IpAddress, MemSize, OsBuild, OsVersion, LastBootTime, StorageInfo, SupportPhone, SupportEmail, Separator.</string>
			<key>pfm_name</key>
			<string>DesktopInfoCustomItems</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Desktop Info Custom Items</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures the background color for the desktop info. Configure using Hex format. Defaults to Transparent</string>
			<key>pfm_name</key>
			<string>DesktopInfoBackgroundColor</string>
			<key>pfm_title</key>
			<string>Desktop Info Background Color</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>#000000</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<real>1</real>
			<key>pfm_description</key>
			<string>Configures the position of the desktop info. Defaults to 100%.</string>
			<key>pfm_name</key>
			<string>DesktopInfoBackgroundOpacity</string>
			<key>pfm_range_list</key>
			<array>
				<real>0.1</real>
				<real>0.2</real>
				<real>0.3</real>
				<real>0.4</real>
				<real>0.5</real>
				<real>0.6</real>
				<real>0.7</real>
				<real>0.8</real>
				<real>0.9</real>
				<real>1</real>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>10%</string>
				<string>20%</string>
				<string>30%</string>
				<string>40%</string>
				<string>50%</string>
				<string>60%</string>
				<string>70%</string>
				<string>80%</string>
				<string>90%</string>
				<string>100%</string>
			</array>
			<key>pfm_title</key>
			<string>Desktop Info Background Opacity</string>
			<key>pfm_type</key>
			<string>real</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Configures whether to highlight the text in the desktop info. Defaults to true.</string>
			<key>pfm_name</key>
			<string>DesktopInfoColorHighlight</string>
			<key>pfm_title</key>
			<string>Desktop Info Color Highlight</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>17</integer>
			<key>pfm_description</key>
			<string>Configures the font size for the desktop info. Defaults to 17.</string>
			<key>pfm_name</key>
			<string>DesktopInfoFontSize</string>
			<key>pfm_range_max</key>
			<integer>24</integer>
			<key>pfm_range_min</key>
			<integer>8</integer>
			<key>pfm_title</key>
			<string>Desktop Info Font Size</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Configures a path to a JSON file containing custom widgets to show on the Home view.</string>
			<key>pfm_name</key>
			<string>CustomWidgetsPath</string>
			<key>pfm_title</key>
			<string>Custom Widgets Path</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_value_placeholder</key>
			<string>/Library/Application Support/SupportCompanion/awesomecorp.json</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>Support Companion v1</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>6</integer>
</dict>
</plist>
